				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Vegetarian Refried Beans"
,"datePublished": "2019-04-02T02:48:06.000-04:00"
,"dateModified": "2023-01-07T20:27:51.000-05:00"
,"author": [
{"@type": "Person"
,"name": "what's for dinner"
,"url": "https://www.allrecipes.com/cook/1649560"
}
]
,"description": "This traditional vegetarian and vegan refried bean recipe tastes great with hardly any fat! You can sprinkle in Monterey jack cheese if you&#39;re vegetarian."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/CtrACMBNxX7NOj-KeZwXCVYuedE=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/5370505-vegetarian-refried-beans-Buckwheat-Queen-4x3-1-f3c3daa653de4ccdb2210d166c6fa989.jpg",
"height": 1125,
"width": 1500
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Vegetarian Refried Beans"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.5",
"ratingCount": "150"
}
,"cookTime": "PT255M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "161 kcal"
,"carbohydrateContent": "25 g"
,"fiberContent": "6 g"
,"proteinContent": "9 g"
,"saturatedFatContent": "0 g"
,"sodiumContent": "595 mg"
,"sugarContent": "1 g"
,"fatContent": "3 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT15M"
,"recipeIngredient": [
"1 pound dry pinto beans, rinsed",
"2 tablespoons minced garlic, divided",
"1 medium tomato, diced",
"2 tablespoons ground cumin",
"1 tablespoon chili powder",
"2 tablespoons olive oil",
"salt to taste" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Place beans in a large saucepan and cover with water by 1 inch. Place over high heat and bring to a boil. When beans come to a boil, drain and return them to the same pot."
} ,{
"@type": "HowToStep"
,"text": "Cover beans with water by 2 inches; stir in 1 tablespoon garlic, tomato, cumin, and chili powder. Bring to a boil over high heat, then reduce heat to low, and simmer until beans are very soft, about 3 hours and 45 minutes, adding water as needed."
} ,{
"@type": "HowToStep"
,"text": "Once beans have cooked, mash them with remaining garlic, oil, and salt; add water as needed to achieve desired consistency. Place over low heat for 30 minutes, stirring occasionally."
} ]
,"recipeYield": ["12"]
,"totalTime": "PT270M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Katherine Campbell"
},
"reviewBody": "I have made these beans for many family get-togethers and people always say they are the best beans they have ever had. I’ve got a small party (Covid style) coming up this weekend and you know what’s on the menu!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Furbalotopus Furbamayovich"
},
"reviewBody": "Really good! I didn't have pinto beans, so I used kidney beans instead, and it was delicious. I didn't measure the garlic very carefully, so mine was a bit heavy on the garlic. Also, I tried mashing the beans using a potato masher, but that wasn't super effective. I thought about using an electric mixer, but ours is lost (sigh). So I ended up putting the beans and liquid in my blender, which made a great savory smoothie. I approached my kids with a spoonful of the mixture, and asked them if they wanted to try my new smoothie, and they all made weird faces until I told them it was refried beans. Anyway, my refried beans were a little thin, so I put them in a saucepan and left them to simmer. They reduced nicely, and were really delicious in our bean and cheese burritos."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Chuck"
},
"reviewBody": "This has become my go-to recipe for homemade bean &amp; cheese burritos which I have found tastes better and is healthier than store-bought ones.\n \nThe only change to the original recipe is that I add a small can of green chili's as well as about 4 ounces of grated cheddar cheese to the mix along with the olive oil and POWDERED rather than minced garlic for the second addition."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "amyjojo"
},
"reviewBody": "These were the flavor of what I might call ranch beans, or even what you would find in a can of chili beans. The cumin was very prominent."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sydspinnin"
},
"reviewBody": "This was great and I will be making this recipe on a regular basis as refried beans are a staple in our house. The only thing I changed was cooking the beans in stock instead of plain water. The flavor is fantastic, though I'm sure plain water is just as good. In the future, I can see using my Instant Pot or stovetop pressure cooker to expedite cooking, but don't skip the overnight soak. This is key to bean digestability."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Holly Molinari"
},
"reviewBody": "Big hit wih the whole family. Making another batch now!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Buckwheat Queen"
},
"reviewBody": "I reduced the garlic and made these in a pressure cooker. I thought they were quite good like this. They took less time to cook. After mashing them with a potato masher, they didn’t need 30 minutes to cook. After about five minutes they were more than ready. Thank you for the recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Future Vegan"
},
"reviewBody": "I'm probably going full vegan and this may be a prime staple for protein. I used the garlic, chili powder, beans and oil, but I didn't put in the other stuff. Also, I cooked it a different way: I soaked the beans for 6 hours, as another recipe recommended, and then the cooking time is 1 1/2 hours tops. I think that might save on energy.\n\nIt was bland to me and I want some kick so next time I'm getting 1 or two jalapeños. For this time, I put a little medium salsa in the one bowl and it tasted good.\n\nThis is sooo inexpensive and it's healthy because I can put the amount of salt in that I want. I can even leave out salt, which I'll try next time: This time I had little."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Savannah Speer"
},
"reviewBody": "Ok but I'd cut the oil in half. I could taste the oil through the beans. Also subtract a little salt. you can always add more later."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kim M."
},
"reviewBody": "Haveade these several times now. Great every time, I usually make just as recipe states, but have left out tomatoes a couple times. Still comes out good. Thank you for this."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Gina Shelhamer"
},
"reviewBody": "I followed the recipe exactly and even cooked for 2 hours longer but the beans never got soft enough. They remained crunchy. I will stick to the slow cooker recipe on this site. Wish I knew what I did wrong :("
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Million Dollar Mateo"
},
"reviewBody": "??????"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Doober Steele"
},
"reviewBody": "This recipe worked out just fine for me."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lorissa"
},
"reviewBody": "my kids love this I use cans of black beans instead of pinto."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Robyn & Kenny"
},
"reviewBody": "My Wife and I had this last night along with homemade Spanish rice, tostadas (with guacamole, lettuce, salsa and freshly boiled [and shredded] chicken) and it was just out of this world good. We were so full that we couldn't do anything else but sit on the couch and watch a movie. Great recipe! Thank you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jan"
},
"reviewBody": "Thank you for this recipe. It is similar to the recipe on the bag of beans, but better. The only thing I did different was to soak the beans overnight to reduce the initial cooking time and I stirred in some canned enchilada sauce for extra saucy-ness because I took these to a Mexi-style potluck and I didn't want these to dry out in the crockpot. Shredded cheddar cheese served on the side. Yumm, they were a hit!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "bandita"
},
"reviewBody": "Once you try this, you'll never want to go back to canned beans. So basic, yet so flavorful and healthy. I made this for a Nacho Sale fundraiser, and even though I had more then my counterpart, who made his with fat, I ran out. I got a lot of compliments. The only thing I did different then this recipe was that I sauteed some onions with the garlic, and after the beans softened up, I blended them a little before the last 30 minutes of cooking. I didn't blend them to the point of being mushy, but to where the beans were in small pieces."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "camohn"
},
"reviewBody": "Added pepper. Too much cumin for me so added A third can of beans and more tomato yo tone it down. Liked it at that point"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Chai"
},
"reviewBody": "Original recipe is great as a base recipe. From the original you can explore different ingredients and get a feel for what you want. I read a bunch of comments and adjusted some things... I made one pound of kidney beans an one pound of pinto beans. Half chicken broth. Halved garlic, cumin and chili powder - forgot to add olive oil. Added half a jalapeno (Diced) , some salsa and blended half of the beans after realizing I would not be able to mash the whole thing with a wooden spoon."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jen the Vegetarian"
},
"reviewBody": "Good! I also added a diced onion to cook with the beans. When they were done cooking, I ran everything through my food processor and added about a cup of sour cream and a few Tbsp of taco seasoning (go Taco Bell!)."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Cakeatron"
},
"reviewBody": "Good minus the tomato. I like to make these using left over pinto bean soup. I am NOT a veggie only type person so I make my soup with pinto beans, ham, and seasoning salt in the crockpot."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "erinjanice"
},
"reviewBody": "Pretty tasty &amp; easy. I quartered the recipe to use just one can of beans, omitted the tomato and salt and used garlic powder because I didn't have time to chop anything. I added extra oil trying to get the right consistency...then I realized it said to add water :P I did and it looked perfect, but by the time we were ready to eat they had dried out a bit. So next time I'll watch more closely and add more water. But good flavor! They'll go with anything."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "lilskittle7"
},
"reviewBody": "I did a few things differently, but they turned out pretty good. I omitted the tomato, put in just a little bit more garlic, and used half water and half chicken broth for flavour. \n\nI also made mexican rice with this, so when I was adding liquid to achieve the consistency, I used some of the juice from the diced tomatoes I used in the rice. \n\nOverall a great recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kaylee Flores"
},
"reviewBody": "Amazing, I used a dollop of vegetable bullion paste I had but otherwise I stuck to the recipe and they were the best beans I've ever had, even got rave reviews from my Mexican father-in-law!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "erin1921"
},
"reviewBody": "Really tasty... make sure to soak beans overnight and allow plenty of time to cook or you'll have little crunchy bits :("
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Christina Smith"
},
"reviewBody": "No more canned beans for us. I freeze this in small batches and pull some out for taco nights."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jeanette H"
},
"reviewBody": "Delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rachel Miesch"
},
"reviewBody": "I will never buy a can of refried beans again!! This was delicious!! It does take a while to make, and you really have to keep an eye on it toward the end, but it's so worth it!!! I think next time I'm gonna add fresh diced jalapeno when I add the tomato! yummmmmy!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "HeaCan"
},
"reviewBody": "After all of the raving reviews, I was really surprised on this one. I ran them through a food processor and they were really bitter and unpleasant tasting. I added a lot of salt, chicken broth, and cheese and it made them okay. I will never make these again. Not worth the 4+ hours of effort."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "RoseRover"
},
"reviewBody": "These were easy to make, but I thought that the cumin overwhelmed the flavours. I would rather taste more garlic. For all the garlic that was in here, I didn't think the flavour stood out."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sarah Jo"
},
"reviewBody": "Instead of cooking the beans in water, I cooked them in organic chicken broth. I did not have extra tomatoes as all I had on hand was used for the Enchilada Casserole so I left it out. Even without the tomato, these turned out perfect. I'd like to try this with grated onion next time and saute the onion and garlic in the olive oil before mashing it into the beans. I think that would be a tasty addition to this recipe. Thanks, what's for dinner for a cheap and economical (nevermind tastier than the canned counterpart) side for tonight's Enchilada Casserole and mexican rice!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "tfnukin"
},
"reviewBody": "Excellent- shaved 3+ hours and a lot of energy with pressure cooker."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jenbeth"
},
"reviewBody": "Really good and really easy. I substitued Chicken broth for the water to cook the beans in. Turned out great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Annie Bida"
},
"reviewBody": "This is great! Worked perfectly! What a great way to cook in a healthy, ethical and cheap way. Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "norm vandyke"
},
"reviewBody": "This recipe is delicious! :D I just wish there were more stars to add to this simple and wonder recipe! I did add some diced jalapeño as well, but that just because I like it spicy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Dani Lefebvre"
},
"reviewBody": "I thought there was way to many spices in this and didn't taste anything like what comes in the can. I will cut down on the cumin for sure next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lynn"
},
"reviewBody": "Great recipe! I made it as written except no tomatoes. I guessed on the amount of beans (I had already been soaking them overnight when I found this recipe; oops!) so mine ended up pretty garlicky but very good. I took some out before putting through the blender and ate on brown rice pasta - really good, too. Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "AZAlyssa"
},
"reviewBody": "The only downside to this recipe is the time required. Good flavor, but not so overpowering that you couldn't use the beans in a variety of dishes. If you do the quick-soak method, be warned that using 2 inches of water to cover after soaking will produce very runny beans. I forgot to adjust for that and had to cook them down longer at the end."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "EriNnRuss"
},
"reviewBody": "Yum! I put mine in my slow cooker, and put about an inch and half of water over it, and let it go for about 7 hours on low. Couldn't have been simpler!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "shah-zion"
},
"reviewBody": "Delicious! I also added a tablespoon of smoked paprika with the cumin and chili powder. My kids asked for thirds!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Denise Gray"
},
"reviewBody": "So much better than canned!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sheila"
},
"reviewBody": "This is an easy recipe for refried beans...I love it !! I've always used refried beans from the can...but no longer do after finding this recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ZOPOOH"
},
"reviewBody": "Fantastic! This will forever be in my arsenal. Tasted just like the vegetarian beans we normally buy for a fraction of the cost."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cookiecutter"
},
"reviewBody": "This tasted amazing. I used a batch of pinto beans we had cooked the day before, and blended the other ingredients in the Vitamix to a paste. You could probably use a blender. Then I added the mixture to the beans and let the whole thing cook for about 45 mins or so. Mashed the beans, seasoned with salt and then was ready to serve. Delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "southernhopsing"
},
"reviewBody": "This is a very easy, tasty, and healthy recipe. I will be using part of the beans tonight for shrimp tacos (from this site) and the rest with burrito pie later in the week. Very flavorful. Thanks for posting."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jennifer Andrejcak"
},
"reviewBody": "This tasted just like refried beans from a mexican resturant! I didn't use the whole amount of cumin or chili powder it called for and I added salsa because I didn't have a tomato. I also took advice from another reviewer and I pureed 1/2 of the mix and mashed the other half the cooked it the remaining time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Asia Burk"
},
"reviewBody": "well darn it! I have made these a few time's.I WILL! NEVER go back to caned bean's again,they have a funky after taste to them.nasty! with making your own there like making mashed potatoes from scratch. you can make them as thin or as thick as you like.you can mash or whip them in the blinder. awesome."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dancing Dhianna"
},
"reviewBody": "Very easy and tasty."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Jennifer"
},
"reviewBody": "Good flavor but were a little dry. I don't know if that was my fault because this was my first time making them but I will try them again. Thanks for the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Michelle Rosenthal"
},
"reviewBody": "Very good, easy to make and inexpensive"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Helen Gohlke"
},
"reviewBody": "Very easy to make! I made this recipe exactly as stated and it turned out well. I may add peppers next time for a more spicy flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kimberly L. Davidson Dodd"
},
"reviewBody": "YUM! Made in the crock pot but it took a whole lot more time than noted. I cooked mine for about 10 hours."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Michelle"
},
"reviewBody": "I am tring to avoid canned food b/c of the chemicals in the, so I tried tihs recipe. It is so simple and yummy. I did have to add a lot of salt at the end, but all in all, a wonderful easy recipe. Thank you!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BabyDollPie"
},
"reviewBody": "Delicious. I put mine (dry beans) in the slow cooker all day and they come out devine. Thanks a lot for the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Czicks"
},
"reviewBody": "Good recipe for refritos. Sadly the amount of time it takes to cook doesn't really justify making it from scratch vs. opening a can."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "cardboardboxes"
},
"reviewBody": "I made this in a crock pot (because I'm lazy), and it turned out great. I took a bunch to a Mexican-style potluck and it was gobbled up in no time!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KIRAPOULSON"
},
"reviewBody": "What a way to enhance any Mexican dish. These taste so much better than any can of refried beans I have ever had. I put all the ingredients in a food processor. They came out a bit runny but when mixed with meat, perfect! Will always make. No cans for me!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "csteel99"
},
"reviewBody": "Great beans. No more refried beans out of a can ever again. This recipe will be used for in our family for years ahead. Thanks"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KK"
},
"reviewBody": "OMIGOD! Awesome!! These are toooo good. I can't believe how a little tomato and garlic can give such a wonderful flavour. Better than my favourite restaurant. I followed the recipe exactly - just reduced the oil quantity a little. Thanks a lot for sharing this!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "shawn"
},
"reviewBody": "very good, but I think the cumin maybe a little much, this was easy but not sure if I will make again"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mooingfish"
},
"reviewBody": "I put the dried beans in a pressure cooker to speed up time and use less energy. I soaked 2 cups dried beans overnight and processed in the cooker for 6 minutes the next day. I then drained the water and added the rest of the ingredients to the beans. I used a potato masher, but should have used a food processor for a smoother consistency. Then I added one cup of the juice/water left over from the cooker and let everything simmer for about 30 minutes. It was okay, but I thought it lacked something. Maybe it didn't taste right because I used the pressure cooker and didn't boil them for hours."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sierrawr"
},
"reviewBody": "I didn't have time to cook the beans, so instead I used a can of refried beans and added some red peppers to the rest of the ingredients, and I must say that these beens were simply fantastic! I used them on top of the Authentic Huevos Rancheros recipe and it was so tasty! Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Bonnette McNichol Lepley"
},
"reviewBody": "This was my first time making refried beans. These were easy to make. I followed the recipe other then I used a can of diced tomatoes. Mine only took two hours to cook. I had to add a lot of extra water while cooking which decreased the taste from the chili powder and cumin. Hubby thought they were a bit bland tasting."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Lalima08"
},
"reviewBody": "Using pressure cooker -- for 4-5 whistles before letting it cool slightly, enough to open -- then 'refry' the beans with the spices cuts down the time by half. A can of diced tomato is a good substitute, too. My hubby and bro-in-law loved it. We put it under and on top of warm nacho, too, just like in restaurants."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allen Seidman"
},
"reviewBody": "Excellent. We did make a few minor changes. We used 3 medium sized cans of Pinto Beans instead of dry beans and we added some dices onions.. Overall the recipe was superb and very easy when done with the canned beans !"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "bella888"
},
"reviewBody": "Fantastic! I used a can of diced tomatoes with zesty jalepenos instead of a fresh tomato and I left out the oil to healthify the recipe even more. Very good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "terra"
},
"reviewBody": "I think I'm done buying store bought. I skipped the tomato b/c I didn't have one and, forgot to put the garlic in during the simmer, and didn't want the oil. Loved it none the less."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "mermaid"
},
"reviewBody": "Good. I can't have garlic, so subbed shallots instead. Beans that haven't soaked will be tough. Soak overnight and throw out that water. Replace with fresh water and continue with the recipe. Or bring beans to a boil. Let sit for an hour or two, then toss that water. Use fresh water and proceed with recipe. Or just use canned beans. Changing the water will take the toot out of the beans. Also, be sure not to add the salt until the beans are almost cooked through. If you add it early, the beans will be tough. If using canned beans, you won't need to add salt as there is plenty in the beans already."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "bsbtebkorn"
},
"reviewBody": "this recipe, although time-consuming, was fantastic! the flavors worked well together. the only thing was it was a little to dry for my taste, not as creamy as expected. next time i will cook the beans longer and add a bit more oil."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Laura Ludlow Franklin"
},
"reviewBody": "This makes a lot!! I have never made homemade beans before and had fun with this. Next time I will cut the recipe since it is just my husband and I eating."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "kj421"
},
"reviewBody": "Love this recipe! I've switched it up a bit each time I've made these beans and they get better each time I make them!!! My family has requested no more cans of refried beans!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Laura"
},
"reviewBody": "As is this recipe is a great base to start with but tasted to me like it needed something. Next time, I will try replacing the tomato with a cup of salsa for some spice."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "nicole"
},
"reviewBody": "This was the BEST bean recipe I found and tried on allrecipes! Incredible. I did however add about 1 tbs. more garlic, 1/4 chopped onion, and I when it says \"cover 2 inches water\", I actually used half water, half chicken broth er so. MAKE THESE BEANS!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "CLEO"
},
"reviewBody": "I will never buy refried beans again!This was so easy. I cooked them in my crock pot on low all day and blended them with my hand mixer. I did add some extra spices. They were very tasty. Great recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "AmberS"
},
"reviewBody": "Its smells great, but I added onion does that sound good? :) Great simple recipe I had everything on hand. We are gonna make lunch burritos and freeze them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nicole"
},
"reviewBody": "This recipe was great!!! this was my first time making beans like this and i was shocked at how wonderfull it came out. I followed the instructions exactly but i added a few more ingediants. I added a full onion cut in half a full tomato and a couple cloves of garlic oh and some cilantro leaves. They veggied basically disinigrate and just become part of the water mmmmmmmm it was so goood&gt; these beans have so much flavor you dont even need to refry them!!! dont forget to add salt though. Salt is key. Always taste your water until its at the point you want it!! Also flavor takes time to come to its full effect so dont be dissapointed if taste it the first five minutes after you incorperated everything and dont love it trust be IT GETS SOOO GOOOOD!! in time.. :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This is really good! And very easy. The only reason I'm not giving it a 5 is that the taste was a little off until I added some taco seasoning (recipe also from this site). After that, perfect!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LISAJI"
},
"reviewBody": "This was simply wonderful. We usually buy the canned Rosarita refried beans, but no more. I made these yesterday and had bean burritos for dinner last night. It was quick, cheap and very filling. Thanks again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jodi Gillaume"
},
"reviewBody": "I don't like refried beans but my husband loves them. He wanted me to make him some so I tried this recipe. I am so glad I did, I now love refried beans as long as I make this recipe. I did it a little different because I needed some beans for something else so I soaked my beans overnight then I drained the water and when I was ready to make supper I cooked my beans with the cumin and chili powder for about 1 hour to 1 hour and 30 minutes. When they were almost done (tender) then I put in the tomatoes and garlic and finished cooking them. When the beans cooled I put them in a food procesor with the remaining garlic, oil and salt. I also used the cooking water for my desired consistancy!! Which is creamier than in the store."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jess"
},
"reviewBody": "Tasted good- not as flavorful as i was hoping. I added some onion and omitted the olive oil-- i don't think it needs much oil if any at all after tasting it without any. Used a food processor instaed of mashing the beans for a smoother texture."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Colleen"
},
"reviewBody": "Pretty good basic recipe. I used a pressure cooker to cook the beans down (it cuts down on the cooking time by more than half the time!) and added more spice than what was called for."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jennifer Jaye Horwitz"
},
"reviewBody": "I did not have pinto beans so I used canned black beans and it came out delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "appleallen"
},
"reviewBody": "Quick &amp; cheap recipe, we don't buy canned beans anymore. I add a small can of diced green chilis &amp; it lends a great flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "JanMcD"
},
"reviewBody": "Very good as written. It's easy to vary the taste according to your personal preference. I personally like more cumin, onion and garlic in mine."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "chrisatch"
},
"reviewBody": "Delicious! Easy! Healthy! Next time I'll double the batch!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "MLW03"
},
"reviewBody": "tasty, simple, healthy, and inexpensive. just what i'm looking for in a recipe. i don't have a food processor, so i used a potato masher - it worked pretty well, yeilding a very thick mixture. i served this in some corn tortillas (thus yielding a complete protein in a vegetarian meal). a very nice variation on the pinto bean, which i eat a lot of as a poor grad student!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Erin"
},
"reviewBody": "I used canned pintos so I could skip 3 hrs and 45 minutes of cook-down time. Turned out good, but slightly too spicy for this gringo."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Michelle"
},
"reviewBody": "These are so easy, and my family loves them. To spice them up a bit, I add a good sprinkling of kosher salt early on, and also a small can of diced mild green chiles. I use nowhere near the amount of garlic called for. I use about 1/4 teaspoon. Thanks for the easy, easy, yummy recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lorena"
},
"reviewBody": "I loved this recipe!!! It was my first time making refried beans and they came out sooo good!! cut down on cumin and chili powder; added onions and green pepper. Used this to make the seven layer taco dip (you can find the recipe at this site) and got rave reviwes!!! \nThank you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "firelinea"
},
"reviewBody": "We thought these beans were just ok plain. They did however taste pretty good with taco meat and rice. There is a good chance we just dont like pinto beans. Will try again with another kind of bean."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "TALL MOM"
},
"reviewBody": "I never made refried beans before,wow did this come out great. The taste compared with my favorite beans at the local Mexican Resturant. Used some of the refried beans to make beef and bean enchilidas, great, my husband asked for more!!! I followed the recipe to the letter. It deserves *****"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "ma_hee"
},
"reviewBody": "these were very tasty!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "NOVOSELR"
},
"reviewBody": "I left out the tomato and it was great. I've made a crock pot version of refried beans before so experimented and left these cooking overnight on low on the stovetop (so I could go to sleep) and they turned out great - didn't burn and I didn't have to wait up! Fantastic find."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Diyeana"
},
"reviewBody": "I like that you don't have to soak the beans overnight for this great tasting recipe. I used a can of Rotel tomatoes and of course, lots of salt. Taste, taste, taste until it is salted correctly. The beans were used to make tostadas."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sarah D"
},
"reviewBody": "Tasty!!! I even used canned beans."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Pacha"
},
"reviewBody": "Great stuff! So flavourful. I made it with black beans, but otherwise followed the recipe. Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "zoey alexis"
},
"reviewBody": "Very easy to make while at home, just let simmer and go about your business. I cut my beans off at around 3 hours and they were fine, added some onions as well and were perfect with my spinich enchiladas! Only four stars because there wasn't anything too extra special about these beans, just home made and better for you than out of a can!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "WHATTAPEACH"
},
"reviewBody": "I made these today and they were excellent. I did leave the tomato out and I cut the oil in half, but they were still fantastic. I also pureed the entire mixture. I will use it for a seven layer dip and to make quesadillas. I'm really excited to have a great recipe in my collection. I will use it all the time!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "cookin' leighty"
},
"reviewBody": "These were ok. I have to admit that I didn't take the onions out, they had been cooked so long that I figured it wouldn't make a difference, but my beans turned out a bit sweet. Hmmmm. Next time I will make sure and remove them to see if there is a difference."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/95736/vegetarian-refried-beans/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/81/side-dish/",
"name": "Side Dish"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/220/side-dish/beans-and-peas/",
"name": "Beans and Peas"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/95736/vegetarian-refried-beans/",
"name": "Vegetarian Refried Beans"
}
}
]
}
}
, "about": [
]
}
]