				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Vegetable Chowder"
,"datePublished": "1999-01-12T22:55:56.000-05:00"
,"dateModified": "2019-04-03T23:22:58.000-04:00"
,"author": [
{"@type": "Person"
,"name": "TALL MOM"
,"url": "https://www.allrecipes.com/cook/435286"
}
]
,"description": "In this recipe, a variety of fresh vegetables are cooked in chicken broth and combined with a creamy cheddar cheese mixture which is seasoned with chopped parsley and ground black pepper."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/4zeAewty7Ipn-136hxIML1OsK4o=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/2525491-65385eee2f6645fd8b53f2f2c6e37ccc.jpg",
"height": 960,
"width": 960
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Vegetable Chowder"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.7",
"ratingCount": "315"
}
,"cookTime": "PT35M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "341 kcal"
,"carbohydrateContent": "16 g"
,"cholesterolContent": "55 mg"
,"fiberContent": "2 g"
,"proteinContent": "16 g"
,"saturatedFatContent": "12 g"
,"sodiumContent": "927 mg"
,"sugarContent": "5 g"
,"fatContent": "24 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT15M"
,"recipeIngredient": [
"0.5 cup chopped red bell pepper",
"0.5 cup chopped onion",
"0.25 cup margarine",
"1 cup chopped celery",
"1 cup cauliflower, chopped",
"1 cup diced carrots",
"1 cup fresh chopped broccoli",
"3 cups water",
"3 cubes chicken bouillon",
"0.5 cup all-purpose flour",
"1 tablespoon chopped fresh parsley",
"3 cups shredded Cheddar cheese",
"salt to taste",
"ground black pepper to taste",
"1.5 cups milk" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "In a Dutch oven or soup kettle, saute the pepper and onions in butter or margarine until tender."
} ,{
"@type": "HowToStep"
,"text": "Add remaining vegetables, water, bouillon, salt, and pepper; bring to a boil. Reduce heat; simmer covered for 20 minutes, or until the vegetables are tender."
} ,{
"@type": "HowToStep"
,"text": "Combine flour and milk until smooth; stir into pan. Bring soup to a boil; cook and stir for 2 minutes. Mix in the parsley. Just before serving, stir in the cheese until melted."
} ]
,"recipeYield": ["7"]
,"totalTime": "PT50M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ginny Keast"
},
"reviewBody": "This is a favorite recipe of mine. It's easy, flavorful, great comfort food. I also like that you can really do anything you want with it. A lot of times I replace the cauliflower with potato, for instance. This is our first fall like day and I've got it on the stove already!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Erica McLean"
},
"reviewBody": "I thought it was bland, even after adding garlic. I decided it is a great soup base though. I added canned crab, bacon and seafood seasoning to make it a more traditional chowder."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allie H."
},
"reviewBody": "Oh wow was this good! I did make changes - I used olive oil instead of margarine, frozen riced cauliflower instead of chopped, frozen broccoli, 32oz of chicken broth instead of bouillon cubes and water, and just a handful of cheese. I also used way more veggies than the amounts called for. This recipe is a keeper - it was even better the next day. Super simple and really delicious!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Annie Douglass Lima"
},
"reviewBody": "I added herbs de Provence for flavor and left out the celery, since one of my guests is allergic to it. The soup was delicious! Everyone raved about it (more than the main course), and not a bite was left over!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "NLCHIPMAN"
},
"reviewBody": "Surprisingly Good! \nI was looking for a way to use up the carrots, cauliflower, onions and celery I had in my fridge - and found this recipe. The ingredients seemed pretty simply so I wasn't optimistic there would be much flavor, but it was surprisingly good. \nI did add about a teaspoon of tarragon just for fun... and then forgot to add the cheese before serving. \nI served it with freshly baked biscuits on a rainy do to my husband and stepfather, neither of which are big vegetable fans. Both said it was really good and even asked for seconds."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "BioNerd"
},
"reviewBody": "So good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lori"
},
"reviewBody": "This is a great soup as written. I tried to lighten it up a little. I used boxed chicken broth instead of water and bouillon. I also didn’t have any celery, so I used a little more cauliflower, carrots, and broccoli to make up for it. I did let it simmer for 20 minutes because I wanted the veggies super soft. After the 20 minutes, I used my immersion blender to make it all a smooth bisque. Instead of milk and flour, I used more broth and cornstarch to thicken it. I added 2 cups of cheddar cheese, but I think after tasting it that I could have used less. I know that it’s not a chowder anymore, but instead it’s a creamy, satisfying, lower calorie option."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ssm"
},
"reviewBody": "I just made this for the second time in less than a week. Yes. It's that good. The first time I left out the red peppers because the hubster hates them. Added a few cubed new potatoes because hey, it's a chowder. It was delicious! Even my veggie loathing husband raved. The second time I made it I added corn. It was even more delicious! I'm thinking chunks of crab meat would take it up even another notch. \nIt's easy. It's basically foolproof. It's versatile. It's a crowd pleaser. It's a keeper!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dee Anna Swanson"
},
"reviewBody": "Soooo yummmm!!! This is now my favorite soup and potato slips to 2nd place. LOL It is that good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Rajjae Lawrence"
},
"reviewBody": "I think this is a great base recipe to make whatever veggie chowder you want. I decided on broccoli and corn and it was amazeballs. I only added 3 tablespoons of flour and 1 cup of milk after reading a few reviews. Overall I'd say it's a winner. Def keeping this recipe on hand. Had it been a cold fall evening I'd be cuddled up with a bowl of this!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jamie Valocchi"
},
"reviewBody": "Added diced butternut squash and parsnips...YUM"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Christy Allen"
},
"reviewBody": "Delicious! Any veggies the kids usually don't eat I just pureed and added, they ate every bit. So yummy!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cora Lynn"
},
"reviewBody": "I subbed potatoes for cauliflower, added chicken, and mixed the cheese into the roux before adding it to the broth. I also used chicken broth instead of bouillon, everything was tasty!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Diane Dolce"
},
"reviewBody": "Great recipe and you can play with some of the ingredients. Cauliflower was too $$ this week so I doubled up on the broccoli. I also added a bit more red pepper for color."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bekalu"
},
"reviewBody": "I use this basic recipe all the time and it's great. I usually mix 1/2 chicken broth with the bouillon and water. I mash the veggies in the pot with a potato masher for a chunkier soup and we really like it that way. Most of the time I just use a big bag of frozen broccoli &amp; cauliflower, great when the fresh veg is getting low. Right now we have a lot of zucchini in the garden, so I used that and worked great. Added shredded chicken and cooked rice at the very end, it was very hearty! I serve with cheddar biscuits. Yummo."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Ms Jean"
},
"reviewBody": "This soup was good, and it reminded me of some of the broccoli and cheese soups on this site that I've made and prefer more. The difference is the extra veggies added here. I did not have cauliflower so I left that out. Since I scaled this down a bit, I sauteed a good handful of frozen mixed peppers and onions. I also added some jarred garlic. Many reviews mentioned cutting the amount of cheese in half, which I did, and that was a good call. I used evaporated milk, and it worked well. I thought it needed extra flavor, so I gave it a few shakes of hot sauce."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mahasin"
},
"reviewBody": "My family absolutely looooooved this soup! I was just trying to do something quick but different. This hit the ball out of the park!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "missmudd"
},
"reviewBody": "Yum, of course I made some adjustments because I can't leave well enough alone. I added potato, cause it isn't chowder without spuds, no red pepper as I didn't have any and used broth instead of bouillon. It was a bit bland so I added garlic. Yum, great base recipe, will make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jenny Desrochers"
},
"reviewBody": "Instead of milk I used heavy whipping cream. YUMMO!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Paula Berndt"
},
"reviewBody": "delish!! only change made was no broccoli so I used more cauliflower."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lynn"
},
"reviewBody": "Great flavor. Tastes even better the second day. Hearty enough to be a whole meal."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Brian Neubauer"
},
"reviewBody": "I’ve had to double the amount that I make of this soup. I am begged regularly to make this soup and it is always gone before I can save any for leftovers and lunch. I make this as an entirely vegetarian soup by changing the broth and the bullion. And it’s perfect."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lisa Conley"
},
"reviewBody": "Like several others I cleaned out the fridge. I added book Chou too. I also added garlic, increased the water, used broth vs cubes and a little hot sauce. Excellent Sunday supper! Another Tall Mom"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "PhyllyCheezSteak"
},
"reviewBody": "Made it as written except I only used about half of the cheese and I didn't have any parsley. I actually needed to thin it a bit after adding the cheese. Lovely texture, hearty &amp; comforting soup."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Meg"
},
"reviewBody": "This is pretty good and very easy. I halved the recipe and made a few changes. The most important is that I reduced the amount of cheese by half or more and put some on the table to sprinkle on at the end. With less cheese, the flavor of the vegetables is nice (I also added some frozen green beans, corn, and peas) but the soup is rather bland. I added some basil while sautéing the onion and pepper but it definitely needed more of something. I recommend putting in a lot less flour (half?) and boiling the vegetables for 10 minutes or less (I did 10 min and my bite-sized broccoli was mush)."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "1917patti"
},
"reviewBody": "My hubby said \"This is good\". I almost fell off my chair as he never says \"good\", everything usually gets an \"OK\". We added shredded cooked chicken and hubby wanted less chees put in it so I only put about a cup."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Joann"
},
"reviewBody": "Excellent! Doubled all veggies , added mushrooms and one additional cup broth. Cut cheese to 2 cups. Was delicious and comforting. Also I used low-fat milk to lighten it up."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Brookside Bistro"
},
"reviewBody": "This was so amazing!!! I didn’t have bell pepper, celery or parsley so I did not have them in the soup; however, I used leftover broccoli, carrots &amp; cauliflower that already had a little butter on it, so I didn’t add margarine to the soup. I used 1/3 cup flour &amp; blended it with the broth using an immersion blender. I puréed half the veggies with the flour/broth mixture and added a tsp of garlic powder to the purée before dumping it in my crock pot with the remaining vegetables. I added 3 TBSP minced onion, pepper, milk and 2 cups cheddar (instead of 3 cups, as it was plenty cheesy already) to the broth mixture and stirred until ingredients were evenly mixed. I cooked on low for 4 hours ...this was absolutely fantastic on a very cold day!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Auntylene"
},
"reviewBody": "I made this as directed and found it to be tasty and other than chopping vegetables it came together easily and quickly. Will make this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Anne Hrdlicka"
},
"reviewBody": "After reading the reviews, I reduced the amount of .cheese added to 3/4 cup and also seasoned with Emeril's Original Essence. My family really loved this recipe. Will definitely make this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nancy Overgaard"
},
"reviewBody": "This was a great, satisfying dinner. The only thing I would suggest is adding some crushed garlic at the end of the vegetable saute, but overall it is a wonderful soup that can tolerate a lot of variations in vegetables, which means I can use whatever I have in my fridge! Thanks for the recipe! It will become a staple in our house."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cheryl46"
},
"reviewBody": "I would make this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "C"
},
"reviewBody": "i think the flavour would have been ok but it was to salty!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "belle4397"
},
"reviewBody": "I wish I had read the reviews first but I was in a hurry, so I made as written. WAY too much cheese, and I really like cheese! I would cut in half, or just leave it out and sprinkle the cheese on top."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Karen B"
},
"reviewBody": "I didn't have cauliflower, cut cheese in half, tasted great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Carlin A."
},
"reviewBody": "Just okay. The red pepper flavor was too strong."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "stacy voss"
},
"reviewBody": "What a delicious veggie chowder! Even my meat eater husband liked it! Followed recipe except added extra cup of broth and used immersion blender . Only added about 1/2 cup of cheese and it was perfect!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ollydog"
},
"reviewBody": "Great! Broccoli was not looking so great today at the store so I used more green cauliflower and some cabbage. I also put the cheese on the top at the end it didn't need much. We added some spice. Yum a keeper!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "colleen"
},
"reviewBody": "This is an excellent, hearty soup. Made the recipe exactly as stated - everyone loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "themombomb"
},
"reviewBody": "Used 2 diced red potatoes and 1/4 c flour instead of 1/2 c flour. Because of this it could have used a bit more water or broth. Didn't have cauliflower. No complaints from the diners!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Deediey"
},
"reviewBody": "It was great! Even my vegetable loather ate it. \nI didn't have broccoli so I used more cauliflower. I also added a dash of nutmeg because I like nutmeg on cauliflower. A very hearty vegetable soup."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "brookeroni"
},
"reviewBody": "I make this a lot.. at least once a month. it's so delicious. I add extra of everything so there are a lot of left overs. I follow everything exactly other than using canned broth and adding a couple small potatoes and a little extra broth for them. Mmmm!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Broody000"
},
"reviewBody": "Great recipe. To make it more of a meal, I added some chicken strips and potato. I also used Manchego cheese instead of cheddar. It turned out great and was just the right thickness. I added some ground nutmeg, Cayenne pepper, and paprika to zip it up a bit. I would definitely make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Carol Q."
},
"reviewBody": "Very tasty and easy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kim T"
},
"reviewBody": "This is a super easy and very good recipe. I put everything in a vegetable broth and cooked it like the recipe says."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tina Louise"
},
"reviewBody": "Delicious and nutritious! I used a whole head of cauliflower and a whole bushel of broccoli so I added 2 cups of water to compensate. It turned out perfect. I would definitely go with the 3 cups of cheese, too. This will be a regular for me."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dla62"
},
"reviewBody": "Loved this soup and have shared it with three other people who also loved it. I made some changes as suggested by other reviews; Used 61 ounces of chicken broth ( 1 quart &amp; 2 cans), only used 1/4 cup flour added with the milk and 2 cups shredded cheddar cheese. I did not want a really thick soup (personal preference), however if you love cheese, 3 cups would not thicken it that much. I also added some asparagus tips. I will add a few strips of bacon next time. The beauty of this recipe is that you can add any vegetable you like, although keep the broccoli and cauliflower as this the heart of soup!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Phoebe"
},
"reviewBody": "Pureed this for my elderly Mother, pretty good. 4.25"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Betty Haniotakis"
},
"reviewBody": "Really loved it! Served the cheese on the side for those who wanted it, as some family members don't care for cheese cooked in this manner. Cooked mushrooms on the side, and added them at the end of cooking. Varied the veggies a little in accordance with what I had on hand, but I think that any veggies would be good. I added a little dried thyme, but think that spices could be as desired."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "shophappy"
},
"reviewBody": "I loved this! I cooked 2 pieces of chopped bacon 1st, for that smokey taste, then added a splash of olive oil &amp; sauteed my onion and then sprinkled 1/2 cup of flour to cook out any flour taste, added broth instead of water/bouillon and then tossed in my veggies &amp; herbes de provence along with a bay leaf. Once cooked I blended 1/2 of the mixture for added creaminess, then added half &amp; half and cheese. YUM!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Michele"
},
"reviewBody": "delicious"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dee C"
},
"reviewBody": "Delicious! Just used 1/4 cup of flour which I added to the butter, onions and pepper to make a roux. Then substituted vegetable boullion for chicken to make it vegetarian for my picky vegetarian daughter. Only cooked vegetables 10 minutes as another reviewer recommended because we like a little crunch left, Otherwise followed directions. Creamy and delicious, very hearty. Whole family loved it. Even my carnivorous husband and son went back for seconds!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "cardslingasbaby"
},
"reviewBody": "My family loves veggies, but this didn't go over well at all. The veggies turned out mushy and it was way too much cheese."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kailxy02"
},
"reviewBody": "This recipe is SO delicious. I would for sure make this again. I chopped up the veggies that my kids dont care for really small so they couldn't be seen. Its thick and creamy and I love it! We had it as a side with Panini's!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tory Roseq"
},
"reviewBody": "I love this recipe as does my family. I made it tonight and tripled it to give some away to a sick friend. You can adjust the vegetables to your family's tastes but do not omit the red bell pepper as it really makes the soup."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "duckiewhomp"
},
"reviewBody": "I've made this about 8 times now, and it couldn't be easier. Great for throwing in any veggies that are wasting away in the refrigerator. Celery root and parsnips are a favorite of ours, along with quite a bit of cauliflower. This soup always turns out great. We think it would be good with cubed ham, but haven't tried it. A healthy, hearty meal in a bowl!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "misty"
},
"reviewBody": "Wonderful chowder! I used butter to saute the pepper and onions; about 4 cups of homemade chicken broth instead of the bouillon/water. Took the advise of some of the reviewers to use half of the suggested amount of cheese. This turned out to be a great meal served with some fresh French Bread. Thank you for sharing, TALL MOM. This is a keeper and will definitely be making again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Heidirs"
},
"reviewBody": "This turned out fantastic! I questioned some of the ingredients, but the flavors really come together. I used a whole onion, half of the suggested amount of cheese, and subbed potato flakes for the flower."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jerbear"
},
"reviewBody": "omitted the cheese as it was creamy enough without the cheese. Used double the carrots and broccoli as I didn't have celery or cauliflower on hand. added a little bit of bacon."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "*Sherri*"
},
"reviewBody": "This was a very quick simple soup to make for a busy night. I didn't have cauliflower, so added in a whole bell pepper and onion. I used my own chicken broth instead of water and bouillon cubes. We don't ever have margarine, so I used butter. I did add in some minced garlic along with the other vegetables. You may want to add in some more spices, it is a bit on the bland side, but that is just us, we like flavoring from herbs. This is a pretty flexible recipe to use what you have on hand."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Fyona"
},
"reviewBody": "Great weeknight supper! I followed other reviewers' suggestions and halved the cheese; it worked great, but you should only add it a handful at a time, stir until it melts, and add another handful,... I sauteed the celery with the onion/pepper mixture since I don't like crunchy celery in soup."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Barbara Rincon"
},
"reviewBody": "Very good, just the taste I was looking for. Used homemade chicken stock, non fat milk, 2 tbls. butter. Did not have red pepper and husband doesn't like cook carrots so doubled the brocolli and cauliflower. Had to add a bit more milk as it was too thick. Used 1 1/2 c. sharp cheddar. Before adding cheese I used my submersible hand blended and blened it about half way. Wow, it is excellent. Will make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "LivingWithTheEssentials"
},
"reviewBody": "I thought this was just alright. I ended up having to add italian spices and pasta to give it something. Also, despite making a double recipe and adding pasta, it only fed 4 ppl as a main dish."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "anru7695"
},
"reviewBody": "Very creamy and tasty; simple, too! Thanks for sharing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sarah_Tennessee"
},
"reviewBody": "This was great! (I used 2 cups of cheese instead of 3)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "agb"
},
"reviewBody": "This is a great one dish meal. I used just 2 cups of sharp cheddar and it was delicious. I took it to a pot luck at work and people keep asking me to make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sheila LaLonde"
},
"reviewBody": "This soup was great. I didn't measure my vegetables, but I roughly doubled everything but the milk/flour mixture and the cheese. Fantastic flavor! Thanks for sharing this recipe, TALL MOM!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "phurst00"
},
"reviewBody": "5 stars with a few changes - I added another cup water and bullion; 1 cup heavy cream instead of milk, omitted the cauliflower and celery, added 1 can green beans, and various leftover meats (half a meatloaf, half lb sausage, 6 slices bacon). Turned out delish!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "ericksonpad"
},
"reviewBody": "Very good hearty soup! Doubled veggies and added about 1 1/2 c. more water. I also halved the margarine and did 2 c. cheese. Delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "NDG1974"
},
"reviewBody": "Very yummy! A big hit with the kids. I added potatoes which helped thicken the soup so the flour wasn't necessary. We have a gluten sensitivity in the family and potatoes are an easy way to make a soup gluten free. Thanks for the recipe it's become a staple for us during the winter months."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "KJR"
},
"reviewBody": "this was too thick and cheesy for me, even with using only 2 cups of cheese and an extra cup of water. next time i will use 1 cup cheese and still add even another cup of water. but it is a good base recipe -- using whatever veggies i had (red peppers, onions, broccoli, cauliflower and carrots), plus some minced garlic. i might add a can of corn and can of black beans or even some rice next time and make it super hearty."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Paige Young"
},
"reviewBody": "So yummy! I'm not one to LOVE veggies, but this soup is so delicious. I want to make it again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Debbie Elledge"
},
"reviewBody": "a delicious chowder! made as directed but with only 2 cups/a bag of shredded mixed cheeses and it was plenty. is a great soup as is or to add or mix favorite items. perfect thickness and texture!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kleindorothy"
},
"reviewBody": "This recipe is such a wonderful recipe. I made it last night for our dinner together with “Crayfish and Prawn Salad with Butterbeans” and “Bass escalope with pine nuts and black olives” that I discovered at and , the recipes in the site was really amazing take a glance at those site for more exciting and nutritious recipes. Have fun!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SharonC"
},
"reviewBody": "Loved, loved, loved this chowder. Using others suggestion, I increased the water another cup and cut back on the cheese. I also added a can of corn which added some sweetness. Excellent and as stated by others I'm sure most any veggie would work..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jamie C."
},
"reviewBody": "This soup was so good! I feel like celery does not add much, and I would have had too much left over if I'd bought the bunches my store had, so instead I just put in 2 red peppers. Confession: I definitely used WAY more than 1 C of each vegetable, I wanted a big pot of soup. I have this problem with buying vegetables in equal quantities and then realizing at home that they are like 3x what the recipe calls for. I used 3 of what my store labeled 'broccoli crowns' and only 1 cauliflower head which was kind of smallish, could've added two IMO. A medium/large onion, 2 cans of corn because I LOVE corn in soup, and 3 or 4 carrots. My fiancee requested THICK soup so I added a little more flour/milk on top of the around-3x ingredients I used and it thickened amazingly, especially the next day. HOWEVER: I did not add ANY cheese to this. I see no point. The red peppers, butter, and onions you cook at first gives this incredible, sweet aftertaste that would be totally lost with cheese IMHO. I did not triple the bouillon though and I used dried parsley instead of fresh. Never would've put broccoli and cauliflower in chowder otherwise. Thanks very much for the recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "IstyMae"
},
"reviewBody": "We loved this! I changed a few things, just based on what I had on hand. First, I sauteed the onion, bell pepper with 1/3 pound of bacon until the veggies were done and the bacon was crisp. Then I threw in carrots, celery, zucchini, summer squash, cauliflower, broccoli and mushrooms. I let that simmer for about 20 minutes then mixed in the milk/flour mixture (I used half &amp; half). Added about 1 1/2 cups of a cheddar cheese blend. The whole thing came out fantastic! Might add corn next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "blueyedkids"
},
"reviewBody": "I gotta tell ya....yum! I have my own veggy chowder that I make often and all love, myself included!! however, this added an entire new aspect! the red pepper, the broc and caulif. just YUM! i did change the cheese up a bit and used 2 cups velvetta and one cup cheddar! its darn near perfect. thankyou so much"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cjmic"
},
"reviewBody": "Excellent, can literally make with whatever veggies you have on hand. An great option when you need to throw something together quickly. Leeks were great in here. Will add some frozen corn next time. A keeper!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "McKenzie Lounsberry"
},
"reviewBody": "Loved this! Didn't have and chicken bouillon, so I used chicken broth instead of water. Turned out great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "klh1010"
},
"reviewBody": "This soup is very easy, simple, and great! For a creamy chowder soup it isn't high in fat like most others. I did make a few changes...\n- I used just a little bit of olive oil instead of the margarine\n- I added 2 extra cups of water/bouillon\n- I added squash, zucchini, and corn\n\nI will definitely be making this again. It was an excellent recipe for getting my little one to eat her vegetables."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Zola Griffin Paget"
},
"reviewBody": "This was fabulous! The only changes I made were to sub fresh corn for the cauliflower, and to reduce the cheese to about 2 cups. My husband asked me to add this to our regular rotation."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ROSIE55"
},
"reviewBody": "Shoulda doubled the recipe!\nWe loved it! I followed almost exactly but omitted the flour for a little corn starch in cold water. I think I used at least 2 cups of cheese and was very pleased. Next time Ill leave out the red pepper and maybe add some zucchini or cabbage.\n\nGreat recipe! Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Monica"
},
"reviewBody": "I used the frozen mirepoix mix for the chopped parts and the frozen vegetable mix (italian) for the veggies. I also substituted soy mix for milk and chicken broth (3 c) for the bouillon, added seasoned salt and it was delicious!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sublimare"
},
"reviewBody": "I love this recipe, and have made it 10 times at least. It has been a great way to get veggies into little tikes, even though they hate broccoli in every other form. I love it with the red pepper, but omit it most of the time, as it presents a texture and taste they don't go for. I also put their portions through one or two pulses in the food processor so they don't see all the chunky vegetables they are gobbling up. This recipe is very adaptive, and you can double up or omit just about any of the vegetables. I use vegetable stock instead of bouillon."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "ALZ"
},
"reviewBody": "I have to say that this was a great change of pace from my normal bean soups. Loved the richness but even though I cut down the cheese to two cups (and I LOVE cheese), I still thought it was a little too cheesy and will use less next time. Just used the veggies I had on hand, bell pepper, onion, zucchini, summer squash and asparagus and added some dried thyme. Garnished with a sprinkle of cheese and the aspragus heads. Will definitely make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MaineScott"
},
"reviewBody": "This is a great recipe! I love hot, tasty dishes that also give you a heaping helping of vegetables. This dish tasted great and the chowder had an excellent consistency. For my three cups of cheese I used a cup of regular cheddar and two cups of extra sharp cheddar. Note that the quality of the cheese that you use will have a big effect on the taste of the finished product. I use a decent quality Cabot sharp cheddar and the results are fantastic. My prep time was substantially more than the 15 minutes estimated by the recipe, but the results were so good that this recipe will definitely be repeated!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cor"
},
"reviewBody": "Didn't have any celery on hand so left that out, and didn't have any fresh parsley so just used dried. Other than that followed exactly. Turned out delicious and would make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Juli Anne Morris"
},
"reviewBody": "This was so good! Very rich. I used homemade vegetable broth instead of the bouillon cubes, and I also substituted corn (frozen) and zucchini for the celery and cauliflower, as I just didn't have those on hand. Great cold weather meal! Thanks :-)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Brenda"
},
"reviewBody": "This was really good but my family felt that it needed more spices. Nice texture, though."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "radiogal"
},
"reviewBody": "A great baseline soup for anything you might have on hand! I used potatoes, frozen vegetables, and leftover beef kielbasa. A little less cheese, but then used some to top with. AND instead of water and bouillon, I used equivalent broth. My personal touch? A little celery seed sprinkled into the simmering broth. YUM!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "JARRIE "
},
"reviewBody": "4.5 stars. It'd be 5 stars with additional spices. I'm sure I'll make this again, and I'll try adding garlic and thyme, and add jalapenos to my vegetable list. I used evaporated milk for 1 cup of the milk because it needed to be used up; I think it helped make the soup thick &amp; rich. I pureed my vegetables after the 20 minute boil (husband has texture issues). I didn't measure my vegetables at all, because I'm a rebel like that, and I overdid it on the carrots, which made it too sweet. 2 carrots was 1 too many for us. Thanks for the recipe, I'll definitely make this one again, as it's so easy to modify with what you have on hand!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jan Anderson Gleason"
},
"reviewBody": "Delicious! It's a great way to empty your refrigerator of leftover bits and pieces of veggies. I prepared it right up to the time you're to add milk and cheese and froze it, adding them when I was ready to serve it. I used homemade chicken broth rather than boullion cubes, to cut down on sodium. Thanks for a great recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DOPEYDUCK"
},
"reviewBody": "Wow, I can't believe how well this turned out considering I didn't have a lot of the ingredients on hand. I wanted to use up a lot of veggies before they went bad, and this is an incredibly versatile recipe. I used onion, garlic, carrots, celery, &amp; broccoli, with a box of chicken broth (4 cups), then evaporated milk, a little flour, 2c cheese, some cilantro &amp; green onions at the end. My husband and I had thirds, my 6-yr old had seconds, and my picky 3-yr old ate some of it. This will definitely be a stand-by recipe for us. Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cheryl Wrzesinski"
},
"reviewBody": "What a delight. I used 12 oz. bottle of Michelob Ultra and water to total 1 1/2 C. I am not a beer drinker but recipe turned out yummy. Great way to use up beer. Would NOT make the recipe w/o beer. Husband agrees (and he is not a beer drinker either). I used 2 1/2 C. of cheese. The consistancy was perfect. Can't wait for the leftovers. Will make again and again and again. Thanks."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Penny2222"
},
"reviewBody": "This is a perfect soup to make on a cold snowy day or anytime during the winter. My sister and I found this recipe years ago on this site and it is a go-to....kids and adults love it and it has lots of veggies!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "gabberella"
},
"reviewBody": "Yum! Great dish. The whole family enjoyed it. This will be a regular in my house."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Joan"
},
"reviewBody": "Excellent, and could be used to make seafood. Even modified for low-fat, it's excellent."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CARMIK124"
},
"reviewBody": "This is much better than it looks. I did as another reviewer and omitted the flour and used my immersion blender to blend about half the soup, but leaving it chunky. I added the cup of milk, using 1/2 cream and 1/2 1% fat milk, and only 1 cup of Cheddar cheese. I also used dry parsley instead of fresh. What a great way to get your veggies!"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/12899/vegetable-chowder/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/16369/soups-stews-and-chili/soup/",
"name": "Soup Recipes"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/184/soups-stews-and-chili/soup/vegetable-soup/",
"name": "Vegetable Soup Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/12899/vegetable-chowder/",
"name": "Vegetable Chowder"
}
}
]
}
}
, "about": [
]
}
]