				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Vegetarian Pasties"
,"datePublished": "1999-07-04T13:13:41.000-04:00"
,"dateModified": "2022-07-14T15:49:14.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Ada"
,"url": "https://www.allrecipes.com/cook/11185"
}
]
,"description": "Warm and delicious pastry pockets with a savory veggie filling. I came up with this recipe after I tasted pasties made with meat and wanted a vegetarian version."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/PfW1_-oWN45z8EInuF-Cqy4b7vc=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/386307-3a75fc2773d64395b429b84a814183ab.jpg",
"height": 250,
"width": 250
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Vegetarian Pasties"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4",
"ratingCount": "27"
}
,"cookTime": "PT30M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "777 kcal"
,"carbohydrateContent": "88 g"
,"cholesterolContent": "174 mg"
,"fiberContent": "14 g"
,"proteinContent": "21 g"
,"saturatedFatContent": "21 g"
,"sodiumContent": "1092 mg"
,"sugarContent": "3 g"
,"fatContent": "38 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT40M"
,"recipeIngredient": [
"3 cups all-purpose flour",
"1 teaspoon salt",
"0.5 teaspoon baking powder",
"1 cup butter",
"4 eggs",
"2 teaspoons distilled white vinegar",
"3.5 cups water",
"1 cup dry lentils",
"3 potatoes, chopped",
"1 onion, chopped",
"1 tablespoon olive oil",
"1 teaspoon salt" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Preheat oven to 350 degrees F (175 degrees C)."
} ,{
"@type": "HowToStep"
,"text": "Make the dough: mix flour, salt and baking powder together in a medium size mixing bowl. Cut in butter. Stir in egg, vinegar and 1/2 cup water. Continue stirring until dough is moist enough to be formed into a ball (add more water if necessary). Form the dough into a large ball."
} ,{
"@type": "HowToStep"
,"text": "Make the filling: bring a pot of 3 cups water to boil, add lentils and continue to boil for 30 to 45 minutes; until lentils are tender. Watch the lentils and add water if necessary."
} ,{
"@type": "HowToStep"
,"text": "Wrap the potatoes in aluminum foil and bake them for 30 minutes in the preheated oven. When the potatoes have cooled cut them into small pieces and mix them with the lentils."
} ,{
"@type": "HowToStep"
,"text": "In a frying pan saute onions with oil. Stir the onions into the potato-lentil mixture; season with salt and stir."
} ,{
"@type": "HowToStep"
,"text": "Divide the dough into 6 - 8-inch circles. Lay the circles on a flat, floured surface. Place one cup of filling into the center of each circle. Fold the dough around the filling; seal the edges and arrange the pasties on an ungreased cookie sheet. Bake for one hour in the preheated oven."
} ]
,"recipeYield": ["6"]
,"totalTime": "PT70M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Another Googler"
},
"reviewBody": "The dough was lovely. They are absolutely right, this divides easily into eight spheres. The recipe wasn't too specific so I simply patted mine down on flour and flipping them and adding more flour as needed until i had a workable size. I searched for a recipe like this because I had strawberries to use up. The strawberries only went so far so I made the rest of the pasties with sugar mixed with cinnamon, a little ginger and some butter. I sorta felt like my pasties were like pop tarts. The crust could be flakier and I did wonder if I should have brushed them with egg, milk and/or oil. Oh, and 1 hour seemed a little long, unless you're cooking something .But nevertheless they were good, especially warm."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Siobhan"
},
"reviewBody": "I added a clove of garlic, some carrots and plenty of pepper. Tasted like Cornish Pasties - delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Lisa Wesp Van Beck"
},
"reviewBody": "The crust tasted great however the dough was very soft and hard to work with. The filling was bland and very dry. The way this recipe is written is a lot harder than it needs to be and takes a lot longer. If you're going to try this recipe I recommend cubing the potatoes and cooking them with the lentils, I'd also add in some carrots and onions and garlic. I would also make the filling first and while it is cooking make the dough for the crust."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Michelle Gorley"
},
"reviewBody": "I agree that the pasty dough was much too little for the amount of filling. I probably could have tripled it. That said, it was a super yummy crust. I took warning from the reviewers who said it was dry, and left a lot of liquid in it from boiling the lentils, and instead of baking the potatoes, I diced them and added them to the lentils for the last 8 minutes. I added spices according to the taste of my family, so of course they loved it. Glad to add another dish to our meatless Monday."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Let's Cook"
},
"reviewBody": "Only used the crust recipe from this because I was making meat pies. Great recipe, but will have to add more flour because it comes out pretty wet with 4 eggs."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "highlandergirl"
},
"reviewBody": "These were so delicious, I don't even have any left!! I added steak sauce to my mixture. I diced up potatoes, onions and carrots very small, added sun dried tomatoes, salt and freshly cracked pepper. I added dried peas to the lentils while cooking. Tip, start cooking the lentils/peas first before starting anything else to save on time. Also, I could have doubled the dough recipe because I had so much filling left. I used a large biscuit cutter to cut out the dough. The addition of steak sauce really helped with any dryness and added some pizaz to the flavor. This is a comfort food keeper!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Arrowtograce"
},
"reviewBody": "I made this for a Downton Abbey party I was hosting and all the people who tried, even those who aren't a big fan of lentils or vegetarians, loved it. I will say this however, I had too much filling and not enough dough. In fact, we doubled the amount of dough and still had filling left over. Not sure if this was me or the recipe though! Anyways, great taste and overall it was simple to make."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "coconutheather"
},
"reviewBody": "These were tasty, and would have been better with some brown gravy on the side. I added black beans into my mixture, as I did not have lentils. Next time I will follow the recipe better, and pre-cook my potatoes and they were not cooked all the way in the baking time. To be more authentic, rutabaga or turnip should be added!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Fanciful Unicorn"
},
"reviewBody": "These were great fresh, but very dry as leftovers. I made my filling by boiling the lentils in chicken broth, using seasoned salt and pepper instead of salt, and adding peas and corn. I also brushed them with egg whites before baking, and they were very good- but next time I may try freezing them individually before baking so I can have them freshly cooked when I want them. The crust is perfect, though, so I will enjoy making these again and trying to find a way to keep the filling more moist(or perhaps I will just serve with gravy as some other reviewers mentioned). Thanks for the tasty recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "pumpkin girl"
},
"reviewBody": "My husband and I both really liked this recipe, they reminded me of my mum's U.P. pasties :) I will definitely make them again. Like other people have said, I also made some changes to suit my tastes, and I actually like the fact that this recipe seems so versatile. First, I made the dough for the crust with half whole wheat and half all purpose flour, and I used a heart healthy light margarine instead of butter. I reduced the amount of olive oil sightly, added some fresh chopped garlic, used only two potatoes, and added some cauliflower and carrots. I chose to use (pre-soaked) green lentils 'cause they're the \"beefiest\" lentils ;) I also seasoned with a splash of Worcestershire sauce, mild garlic Tabasco sauce, and some pinches of oregano, marjoram, sage, and thyme. Brilliant!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "hmcm"
},
"reviewBody": "I recently came across this recipe when looking for some variety to add to my family's meals. I am not much of a cook, and I expected my family to turn up their noses at this. However, this was a hit! The crust was very good. The filling recipe given is a good starting point but can be manipulated to suit individual tastes. I added cumin. This is definitely a \"make again\"."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "radandi"
},
"reviewBody": "I was not very impressed with this recipe. I had pasties in Wisconsin when visiting my parents and they were much better (granted, they had meat in them). I found the filling to be very starchy and dry the first time I made it following the directions exactly so I made some changes the second time. I followed some of the other review's suggestions about reducing potato (I only ended up using one) and adding peas and carrots- I boiled 1/2 cup dry split peas and 1/4 cup chopped carrot in 4 cups of water for 15 minutes, then added the lentils and boiled for another 30 minutes. I also added about 3 cloves of garlic to the onion saute. The dough was excellent, but it was too wet at first and I had to knead more flour into it. The second time I added the water gradually and didn't use all of it.\nNext time I will probably cut up a potato, rinse it a few times to decrease the amount of starch, and then boil it instead of baking it. I might bake some cheddar into it as well. I think there is a lot of potential to this recipe but even with the flavors I tried to add the second time it was still pretty dry."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KOOLBRICK"
},
"reviewBody": "i made this and couldn't believe how good they tasted. it was a long time ago when i made them but just recently posted so i'd have to make them again to really refresh my memory..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Annika"
},
"reviewBody": "I have to admit that I was skeptical of lentil and potatoes together in pasties. But they were phenomenal! A bit of work to make the dough yourself, but I was quite proud of myself and my delicious meal."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Sara"
},
"reviewBody": "I really love the concept here, but something was off. I agree that they were dry, but I would add that they were really, really bone dry."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Pesco"
},
"reviewBody": "These were good but could have used more filling. A bit too potato-y and the lentils seemed to blend in and disappear. I eliminated the onions and added peas and corn; would add more veggies next time. The dough came out very tasty. I whipped up a mushroom gravy for the leftovers and it was quite a bit like just biscuits &amp; gravy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "very good \r\ni like it"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "DAYOFSUN"
},
"reviewBody": "These were pretty good - I also found them a little dry. I would recommend (and will try in the future) serving gravy on the side, since that's how these are served in Michigan. Should fix the dryness, but kill the vegetarian-ism. Some people (called 'tourists') also eat them with kecthup...."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This recipe was a very good foundation, though I added Veat fake chicken, peas, cumin, and curry to the potato mix and brushed the outside with egg white and sprinkled with garam masala. Tasty with any variation, try adding peas, shredded cheese, chili powder or shallots to the filling."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "it's great and easy to understand"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "BARRYWE"
},
"reviewBody": "Kind of bland. Filling but rather unispired. Needs work."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/16721/vegetarian-pasties/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/76/appetizers-and-snacks/",
"name": "Appetizers and Snacks"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/111/appetizers-and-snacks/beans-and-peas/",
"name": "Beans and Peas"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/16721/vegetarian-pasties/",
"name": "Vegetarian Pasties"
}
}
]
}
}
, "about": [
]
}
]