				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Very Chocolate Ice Cream"
,"datePublished": "2020-06-18T23:09:41.000-04:00"
,"dateModified": "2022-05-24T22:09:02.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Wendy "
,"url": "https://www.allrecipes.com/cook/385657"
}
]
,"description": "This chocolate ice cream uses cocoa powder and melted chocolate in a custard base for an ultra-rich and creamy texture with amazing chocolate taste."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/YzrCTDboAbtuUSwughEIFWVs5eU=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/369214-very-chocolate-ice-cream-Melissa-Goff-4x3-1-1dab9af6809244b19d0f8ec8e3986a48.jpg",
"height": 1125,
"width": 1500
}
,"video": {
"@type": "VideoObject",
"embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=6310034013112",
"description": "There are few things better than homemade ice cream, but getting it just right requires a great recipe – even if you already own an ice cream maker. This top-rated ice cream recipe is the one to beat, especially if you love custard-style ice cream.",
"duration": "PT1M26S",
"name": "Very Chocolate Ice Cream Recipe",
"thumbnailUrl": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/1033249144001/da67c385-bf82-49e1-b542-c7b59f28a47f/df7e4122-4ef4-429a-b6ab-2ed7aa882238/1280x720/match/image.jpg",
"uploadDate": "2023-01-30T15:48:02.736-05:00"}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Very Chocolate Ice Cream"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.8",
"ratingCount": "646"
}
,"cookTime": "PT10M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "353 kcal"
,"carbohydrateContent": "27 g"
,"cholesterolContent": "161 mg"
,"fiberContent": "1 g"
,"proteinContent": "4 g"
,"saturatedFatContent": "16 g"
,"sodiumContent": "111 mg"
,"sugarContent": "24 g"
,"fatContent": "27 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT10M"
,"recipeIngredient": [
"1 cup milk",
"0.75 cup sugar",
"2 tablespoons unsweetened cocoa powder",
"0.25 teaspoon salt",
"3 egg yolk, lightly beaten",
"2 ounces semisweet chocolate, chopped",
"2 cups heavy cream",
"1 teaspoon vanilla extract" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Combine milk, sugar, cocoa powder, and salt in a saucepan over medium heat. Bring to a simmer, stirring constantly."
} ,{
"@type": "HowToStep"
,"text": "Place egg yolks into a small bowl. Gradually whisk in about 1/2 cup of hot milk mixture, then return to the saucepan. Heat and stir until thickened, but do not boil."
} ,{
"@type": "HowToStep"
,"text": "Remove from the heat and stir in chopped chocolate until melted."
} ,{
"@type": "HowToStep"
,"text": "Pour into a chilled bowl and refrigerate, stirring occasionally, until cold, about 2 hours."
} ,{
"@type": "HowToStep"
,"image": [
{
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/YzrCTDboAbtuUSwughEIFWVs5eU=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/369214-very-chocolate-ice-cream-Melissa-Goff-4x3-1-1dab9af6809244b19d0f8ec8e3986a48.jpg"
}
]
,"text": "Stir in cream and vanilla. Pour into an ice cream maker and freeze according to manufacturer&#39;s directions."
} ]
,"recipeYield": ["8"]
,"totalTime": "PT260M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Incredible flavour. Easy to make."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This was my first time making chocolate ice cream and I was a bit nervous. But instead of using a recipe that ommitted the eggs, I decided I could handle one that had them. And I think I did great! However, I'm REALLY happy I took the advice of another reviewer and used a sieve/strainer to pour the mixture through before putting it in the fridge. I had thought I'd combined the eggs and chocolate perfectly but nope, a small amount of my eggs had scrambled. Had I not used a seive, that would've grossly ended up in my ice cream. My only suggestion to the receipe would be to maybe add this information up top as well. I also deviated a tiny bit by adding an extra half-teaspoon of cocoa powder. Bit of a mistake, lol. Unless you are just the biggest chcolate lover out there, it's not needed, and that's with me buying very cheap cocoa powder and store-brand semi-sweet baking chocolate. I finished my ice cream off by scooping it into a chilled bowl (ironically, a chocolate ice cream container I'd saved) and every few scoops, I added some chopped Reese's. While I'm actually not crazy about my Reese's addition, the chocolate ice cream is delicious. Will definitely be making this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jo White"
},
"reviewBody": "Love this recipe, my search is over. Your instructions on how to make the custard are so easy. I'm new at this, and I'm blown away that I made this beautiful, rich creamy ice cream. I added a bit more chocolate and it froze really fast, only took my cheap little machine 15 minutes to freeze it. The cannister has been in the freezer for a couple of days, and that really made a difference. Love, love love this recipe, can't believe how easy it is."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This is one our favorite icecreams in the house 🏡 So rich and velvety 👌"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dave Harvey"
},
"reviewBody": "This is a good recipe and make a very rich, very chocolate-y ice cream. I did tweak a couple of things, though. I used about 3 ounces of Ghiradelli 60% chocolate. I used a thermometer when cooking the custard (custards scare me) and heated it to about 170F, then poured it through a sieve into a bowl to cool. The sieve did indeed catch some bits - whether they were egg bits or bits of cocoa powder, i'm not sure. The ice cream froze well in my Cuisinart ice cream maker after about 30 minutes, and then i threw in a handful of mini chocolate chips before moving it to the freezer. Everyone who has tried it really likes it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Perfect texture &amp; creaminess! Added a little cinnamon on round 2 = perfection! Now trying to omit the chocolate and use this format for a yummy vanilla. Fingers crossed!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mom’s Secret Chef"
},
"reviewBody": "SOOOO GOOOOD! I hafta Try this! If not . . . I not gonna survive!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "lucyhartmann"
},
"reviewBody": "This is really good ice cream. My family loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Deb Underwood"
},
"reviewBody": "Added 2 teas of instant espresso. This was, yes was, amazing. Thank you😊"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Recipe is great haters gonna hate"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Amazing chocolate recipe! Couple specifics is that it's quite sweet, so make sure and add dark chopped chocolate rather than semi sweet or milk chocolate. Also let the full mixture set in the fridge for a few hours after you complete all the steps before you put it in your machine. This will help the machine do less work. Only took mine 15 minutes to get perfect icecream.!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Susan Grace"
},
"reviewBody": "Made exactly as written and it was delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I prepared this recipe with the best ingredients and it's wonderful. Guiradelli Cocoa powder is what I used and Guiradelli dark chocolate Cocoa chips, 72( percent. After the the base chilled I added heavy cream and pure vanilla extract, and chilled for several hours. It pairs perfectly with a chocolate cake prepared with Guiradelli and Hershey's Cocoa ."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "rn1995"
},
"reviewBody": "Awesome, though I cut back a bit on cocoa, and added white chocolate chips as well. Also smooth peanut butter - divine!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Cut back the sugar to 1/3 cup and tastes great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cathryn Rhoades"
},
"reviewBody": "Wonderful flavor, the best chocolate ice cream I ever tasted (and I am not a huge chocolate fan). Note: it pays tremendous dividends to use the very best cocoa (Droste) and chocolate you can obtain (I used Ghirardelli 70%)."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mandynoelle"
},
"reviewBody": "I don’t usually leave comments, but wow! This is the easiest, richest, creamiest homemade ice cream I’ve made! I followed the directions just as they’re written, put it in the ice cream maker, and what came out was chocolate magic. I read the loudest dissenting comment and feel the need to note that not all home cooks can follow a recipe. If you can and you do, this will be amazing ice cream!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jjherrera641"
},
"reviewBody": "Came out perfect, wasn't chunky or inconsistent in texture. Topped it off with bits of semi-sweet chocolate."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Anthony Cherry"
},
"reviewBody": "This is the richest, smoothest ice cream I've ever made. I added a little malt powder to mine. Unbelievably good. Thank you so much."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "maevedevlin"
},
"reviewBody": "Best ice cream I've ever had, I can't believe how simple the recipe was and how well it worked."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "chuckbemm"
},
"reviewBody": "Awesome!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Oscar"
},
"reviewBody": "Great recipe! I no longer have to buy chocolate ice cream…EVER! It really did remind me of frozen custard. I used 4oz of chocolate chips and 2 heaping tablespoons of cocoa powder. However, it was not a rich chocolate flavor, and it wasn’t too sweet. The taste was kind of a cross between a Wendy’s Frosty &amp; Cocoa Puffs cereal milk. Nonetheless, it tasted great! I may try some dark chocolate chips next time and see if it makes it more rich. I also think that this recipe would be a good base for any flavor. I want to try it as a vanilla ice cream and possibly mint chocolate chip."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Perez"
},
"reviewBody": "it froze perfectly fine for me and the taste was fenominal."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "we_always_want"
},
"reviewBody": "I had to add a review after reading the highly upvote review from the guy saying this is a bad recipe &amp; doesn't freeze. He had to have done something very, very wrong. Of course it freezes! And this is amazing ice cream. I don't even like chocolate ice cream but I'm already making another batch of this 2 days after making the first because I ate it all.\nI doubled up the real chocolate &amp; used 2oz of Semi Sweet &amp; 2oz of milk chocolate."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MKT"
},
"reviewBody": "Fabulous! Perfect every time! This is my go-to recipe for the best rich, creamy chocolate ice cream. I use whole milk and pure cream. Don’t use cream that contains carrageenan or any other additive. I also use dark Dutch processed cocoa.Use the best chocolate you can afford. To those who said they had a problem, follow the directions! Strain the cooled egg mixture before adding the cream &amp; vanilla, in case you got any egg whites in with the yolks. Straining will remove any cooked egg white particles."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "HammockJunkie"
},
"reviewBody": "Absolutely delicious! Having tried numerous ice cream recipes from AR and been disappointed (things like no eggs and sweetened condensed milk, why??), I followed this one and it is so creamy and perfect. Only had 2 eggs so that’s what I did and no problem. Also, I did half dark chocolate morsels chopped up for the melting part and the other half semi sweet that was added 10 minutes in the churning for chips. Chilled the chocolate for well over 2 hours in a glass bowl before adding the cream and vanilla, don’t know if that made a difference. But oh so good. I’ll never buy ice cream again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SarahMc"
},
"reviewBody": "perfect!\nno changes to original recipe"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Alexandra Flynn"
},
"reviewBody": "Amazing recipe! Just needs some adjustments. When cooking down the milk, sugar and cocoa powder, the powder never fully dissolved. I continued to add it slowly to the eggs and then return the mixture to the heat. I thought it would then cook down, but never did! I thought id done something wrong, but previous reviews had some similar complaints. I used a hand blender to beat it together which worked wonderfully! Without the blender it wouldn’t have been smooth! I also replaced the cane sugar with coconut sugar because its Keto and even sweeter! The coconut sugar had cooked down since it was heated and the initial taste test was very bitter. I added another 1/4 cup of sugar and it was perfect! Adding less sugar at the right time (off the heat) would fix this problem, unless you like bitter ice cream. I had to blend it yet again when I added the chocolate bits because, again, it never fully emulsified. I would mention using a blender in the recipe, give some info on substitutions, and mention that it only makes two pints which is pretty small."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tekla"
},
"reviewBody": "I’ve made this ice cream twice now and I love it. It’s rich, creamy and delicious. My 8 year old neighbor reported it as, “yummy.” I agree. The first time I made no substitutions, but I altered the technique a tad. I stirred sugar, cocoa, and salt until dissolved before adding the milk. No stirring while it heated. I tempered the eggs with the scalded milk, added the egg mixture back to milk and stirred constantly until it was thick enough to coat the back of the spoon. I removed from the heat, stirred in the chocolate until melted, then immediately added the cream and vanilla, before chilling. The second time I substituted bittersweet chocolate, added a little ancho and chipotle chili with the sugar, and added a vanilla bean and vanilla caviar to the custard. l strained the mixture before chilling, removing the vanilla bean. Outstanding!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "E Jayz"
},
"reviewBody": "I made this and it was the first Ice Cream I have ever made. The taste is on point with store bought chocolate ice cream. My only gripe is that it didn’t yield four quarts but that’s on me for not doing the math."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Angie Haskin West"
},
"reviewBody": "Great recipe! I absolutely love the creamy texture!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "FeChef"
},
"reviewBody": "This ice cream delicious! It’s rich and smooth without tasting too “chocolatey.” The amount is perfect for the Cuisinart 1 1/2 quart ice cream maker and thickened nicely in about 50 minutes, after being refrigerated for an hour. I’ll definitely make this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cathleen Barlow Strabala"
},
"reviewBody": "I’ll put this frozen custard up against any chocolate custard I’ve had in a boutique shop- excellent! Follow the directions to the letter and you’ll have a perfect product. My custard got a little past simmer right at the end and after cooling, I thought it might have been ruined as it was definitely a pudding. After whisking in the cream it was again the perfect consistency. Hoping to defend last year’s first place prize with another batch of the same- fingers crossed!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "perryfam"
},
"reviewBody": "Delicious ice cream. I tweaked it a little. Will be making this again. I may add more chocolate next time :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Julia Conner"
},
"reviewBody": "Wonderful! I made it exactly by the recipe, as I always do the first time I try any recipe. Very smooth and sweet. I'll add roasted chopped almonds to it next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Leesa"
},
"reviewBody": "This ice cream is definitely more of a custard. After reading reviews I ensured my ice cream bucket was in the freezer for 24 hours prior to use. This ice cream came out like silk and the chocolate flavor is outstanding. I can honestly say this is my new favorite ice cream recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Amber Henderson"
},
"reviewBody": "Excellent texture! And, I didn't even use an ice cream maker. Okay, so this is what I did....I had to make two substitutions because of an allergy. I used goat milk vs. cow milk. I used 1 can of coconut milk vs. 2 cups cream. And, after adding add the ingredients as instructed in the recipe, I used a stick blender to make sure every bit of cocoa was evenly dispersed w/in the mixture. This incorporated some air into the ice cream mixture so it was pretty creamy.....almost like pudding but less fluffy than a mousse. I poured the cooled mixture into freezer containers and stuck them in my deep freeze because I wanted it fast but went to run some errands that took longer than expected. Imagine my delight when I came back several hours later and my chocolate ice cream was NOT rock hard but very scoopable! It has perfect texture. I have never been able to make a homemade ice cream that doesn't turn rock hard in the freezer. I love it and will certainly make this again and again! I gave only 4 stars because I felt the ice cream was too sweet. I know the sugar plays a part in the texture but I'm going to experiment w/less sugar next time and that means I'm also going to try a very dark chocolate instead of chocolate chips. You've got to try this recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ben Neubaum"
},
"reviewBody": "I added oreo crumbles"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sébastien Mostovac"
},
"reviewBody": "10/10 recipe. I’m not a chocolate ice cream person usually. But this is probably the best ice cream i’ve ever made. One thing to mention however, I think the there is a glitch in the portion adjustments... which is probably why a lot of people aren’t getting it right! Make it it batches portioned out to 8 ppl! But make sure you don’t adjust the portions and switch it back to 8 ppl, it will mess up your whole experience"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sc"
},
"reviewBody": "Made this twice and is the best without any substitutions...I’ve seen a couple of reviews that say it won’t freeze and I almost thought they were right the second time I made it. Our machine kept going and going...it would slow down to the point of stopping and then take off like there was nothing in the canister. Turns out it froze just fine but since we only did a single batch our machine was strong enough to keep going and not shut off. Make a double batch and you’ll be just fine. Best recipe ever!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "deniseb"
},
"reviewBody": "The only thing I don't like anymore is the name! I have made this ice cream so many times. My family likes mint chocolate chip so I left out the vanilla, substituted mint oil and added chopped chocolate. I've done cashew vanilla, strawberry... it's endless! Thank you for such a great, simple and versatile recipe. Well done!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Amanda Thomas"
},
"reviewBody": "Very creamy, and easy to make!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Annie"
},
"reviewBody": "Sooo amazing! I whipped the cream before adding it, but followed the recipe exactly otherwise."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ahuppert"
},
"reviewBody": "I read both the favorable and unfavorable reviews and decided to make this ice cream. Boy am I glad that I did. The ice cream came out of my Cuisinart about 1/3-1/2 frozen (this is normal). I transferred it into a Rubbermaid storage container and froze it overnight. When I served it, it came out if the container exactly the same as store bought products. The gritty mouthfeel reported by others was mostly not evident, but when I did detect it, I realized it was unmelted chocolate. I rushed chopping the 2oz of chocolate, and I’m sure it didn’t fully incorporate into the base material, so this was a user error, but it by no means detracted from the end product. This is an amazing recipe and I would recommend it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "RVJSTUDIO"
},
"reviewBody": "Sooooooo delicious! This is what chocolate ice cream should be!! Easy and perfect recipe. No adaptations needed."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "errader"
},
"reviewBody": "Made the base and then finished it in my ice cream maker. So creamy, so chocolatey, very popular in my house!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "David Bud Massey"
},
"reviewBody": "I made this for company. They all begged me to make them their own batch. Know I know what to give as presents to friends. This ice cream is so decadently good you just have to experience it to believe it. For an extra punch, add some coffee chips."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Diane Lovelady"
},
"reviewBody": "So good, will double next time, maybe a bit of coffee? Really really good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LEKSIPATSY"
},
"reviewBody": "We made this precisely as stated and it turned out great! My chocoholic daughter and husband were so happy and they thought watching it turn into ice cream was so cool! I was concerned I accidentally let the chocolate boil a bit and it was a bit lumpy but once it went through the maker it was so creamy and good. It’s the first time I made an ice cream recipe you have to cook first and it was worth it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Runner"
},
"reviewBody": "For all the effort, it wasn’t enough chocolatey enough. We’re working with really good chocolate and cocoa powder here and the proportions didn’t allow it to cut through the dairy with enough intensity for my taste. I would try 33%-50% more on my next batch."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Karen Youstin"
},
"reviewBody": "Excellent! Super chocolaty and creamy. I added an extra ounce of dark chocolate with sea salt and also about 1.5 tablespoons of Rum. Going to make it again today and add chopped brownies near the end of the churn time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "dancermom"
},
"reviewBody": "So so so disappointed!! I followed the recipe and instructions exactly. After an hour and 45 minutes in the ice cream maker it was still just liquid. I’ve made a lot of different Ice cream flavors and used several different recipes and have never had one not turn out. So sad that I wasted my chocolate and cream on this recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "KCMom8696"
},
"reviewBody": "Very rich, chocolates but more like custard than ice cream."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "TERRALYNN"
},
"reviewBody": "This is delicious even when made SUGAR FREE due to some health issues of a family member! I cut the sugar from 3/4 c to 2/3 c and used monkfruit sweetener (monkfruit erythritol blend). The only issue with sugar free is I think the freezing point is lower so the cuisinart didn’t freeze it and it ended up freezing VERY hard. I think xantham gum helps with that but haven’t tried it yet. I also strained the hot batter before refrigerating which was a good move because I think there was a slight amount of cooked egg white in there. This recipe is a keeper, thanks!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jennevans"
},
"reviewBody": "Deliciously creamy! I added a splash of strong cold brew coffee to make the chocolate flavor pop. And, of course, good chocolate makes a huge difference. Highly recommend!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "missflint"
},
"reviewBody": "Perfect recipe for purely divine chocolate ice cream. Follow as written, and you too will be impressed."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Gianna"
},
"reviewBody": "This recipe is SO GOOOD!!!My dad said it was better than Tillamook and I totally agree. It was super smooth and rich with an amazing chocolate flavor. I wouldn’t change anything. After churning it in my Cuisinart ice cream maker for almost 20 minutes, I put in the freezer for a little while as well to firm it up a bit more. Again, I would totally recommend! You need this recipe in your life lol!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "xinaTX"
},
"reviewBody": "I was looking for an ice cream recipe to do w/ my 11 yo son. This recipe seemed easy enough. I did make a few changes: dark chocolate instead of semi-sweet, and 2% Lactaid milk Instead of regular milk. To cut down the cooling time, I set the pot into a bowl of ice &amp; water till the mixture had cooled to about 40-45 degrees. I put the mixture into my very basic, inexpensive ice cream churn. In almost 20 mins later,I had the MOST delicious chocolate ice cream.The consistency was like a thick soft serve. I don’t know what it’s like after freezing since we devoured it as soon as it was done! YUMMY!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "dylmeister"
},
"reviewBody": "I made this recipe with dark chocolate, a little less sugar, and I threw in some dark chocolate oreos. It was insane! Great recipe"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Janice Peiffer"
},
"reviewBody": "This was super. I did not chop the semi sweet chocolate, just broke into pieces. they did not completely melt so there was tiny chocolate chips in the ice cream. THIS WAS A BIG HIT. everyone enjoyed the ice cream and the chocolate chips were a bonus (Didn't tell anyone it was a boo-boo) Sometimes mistakes turn out for the best. Will be making this again,"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Karen Smith"
},
"reviewBody": "This was fantastic! I did melt the chocolate in the microwave with a little of the milks, sugar, cocoa mixture. If you have lumps or grit it is probably because the custard was not made correctly. Check out how to make that and then make this ice cream. Was a bowl of smooth, silky, chocolate dreaminess."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Vasudha"
},
"reviewBody": "Superb In quality and texture!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Elizabeth Kashat"
},
"reviewBody": "I am using this recipe for a ice cream stand"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "caseypoo"
},
"reviewBody": "Delicious! So good not sure I will buy ice cream from the store again! The only changes I made were: I used Godiva 73% cacao chocolate, melted it over double boiler before mixing into hot liquid, and I added chunks of Godiva chocolate at the end."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "cmugrad"
},
"reviewBody": "although it is a very good tasting and texture of ice cream....it doesn't freeze properly as other recipes I have used for ice cream. \n\nI tempered egg yolks properly as I have made ice cream before and had a lovely thick base until the addition of the cream separately after the base had properly cooled overnight. adding cream after to a properly thickened base ends up thinning it out which will cause problems with getting a good firm ice cream in the end.\n\nI had to churn it 55 minutes in my ice cream maker to get it to even some sort of very loose form of soft serve and even allowing it to properly \"cure\" over night in the freezer didn't bring it to the solidness that a proper ice cream should be. if I make it again I will be heating the milk AND cream together as all other recipes I have had success with do....thus creating a proper thickened base that will stay that way when it goes into the ice cream maker to be. churned and then in the freezer for a proper cure."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Patrick Dowling"
},
"reviewBody": "Very, very good! I used half and half rather than just milk, but otherwise stuck to the recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MomToTwo"
},
"reviewBody": "I made the recipe exactly as directed and it turned out amazing. Universally our family favorite out of all our ice cream recipes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jscano"
},
"reviewBody": "I don’t know how you cannot rate this a 5 star. May be some of the best ice cream I’ve had and I live in Blue Bell country. It doesn’t freeze like"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Anthony Mann"
},
"reviewBody": "I added chopped snickers and made a bowl of awesomeness"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Chassidy Rice"
},
"reviewBody": "I made this for the first time in my ice cream makes and it is to die for. Super cream and smooth and no raw eggs!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DRH"
},
"reviewBody": "I followed other's advice and tempered the eggs very slowly, ground up my chocolate very finely, and sifted the mixture before chilling it for the two hours. I'm fairly certain these steps saved me from having lumps in the end product, like some others had. (During sifting, I definitely prevented a bit of scrambled egg from going in the mix.) The end result was a very decadent, chocolaty dessert (though I did add 1 extra oz of chocolate). If you follow the instructions to the letter, and be patient when you cook, you'll end up with a really awesome dessert.\nWhen I make it next, I think I'll try adding cinnamon and cayenne pepper to make a Mexican chocolate ice cream."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "bbqstud"
},
"reviewBody": "Used a vanilla bean rather than extract. Everybody especially Queen has loved it! I've made it three times and starting on #4 tonight."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Adil Baig"
},
"reviewBody": "tried again, comes perfect"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Thekla Simpson"
},
"reviewBody": "This is the best ice cream I have ever made! It tastes just like Culver's chocolate custard ice cream!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mary"
},
"reviewBody": "My favorite homemade ice cream! When making multiple recipes, I don’t put that many yolks in."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Amanda Lee"
},
"reviewBody": "My boyfriend is allergic to milk and hates coconut so I made this with soy milk and Mocha coffee mate (which has the proteins he’s allergic to removed) and he really loved it. It had a soft serve consistency, but the flavor was really good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lfoster860@gmailcom"
},
"reviewBody": "Delicious chocolate ice cream! I did have a burning desire to change it. Instead of adding vanilla, I added 3 tbsp of Amaretto. And when it was nearly finished churning, I added a small jar (8oz) of homemade cherry pie filling.\nMy company said it tasted like black Forrest cake."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Delicious chocolate ice cream! I did have a burning desire to change it. Instead of adding vanilla, I added 3 tbsp of Amaretto. And when it was nearly finished churning, I added a small jar (8oz) of homemade cherry pie filling.\nMy company said it tasted like black Forrest cake."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JB"
},
"reviewBody": "I have made this several times! Rich chocolate taste, creamy texture are always a hit. This is my go to ice cream recipe"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "poprocks_forever12"
},
"reviewBody": "It tastes so good I'll just make it again and again"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Anne"
},
"reviewBody": "Just made the recipe as written. Worked beautifully. No trouble freezing it. Hopefully the critical review that said it wouldn't freeze has a better ice cream maker by now."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Darlene"
},
"reviewBody": "very delicious"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Stephanie Boe"
},
"reviewBody": "I am so happy with this icecream recipe. It is the first one I have found that looks good, tastes amazing, and sets up nicely un the freezer. I'm impressed. So many possibilities."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sarah D00"
},
"reviewBody": "This recipe makes the most delicious rich chocolatey flavor ice cream. I definitely recommend! Took me 5 minutes to make then overnight in the freezer. I replaced the 2 cups of heavy cream with 3 cups of whipped cream from the can. It made it a little extra smooth"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "spongebobpro97"
},
"reviewBody": "It was amazing but I needed a little more milk than intended"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lelan"
},
"reviewBody": "This is a very rich ice cream"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Michelle Chef"
},
"reviewBody": "I changed it to dark chocolate instead of semi sweet chocolate."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Faye4"
},
"reviewBody": "Perfection. \n\nReally easy to follow recipe and great balance of ingredients that contribute to a silky smooth, flavorful and classy chocate ice cream. nothing was added, nothing was taken away.\n\nTo prevent flecks of chocolate, ensure chocolate chards are completely dissolved in the hot custard before refrigerating."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jeanne Richmond"
},
"reviewBody": "This is a delicious chocolate ice cream recipe.I followed the recipe exactly and had no problems with it freezing. I added chopped pretzels towards the end of the freezing portion and it turned out fantastic. A little salty and sweet. I will definitely make this over and over."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Julie"
},
"reviewBody": "Made this recipe as written. Turned out great and did not get ice crystals. I definitely will make this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MrsDavis114"
},
"reviewBody": "Made this as an end of summer treat for my daughters (8&amp;6) They reported the chocolate mixture tasted like the best hot chocolate ever when they snuck a finger full as it was cooling. The recipe was easy to follow and came out wonderfully. The texture was satin smooth with lots of chocolate taste. They have decided it’s better than their favorite ice cream parlor in town!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nancy Lane"
},
"reviewBody": "Oh, boy! What a treat to have a recipe turn out as described. I added 2 DOVE dark chocolate bars in place of the semisweet but that was the only change. Thank you for a great rich, creamy, delicious ice cream recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Linda T"
},
"reviewBody": "This is absolutely delicious...creamy and rich. Better than expensive brands of chocolate ice cream."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Stefie Shen"
},
"reviewBody": "Why is thear only 5 stars even if thear was 1,000 it would still need more my family loved this ice cream and I did to."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "robymom"
},
"reviewBody": "This is our favorite ice cream recipe. It churned and froze better than any other we have tried. It was unanimously the best. \nI followed the directions exactly, and am thrilled with the results."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Laura Talley"
},
"reviewBody": "This was awesome, made @ 1 QT. \nI used Lily's Dark Chocolate baking chips. instead of semisweet chocolate. YUM!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "HungryMommy"
},
"reviewBody": "This came out perfectly. You have to make sure you’re using good chocolate and good cocoa powder. And make sure you cut the chocolate up VERY fine or it won’t melt. I saw some reviews saying it didn’t freeze but I had no issues. My machine basically makes soft serve then I put it in a metal bread pan in the freezer for about 5 hours and it sets just fine."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Laurie on the beach"
},
"reviewBody": "I am very happy with the creamy results this recipe produced. Rich, creamy, easy. The only thing I changed is after tempering the chocolate custard, I strained it, it did remove any accidental cooked curd pieces. I also put my cold custard in the blender for a few seconds, it had a slightly lumpy look and I did not want to risk chunky monkey.. Then I added my cream just long enough to thoroughly mix. I will be anxious to see if it freezes well, as some have said it did not freeze well."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shari R"
},
"reviewBody": "Delicious and great texture! I swapped in half and half for the milk and added 25 chopped marschino cherries to the mix for chocolate cherry - yum!"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/56803/very-chocolate-ice-cream/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/1556/desserts/frozen-desserts/ice-cream/",
"name": "Ice Cream"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/16189/desserts/frozen-desserts/ice-cream/chocolate-ice-cream/",
"name": "Chocolate Ice Cream Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/56803/very-chocolate-ice-cream/",
"name": "Very Chocolate Ice Cream"
}
}
]
}
}
, "about": [
]
}
]