				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Vintage Lemonade"
,"datePublished": "2000-06-10T17:58:01.000-04:00"
,"dateModified": "2022-07-14T15:56:22.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Aunt Suzie"
,"url": "https://www.allrecipes.com/cook/24321253"
}
]
,"description": "Lemons, sugar, and water--in a process that has been handed down since the 19th century. A true classic of a lemonade recipe."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/oTxBxfy4WIyUPdVi01nXFp3bXhI=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/445154-b593a8750abe419592ecd4e8ca542dd1.jpg",
"height": 960,
"width": 960
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Vintage Lemonade"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.7",
"ratingCount": "334"
}
,"cookTime": "PT20M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "269 kcal"
,"carbohydrateContent": "77 g"
,"fiberContent": "6 g"
,"proteinContent": "2 g"
,"saturatedFatContent": "0 g"
,"sodiumContent": "13 mg"
,"sugarContent": "62 g"
,"fatContent": "0 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT45M"
,"recipeIngredient": [
"5 lemons",
"1.25 cups white sugar",
"1.25 quarts water" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Peel the rinds from the 5 lemons and cut them into 1/2 inch slices. Set the lemons aside."
} ,{
"@type": "HowToStep"
,"text": "Place the rinds in a bowl and sprinkle the sugar over them. Let this stand for about one hour, so that the sugar begins to soak up the oils from the lemons."
} ,{
"@type": "HowToStep"
,"text": "Bring water to a boil in a covered saucepan and then pour the hot water over the sugared lemon rinds. Allow this mixture to cool for 20 minutes and then remove the rinds."
} ,{
"@type": "HowToStep"
,"text": "Squeeze the lemons into another bowl. Pour the juice through a strainer into the sugar mixture. Stir well, pour into pitcher and pop it in the fridge! Serve with ice cubes."
} ]
,"recipeYield": ["4"]
,"totalTime": "PT65M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "HUGE HIT!!! This lemonade was so good, we went out and bought glass pitcher specifically for it. Followed the recipe exactly. Didn't have a taste of the rinds whatsoever. Have already been informed that I will be making a lot more of this lemonade this summer. Thank you for sharing your recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "rvines1003"
},
"reviewBody": "This is the best lemonade I've ever had and it was a hit. I followed the recipe exactly. Note - it may not be for everyone because it is sweet."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "scooby"
},
"reviewBody": "Delish. I doubled it and proved to be a bit of a hassle. Had to strain in multiple containers because I didn’t have ones that were big enough, sugar didn’t dissolve in hot , boiling water like I expected it to so I had to carefully stir the peel mixture ( other reviews said this would make it bitter), took more like 1.5hrs or more, and wasn’t really cool enough to drink at that point. That said, please try this. It’s very tasty. The only way I can describe it is smooth. That sharp pucker that I thought I really liked is gone using this method and apparently I prefer it with no pucker but great fresh lemon flavor. I didn’t know what I was missing! Thanks for the wonderful recipe! By the way, don’t bother wasting your time making limeade (limes only) with this—-bitter and overly sweet with very little lime taste. I couldn’t even drink it. Stick with lemons and you won’t be disappointed. Simply Delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "MBoit"
},
"reviewBody": "Tastes like lemon peels. Bitter! \nStick with regular lemonade"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Donna Sharp"
},
"reviewBody": "This is vintage alright! Just wanted to mention that you don't used to entire rind just the outside yellow peel because the inside white part, aka the pith, is extremely bitter and will overpower the finished product. Use a vegetable peeler or a paring knife with a light hand, you just want the outer yellow, but don't freak out about a little of the pith being attached and THEN juice your lemons. It's harder to peel a lemon after it's been juiced. If you think that they aren't going to juice very well, roll them on the counter like you are kneading dough or nuke them for about 10 seconds and roll them. Nothing tastes better than homemade lemonade!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cindy L Warriner"
},
"reviewBody": "Love it....added strawberries...yum"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tammy"
},
"reviewBody": "I've made several home made lemonade recipes over the years but I've liked this one the best. It's the most \"lemony\". Must be the lemon oils in the peels.....\nThanks for the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "julie"
},
"reviewBody": "Best lemonade ever!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sarah Vallinakis"
},
"reviewBody": "Absolutely delicious! A must try! It’s worth all the extra work! This lemonade has the strong lemon flavour I’ve been looking for, without being sickly-sweet like the grocery store kind. Make sure NOT to include the whites of the lemon rinds to avoid any bad bitter flavour. I used a vegetable peeler and then cut the pieces smaller with scissors. I also used golden sugar instead of white, and ohhhhh my gosh! I’m going to be making this recipe all summer."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nicole Lee"
},
"reviewBody": "This was my first time making homemade lemonade and it was great. It's kind of a lot of work but it's worth it. I used only 1 cup of sugar just because I wanted to cut out a little of the calories, and it was fine. If you want it sweeter then use the amount recommended."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Emily Kingsley"
},
"reviewBody": "It was so yummy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Eleanor Lloyd"
},
"reviewBody": "Best lemonade recipe!! Used nearly half of the recommended sugar and it didn’t need any more in my opinion!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Baby Belle"
},
"reviewBody": "I love this lemonade. It tastes exactly like the lemonade they serve at the county fair. (I also have mixed it with the pink lemonade UV)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dalen Brewer"
},
"reviewBody": "I make this lemonade at least once a month!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "bts6002"
},
"reviewBody": "I picked up a big bag of lemons at the store and made this recipe my wife doesn’t like lemonade she said but the picture was empty by the end of the day I followed the recipe 100%"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "HoughtonsHuman"
},
"reviewBody": "Easy to make and well worth the wait. Letting the lemon rinds flavor the sugar adds a layer of complexity to the lemonade. Sheer perfection!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Marlea"
},
"reviewBody": "Hands down, the best lemonade I’ve in a long time. Thanks also to poster who mentioned not to use any of the white from the lemons as it would make it bitter. So good. I may try just a tad less sugar next time. Hats off to the Victorians!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "eddie"
},
"reviewBody": "Perfect very tasty"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "sequoia04"
},
"reviewBody": "I found this recipe ridiculously sweet. I like my lemonade tart, but I didn't expect homemade lemonade to be so sweet. \nI peeled the lemons using a peeler so I didn't get any of the bitter white pith and it's not difficult if you just peel it in strips down the lemon (not around the lemon). \nI tasted it as I was adding the water/sugar mixture to the juice at the end and I found it already too sweet for me and I still had 1 1/4 cups of the water remaining! From there I even added an extra lemon's worth of juice and it's still sweet to me. I doubt I'll make this recipe again, but if I do it'll take a lot of adjusting. My lemons were regularly sized, not abnormally small. I dumped the extra sugar water."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "CG1"
},
"reviewBody": "The steeped lemon rinds embittered the drink. Some liked the flavor, but not all."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tanisha Russell Saunders"
},
"reviewBody": "I made this on a hot summer day. Loved it! But I did make slight alterations to suit my needs. I reduced the sugar to 1 cup. I added 2 more juiced lemons to 2 quarts of water and added I teaspoon of sliced ginger to the lemon zest and sugar mix. Very refreshing. Will make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sloopie1"
},
"reviewBody": "We were having a cookout and, as August in the South typically is....it was a scorcher! Needless to say, I needed a light, refreshing beverage to serve with the Baby Back Ribs. I chose this one and was absolutely delighted with the results! I loved it, our guests loved it, and hubby, who’s not a fan of Lemonade even said it was really good! In fact, he drank 2 glasses of it! I made this recipe, with the exception that I doubled it, exactly as it was written. Yes, it’s a bit of extra work but the results were outstanding. From this point forward, THIS will be my “go to” lemonade recipe! You really need to try it as, in my book, it puts other lemonades to shame."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kennie Still"
},
"reviewBody": "Ah-mazing!! This is a huge hit. I substituted finely ground fresh coffee for the lemon, and didn’t add sugar. I also added frothed milk. Instead of heating in a pot, I used an espresso machine. It tastes just like a latte!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "James Ross"
},
"reviewBody": "Have made this several times and love the intense flavor. I found that warming the peeled lemons in the microwave makes juicing them easier and yields more juice."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Brett Marggraff"
},
"reviewBody": "What I did that add lots of flavor is to peel the lemons with a potatro peeler. Add them to the simple syrup at the start. Then boil. The entire kitchen will smell of lemon, and add lots of additional flavor. Let the peels cool and you have lemon candies. Be sure to use just the outer skin of the lemon, not the white pith."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "INDIASIAN"
},
"reviewBody": "I am not usually a fan of lemonade because of it's tartness, but gave this recipe a try for my daughter wanted to make lemonade. I opted to peel the lemons with a regular 'peeler' and though there was almost no white 'inner' rind of the lemon but to err on caution, I took the advice of other reviewers and didn't stir the mixture till I removed the rinds. It was DELICIOUS! The BEST I have EVER tasted! A keeper for sure!\noh fyi - don't need so much sugar. Start with less and adjust to taste as needed."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sally Brown"
},
"reviewBody": "In the end I cut the lemons in half let them set in the warm lemon rind water. Squeezed the lemon in my clean hands. Then strained into pitcher. Wow Great!!!! I think I'll cut back the sugar to only a cup. I like the tartness. Will be making double batch to make ice cubes. Thank you for a really old fashioned lemonade!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Epic Red Panda"
},
"reviewBody": "Amazing, really good"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Marie Rousseau"
},
"reviewBody": "What do I do if it is a little bitter,?"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "PAULYWOG"
},
"reviewBody": "I did not make any changes to this recipe. Covering the lemon rinds in sugar and then boiling them made it to bitter. I am going to try again, but this time I will only use 2 lemon rinds instead of all of them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "glencove"
},
"reviewBody": "Mine was bitter. I'll try it again without the lemon peel."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jill Rock"
},
"reviewBody": "This lemonade is VERY LEMONY. The addition of the rind-sugar marinade takes it to the next level.\nI achieved the same color of it in the glass. Beautiful.\nOverall, it was too strong, with a lemon taste almost like one finds in disinfectant or household cleansers.\nI will make it again one day, but with more water to dilute the strength."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Hillary Mackesy"
},
"reviewBody": "Liked it a lot, the lemon rind makes a big difference."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tara Joy Partridge"
},
"reviewBody": "I will definitely make this recipe again! This was the best lemonade I have ever had! My family loved it very much - it was gone within four hours!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dora"
},
"reviewBody": "What a wonderful delicious summer drink!! It takes a little bit of time, but it’s totally worth it. I used a veggie peeler to peel the lemons and avoid the pith. I’m sure this is going to be a staple at my house all summer."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Doriezitro"
},
"reviewBody": "Incredible tasting lemonade. I didn’t change a thing"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "laidback"
},
"reviewBody": "Definitely worth the little extra work. I follow this recipe exactly, and highly recommend!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Regan Gramlich-Macdonald"
},
"reviewBody": "Refreshing and light. Beautiful served with twist of lemon. Requires quite a few lemons but well worth the real thing. Sugar content can also be adjusted if desired."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mallory"
},
"reviewBody": "No changes, perfect just as it is. I’ll make it again probably special occasions as it does use a few lemons and they’re pretty expensive here in Maine. Thank you for this great recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lindsay Squadrito"
},
"reviewBody": "AWSOMNESS WE LOVED IT"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MitaliP"
},
"reviewBody": "i had no idea what to do with the amount of lemons our backyard Meyer lemon tree produced until I found this recipe! i’ve now made it at least five times and each time everyone who’s tasted my lemonade has complemented it. i do reduce the amount of sugar a bit but otherwise unchanged."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lj"
},
"reviewBody": "I cut the yellow part of the peel away from the white part of the peel and poured the sugar over the yellow peeling. I mix this recipe at a ratio of 1 to 1 with iced tea fantastic either alone or with other flavors. I Love this recipe! Yum!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jacqui1120"
},
"reviewBody": "Best Lemonade recipe!!!!! I only used 1 cup of sugar and added about 1 cup more water. Perfect balance of tart and sweet. No more store brands ever. I did not find it bitter at all. If it comes out bitter just adjust with water and/or simple syrup."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Crouton"
},
"reviewBody": "Made this according to recipe. I thought it was a great recipe. Although, ( it may sound silly), it was too flavorful. It was certainly interesting and a worthy experience but not for my take on lemonade. I like the plain \"bland\" lemon juice , water and sugar mix, although I would definitely encourage others to give this a shot!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Andrea Schmidt"
},
"reviewBody": "I am not usually a huge fan of Lemonade, which is why I went searching for a recipe. This was delicious: Not to bitter not too sour, but sweet with a bite! Perfect. And I went on to use the peels in the Candied Lemon Peel recipe , found on this site. I now have Lemonade, candied peels, and lemon simple syrup, all fantastic, and all from 5 lemons!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cindy"
},
"reviewBody": "I made this for my brother on the 4th of July, it was the best!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "AJ1130"
},
"reviewBody": "Super refreshing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Scuba_Steve"
},
"reviewBody": "I have made this recipe several times now, starting with the recipe being made exactly as written. The great thing about this recipe is that is so easy to tweak to your own tastes that you just can't go wrong.\n\nWhat I have found that I like best is 4 large lemons, 1-1/4 cup of sugar and 1-1/2 quarts of water. I peel the lemons whole, taking as little of the bitter white part as possible, as suggested by many others. The last thing I do is juice the lemons and then mix the fresh juice in... well, not the last thing. I then put the sugar infused lemon peels in a small jar and add a cup of decent vodka and soak it in the fridge for a few days. I'm sure you can guess what the last thing is. I suppose the peels would also be good in a cup of hot or iced tea... whatever you do, don't just throw them away!\n\nWARNING - DO NOT USE PLASTIC BOWLS TO MAKE THIS RECIPE. Use glass or ceramic. The high acidity of the lemons can leach chemicals out of the plastic and at a minimum affect the flavor, but possibly be much more hazardous than that. I used melamine the first time and noticed a weird chemical taste and Googled it and found dozens of articles about the dangers of high acid foods in plastic bowls."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "snate56"
},
"reviewBody": "Universally it appears that the reviewers with the poor reviews did not follow any of the tips offered by the reviewers with the good reviews. ;)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "on2teaching"
},
"reviewBody": "This is the best lemonade I've ever had. We made it in our classroom for \"FUN Friday\" using this recipe and a couple of the tips (don't get too much of the white from the peel, adjust the sugar as needed). I peeled the lemons and the students squeezed all of them. It was a huge hit with my students and some of the staff. This will be the only recipe we use for lemonade from now on. We did float a slice of lime in it &amp; would add a small piece of strawberry next time to make it look pretty."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "R. Smith"
},
"reviewBody": "A tiny pinch of salt balances the sweet and tart!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jammie"
},
"reviewBody": "Did not touch the peeling while sitting in the sugar as suggested by others and it turned out great, best I have had. It was a little to sweet for me so I just added more water to my glass as others preferred the sweetness."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Danu76543"
},
"reviewBody": "Loved this recipe! Am adding a little extra to it though..\nMuddle a handful of fresh spearmint into the sugar before putting over the lemon zest and you will get a wonderfully refreshing beverage for a hot summer day.\nThis recipe makes a quart of lemonade."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Pam"
},
"reviewBody": "This is the best lemonade I've ever tasted! I made it for 50 people attending an after-funeral luncheon and everyone there loved it. I quadrupled the recipe, using Meyer lemons, and didn't change anything. The next week I made the same amount again for a large birthday party we hosted and this Vintage Lemonade got rave reviews! It is definitely worth the extra work."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Valarie N Joseph Enos"
},
"reviewBody": "Really good Lemonade! I made it according to directions (other than juicing, since I have a juicer). Next time however I will use less lemon rind. It was a little more bitter than I like."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kelly Eden"
},
"reviewBody": "Have made it heaps of times. I love it !"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "josie altieri"
},
"reviewBody": "Once you've made this recipe, all other lemonade recipes will pale in comparison! Simply outstanding!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mike Dennis"
},
"reviewBody": "It's great"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "rsbecca@WD"
},
"reviewBody": "This is the only way I will make home made lemonade! I used the zest of the lemons and added that to the sugar. I then strained the water and sugar with a slotted spoon, some of the rind did get thru. I didn't strain the lemon juice because my husband and I both like pulp."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "finnfriend"
},
"reviewBody": "I will make this again!! Our family thought it was excellent."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Vicky"
},
"reviewBody": "I don't usually say a recipe was \"great but we changed it\" except that we had already started another recipe and realized we were able to finish with this better looking one. We had put the peeled lemons, minus the seeds, in the blender then strained it out. We also started this very late at night and we ended up leaving the sugar sit on the lemon peels overnight.\n\nI will definitely make this again but if I were to make it how I had before it would require more sugar. A very intense flavor, it tasted like a lemon shake-up from a fair."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Denise Daire"
},
"reviewBody": "Have made this before, it is delicious and all my friends love it!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Oladapo"
},
"reviewBody": "I loved it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "dad"
},
"reviewBody": "I made the recipe exactly as described and it was delicious! The whole family loved it. You will never use frozen mix again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jesse"
},
"reviewBody": "This is the best lemonaid I've ever drank. The recipe is strong but it's perfect because when you add ice it doesn't become too diluted."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mntechgirl"
},
"reviewBody": "I used 6 lemons instead of 5 and cut the sugar to 1 cup and it was still sweet enough. I decided to use the microwave to boil the water. Awesome recipe, easy and delicious, thank you for sharing!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sharletta Wojtczak"
},
"reviewBody": "This is best lemonade ever! Awesome recipe. I'll consider adding vodka for my next party."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Diego Rodriguez"
},
"reviewBody": "Pretty good, but a bit sweet for my taste. I'd recommend using a little more juice and less sugar."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Jennifer13"
},
"reviewBody": "This is bitter. I even got as much of the white off the rind as I could. I followed the directions 100%. Sure is a lot of work."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "polkka"
},
"reviewBody": "My 10 year old loves to cook. This is his favorite lemonade recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kelly"
},
"reviewBody": "Very good. Followed the recipe &amp; suggestions to not stir sugar &amp; peels. There's still a slight bitterness I'm not sure if I like or not. But I'd probably make it again. I wonder how this method would work with oranges?"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "shondonny"
},
"reviewBody": "Great summer drink"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "thunderbolt"
},
"reviewBody": "I only used 1 c of sugar and it really didn't even need that much."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Misty Kerr Hill"
},
"reviewBody": "yummy! I have always liked fresh squeezed lemonade, but doing it this way, WOW! I will never make it any other way now. I love that you can taste the oil from the peels and not just lemon juice."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Eric da Butcher"
},
"reviewBody": "I make this all summer long, nothing like a summer hummer out by the pool on a hot Arizona day.\nGreatest lemonade ever, follow what other reviews said, sweeten to taste, then it's time for a real treat."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Brandy Gibboney"
},
"reviewBody": "I normally don't like lemonade but this is so good I love it"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bobbie Mastromatteo-Aubel"
},
"reviewBody": "OMGosh! This lemonade is AWESOME! A teeny bit time consuming...but so worth it. I used a veggie peeler to remove the skin. My only change would be less sugar. Next time I will use only 1 cup. To those who did not like this recipe, maybe it didn't taste like the powdered or frozen mixes you are used to. Try this one again...instant winner!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "miss ugly"
},
"reviewBody": "This is similar to the recipe we use. We don't do the boiling water etc. We use a gallon jar w/a screw lid, squeeze 6 lemons, add a cup of sugar, fill the jug w/ice to the top, and shake for about 20-30 minutes, or let it sit for an hour give or take. Then we fill the jug w/water and remove the rinds. Sometimes we add a wedge of lemon to the glass or just drink it as is."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "crodz"
},
"reviewBody": "Excellent! Used10 lemons which made about 1cup of lemon juice. Peeled lemon rinds and put 2 cups of sugar and mixed around a little. So delicious - will make again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LazyFoodieGirl"
},
"reviewBody": "I didn't think you could deepen the flavor of a recipe that pretty much had one main ingredient, but it's amazing what a little lemon oil will do! Loved the intensity it brought. My rinds were fairly thin so I just put them cut-side down into a 9x9 Pyrex, layered the sugar on top, then poured the hot water over it when it was time. Because the lemons floated, I flipped them over to not get any of the bitter pith to seep into the mixture and as it sat, the aroma was amazing! Be aware of the size of your lemons too, as well as their tartness. My lemons were small/medium-sized and a not as tart, so I could have added a bit more lemon juice to balance the sugar, or else cut back the sugar a little, but when poured over ice it helped balance the flavors too, and was a wonderfully refreshing drink!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Esmee Williams"
},
"reviewBody": "Great way to use up a huge bag of lemons from Costco. The kids loved this lemonade over ice. For the festive adults at our party, we added a bit of lemon flavored vodka and it was a huge hit as well."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MAXINEHARRIS"
},
"reviewBody": "Tastes just like Hot Dog And A Stick Lemonade...yum!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MamaBakes"
},
"reviewBody": "What a unique way to prepare real lemonade! Hubby and I like a less sweet, more tart lemonade so I decreased sugar to the equivalent of 3 tablespoons per cup rather than the 4 tablespoons per cup as written. It was perfect!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lynn"
},
"reviewBody": "I made this earlier today-it is wonderful,I did read some of the reviews beforehand (thank you all).I peeled just the yellow part,cut small-layered /w/ just 1 cup sugar.Cut the pith off the lemons.Quartered them and ran through my juicer.What took the most time was cutting the peel into 1/2 inch pieces.Next time will use my box grater and shred.We don't drink soda-so this will be a welcome change from Cranberry juice or try mixing them..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lynn"
},
"reviewBody": "I made this earlier today-it is wonderful,I did read some of the reviews beforehand (thank you all).I peeled just the yellow part,cut small-layered /w/ just 1 cup sugar.Cut the pith off the lemons.Quartered them and ran through my juicer.What took the most time was cutting the peel into 1/2 inch pieces.Next time will use my box grater and shred.We don't drink soda-so this will be a welcome change from Cranberry juice or try mixing them..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Cheri Reynolds"
},
"reviewBody": "I didn't care for this recipe. I hate to add a negative review because everyone has different taste buds, but I found this to be so overly sweet."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "fullmooncrazymom"
},
"reviewBody": "I changed nothing besides having very huge lemons, so I only used 3. It turned out awesome poured over ice, in a mason jar of course! Love! Now I just need to do the math so I can serve 100 people! Thank you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tricia Hendrix"
},
"reviewBody": "This is THE best lemonade I have ever tasted!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Miechele James Summers"
},
"reviewBody": "I have made this recipe many times always receiving rave reviews. It is the best lemonade I have ever tasted. I use our juice extractor to juice the lemons."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "elle19"
},
"reviewBody": "Scrumptious! Just like down south. For the reviewers who said it was bitter, try not getting any of the white part of the peel. Only the outside yellow. The sugar pulls the oils and flavor right out of the rind. Thanks for a great recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Amy Coe"
},
"reviewBody": "So delicious sometimes, other times it's bitter. We keep trying though because when it's good, it can't be beat. Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Andrea"
},
"reviewBody": "The best lemonade I've ever tasted, hands down. But seriously--DO NOT STIR THE RINDS WITH THE SUGAR. The first time I made it I let it sit and it was perfect. The second time I foolishly gave the rinds and sugar just a tiny little toss toward the end and the lemonade ended up a little bitter. I do use 1/2 to 3/4 cup less sugar but that's my own preference. This recipe will be used a lot in my house."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "chchipcookie"
},
"reviewBody": "I made this a lot this summer. Very refreshing. I triple the batch so I have plenty on hand since it involves more time than other recipes to make but very worth it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ann-Elaine Abell"
},
"reviewBody": "This lemonade is amazing! It is time consuming but well worth the effort! I have also added puréed strawberries to make strawberry lemonade and it was wonderful! The whole family loves this recipe!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "PhoenixHills"
},
"reviewBody": "I have made this exactly as it is instruced many times, and loved it. Eventually I played around with the number of lemons (4), and amount of sugar (scant 1 cup) to get it to my personal taste. I have found that when lemons are not on sale, I will switch out a few lemons for a few limes and it is just as wonderful."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "rosebud2967"
},
"reviewBody": "Terrific! A bit tart, i might add a little more sugar next time, but if you like sour leamonade, this recipe is aWeSoMe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SUNNI_ONE"
},
"reviewBody": "In my best Scarlett O'Hara voice - I'll never drink powdered again! This was awesome!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Funliven"
},
"reviewBody": "Heaven in a glass. I found this recipe about 2 weeks ago and I have made it every 2 or 3 days since then. People love it and so do I. Follow the directions exactly as written and you will not be disappointed. We are certainly hooked. Perfect for this hot South Carolina weather. Aunt Suzie this is a winner and thank you so much for sharing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Snoochee"
},
"reviewBody": "Tasty! After reading through the reviews, I didn't cut out very much of the pith - only where it was especially thick on one lemon. I reduced the sugar to 1C and added a teaspoon of dried lavender. I accidentally added too much water, filling the bowl to almost 2Qts with the lemon, lavender and sugar... and yet, this was fabulous! Can't wait to make it again."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/20486/vintage-lemonade/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/77/drinks/",
"name": "Drinks Recipes"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/2817/drinks/lemonade/",
"name": "Lemonade Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/20486/vintage-lemonade/",
"name": "Vintage Lemonade"
}
}
]
}
}
, "about": [
]
}
]