				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Waldorf Salad with Walnut Oil Vinaigrette"
,"datePublished": "2018-06-08T09:20:27.000-04:00"
,"dateModified": "2022-12-28T20:11:38.000-05:00"
,"author": [
{"@type": "Person"
,"name": "HAMTAN"
,"url": "https://www.allrecipes.com/cook/476719"
}
]
,"description": "A wonderful light Waldorf Salad without mayo. The flavors of the apples, walnuts, and raisins are so clean and fresh. It never fails to please."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/lvTA0lak_88SlnNARr_1z1oetvU=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/48361-Waldorf-Salad-with-Walnut-Oil-Vinaigrette-LynnInHK_18343_original-4x3-1-76ab78ddc65e44999062f052538cefbb.jpg",
"height": 720,
"width": 960
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Waldorf Salad with Walnut Oil Vinaigrette"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.7",
"ratingCount": "52"
}
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "392 kcal"
,"carbohydrateContent": "40 g"
,"fiberContent": "6 g"
,"proteinContent": "6 g"
,"saturatedFatContent": "3 g"
,"sodiumContent": "327 mg"
,"sugarContent": "28 g"
,"fatContent": "27 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT15M"
,"recipeIngredient": [
"2 Red Delicious apples, cored and diced",
"2 Granny Smith apples, cored and diced",
"4 stalks celery, diced",
"1 cup toasted walnuts",
"0.5 cup raisins",
"2 tablespoons walnut oil",
"1 tablespoon cider vinegar",
"0.5 teaspoon salt",
"0.5 teaspoon pepper" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Toss together apples, celery, walnuts, and raisins in a large bowl; set aside."
} ,{
"@type": "HowToStep"
,"text": "Whisk together walnut oil, cider vinegar, salt, and pepper in a small bowl."
} ,{
"@type": "HowToStep"
,"text": "Toss apples with dressing to serve."
} ]
,"recipeYield": ["4"]
,"totalTime": "PT15M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Barbara"
},
"reviewBody": "Delicious! Subbed Crasins for the raisins and had a bottle of raspberry walnut dressing. Excellent."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Keem"
},
"reviewBody": "Crazy delicious. Celery and apples were a great combo."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DeeND"
},
"reviewBody": "I did make one change due to ingredients I had on hand. Instead of the walnut oil and cider vinegar I substituted raspberry walnut flavored vinaigrette. My family loves this salad. So good, easy to make and tasty."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "bones"
},
"reviewBody": "Just the way it is - no alterations"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LAYLA"
},
"reviewBody": "I have made this a few times now with the only variation being grapes instead of raisins. Not being a fan of mayo, this is by far my favorite apple salad recipe. For best presentation use two colors of apples. The walnut oil also adds to the flavor. Plus preparation is really easy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Karen"
},
"reviewBody": "I have fixed this a gazillian times and it gets rave reviews every time. My cousin, who is vegan, went crazy for it. I do double the sauce."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Foodie"
},
"reviewBody": "Was thankful to find this nice recipe using walnut oil. I made it twice and found not to use dull-tasting \"delicious\" apples. I'll always use 2 varieties of my favorites (Fuji &amp; Gala crops happened to be in peak flavor when I made this) and use just 1/4 teaspoon of the black pepper."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Michele Kuch Morelli"
},
"reviewBody": "A great side dish especially if you want something with a hint of sweetness. We made it with Cranraisins vs regular raisins (not a fan of raisins) and it was awesome!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carolann0308"
},
"reviewBody": "Made this for a party and added some sliced red grapes I had on hand. I made it the night before it sat in my fridge covered with plastic wrap and the apples did not brown at all. I was afraid they would. I think I'll make it for a lighter Thanksgiving side or it would be great for Passover."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sylvia"
},
"reviewBody": "I didn't have walnut oil, so I used EVOI. I also added an avocado as well as a handful of dried cranberries in place of the raisins. Chilled it covered in the refrigerator for about an hour before serving with roast turkey breast. It was absolutely delicious and refreshing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mags"
},
"reviewBody": "I have made this twice. The only change I would recommend is adding a tablespoon more dressing. The toasted walnuts add a lot of flavor. Don't skip that step. I thought pepper was weird but it is really yummy. Fresh, different and healthy. love it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Maddie Preston"
},
"reviewBody": "Next time I make this I will use less pepper and vinegar. Otherwise, it was pretty good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Robert Shendock"
},
"reviewBody": "Light and full of flavor. The apple really comes through - the better the apple, the better the salad."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mom"
},
"reviewBody": "This was really good! I did not have any tart apples, so I used more vinegar, which worked well. I used a bit more salt. My husband does not like raisins, so I left those out, which was fine. I served it on some lettuce as a first course for guests - looked nice and tasted great. It is better if you make a little ahead of time and put in the refrigerator until needed."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BrewCrew"
},
"reviewBody": "Really great alternative to the mayo version. Used 1 granny smith, 2 red delicious and 1 gala. I did use extra virgin olive oil instead of walnut oil"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "rdhrunner"
},
"reviewBody": "I made this recipe twice. Each time I halved the recipe, using only 2 apples. I thought this was more than enough for two people. The first time I followed the recipe. I liked it but agree with an earlier reviewer that it was a little bland. The second time I used Honey Crisp and Granny Smith apples, cranberries instead of raisins and I used a white balsamic vinegar for the dressing. I liked it better with the changes. It is a nice change from a mayo based Waldorf Salad. I would make this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sharon"
},
"reviewBody": "A friend of mine came into town and prepared this for me. I fell in love with it.She left and I failed to get the recipe so I typed in on Google apple salad with walnut oil and was able to find this. This dish is a keeper."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kayla"
},
"reviewBody": "crisp and light-- filling but not something that will make you feel unpleasantly stuffed."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Pat"
},
"reviewBody": "I GIVE THIS 5 STARS!The very best walnut salad I have ever had. Will never go back to the heavy salads. LIGHT AND REFRESHING!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kay"
},
"reviewBody": "Really good - quick and easy. I didn't have apple cider vinegar but I did have spiced cranberry cider that with a touch of regular vinegar worked fine."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Loves2Cook"
},
"reviewBody": "I subbed a few things (dried cranberry for raisins, etc). But the star of this recipe is the vinaigrette, and I made that as written. This salad is light and simple, and I think it would go well with most meats. Great autumn recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "RMSR"
},
"reviewBody": "I've never had a Waldorf salad, but this seemed and ideal way to try it as my bf doesn't care too much for mayo-based salads. I subbed Gala apples for the Red Delicious, only used half cup of toasted walnuts (that's all I had on hand) and added two pinches of a homemade pumpkin/apple pie spice blend to the dressing. I had sweet almond oil on hand so I used that instead. This was delicious; I would definitely make it again and try it with grapes as many other reviewers have."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jeannie Tim Scott"
},
"reviewBody": "much better than I expected :) I could not find walnut oil and used sunflower oil. Also, I added seedless red grapes. Thanks for sharing"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "NTexas"
},
"reviewBody": "I've been making this for some time now and it is one of my family's favorites. I use dried cranberries instead of raisins and Rome/Empire apples for Red Delicious, b/c I think Rome Apples taste better. Sometimes for a variation I add a small can of mandarin oranges for a change."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "maybaby"
},
"reviewBody": "Tried this for the first time, today, for Thanksgiving dinner. It was really good. Nice and light compared to the rest of dinner. ;) Added a cup of chopped grapes too. Will definitely make again. Thanks..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "tmce"
},
"reviewBody": "It's wonderfully crunchy O.K. (especially since I used honey crisp apples) but nigh on to tasteless. It's back to a mixture of reduced fat mayo and sour cream for me."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "TucsonAnn"
},
"reviewBody": "This is light and fabulous as is! I don't like mayo, so always enjoy alternate ways to make recipes without it! Even if you like mayo, there is no need to change a thing about this recipe! I agree it is important to use good walnut oil and good cider vinegar to ensure the flavor is superb."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Pauline Lor"
},
"reviewBody": "I liked the walnut oil option, as I don't like the visual of mayonaise in my arteries. It did make the salad more refreshing, less heavy. What a great way to get your fiber! I actually used candied walnuts because that was all I could find. Turned out great anyhow! I also added really firm, seedless, green grapes, which added a nice texture, and color. The celery is AWESOME, because it really does give it a nice little crunch! I ate so much of this stuff. I finished it all by myself in two days, haha. But it's pretty good for you, and goes well with a nice chicken dish =) Thanks for the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "400luv"
},
"reviewBody": "WOW!! I wanted a fruity, crunchy side to have with my supper tonight and I'm so glad I found this recipe because it was exactly what I wanted. I scaled the recipe down to 1 serving and it still made a ton (about enough for 3 small servings). I used just royal gala apple and I was out of raisins so I used dried apricots and dried apples instead. I thought at first that there wasn't enough dressing but it's pretty tangy a little goes a long way. Thank you!!! This is my new favorite recipe!!! I think next time I'll add some feta cheese...yum."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MILKTERT"
},
"reviewBody": "wonderful. as good and as different as i thought it would be. i made it for thanksgiving (totally untried before) and was not disappointed. My in-laws and their boys even liked it. and they usually pretty tame palates. I increased the serving to 8 people and it was more than enough. I DID however add a few handfuls of grapes halved, dried cranberries and a mix of golden and regular raisins. Toasting the walnuts is a MUST. for that matter toasting all your nuts for about anything you make will be like adding a little sugar, oil, and water to flour to make bread, as opposed to just swallowing a handful of flour. it makes a BIG difference (for most things) You should try this recipe, don't forget the pepper, yes pepper!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "RPOVARCHUK"
},
"reviewBody": "As someone who hates mayo but whose husband LOVES Waldorf, this was a real find. I have served it many times with great success. It's wonderful!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allison Morgan"
},
"reviewBody": "I made this for Thanksgiving and it was the perfect addition to the meal. It was a very light salad."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ann"
},
"reviewBody": "very good! left out raisins, used lemon olive oil instead of walnut oil and cider vinegar. Nice light lunch."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kerrie"
},
"reviewBody": "Perfect healthier alternative to the classic. Light, crisp and flavorful. I replaced one of each apple with a red and yellow pear."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "fergsj"
},
"reviewBody": "Made this for Easter dinner and really enjoyed it. I substituited grapes for the raisins. I think it would be a great lunch salad with some tangy goat cheese."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "pama"
},
"reviewBody": "Great side dish--easy and yummy. I reduced the recipe to feed 3, 3 apples, 1 celery stalk, 1/4 c raisin and 1/4 c walnuts. I didn't have walnut oil, instead used 1 tbsp Canola oil and 1/2 tbsp Red Wine Vinegar."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lcb"
},
"reviewBody": "I've made this recipe about 3 times this holiday season. My family loved it! It's especially good for following a healthy dietary plan. I substituted dried cranberries for the raisins and used Jonagold apples instead of Red Delicious. I used a good quality gourmet walnut oil. I will keep this one forever!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Elizabeth"
},
"reviewBody": "This sounded good and did not disappoint. A refreshing counterpoint to the usual gloppy, calorie-laden version. SunMaid has a product that is a trio of different raisins, and it was nice to have the variety. I only had Gala Apples and it still had a good flavor. Love the crunch! This will be a must for the holidays as it's a departure from heavyhanded side dishes. Also, great to serve for vegetarians or vegans."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bryan Green"
},
"reviewBody": "Made with what was on hand: still excellent with Golden Delicious and no celery, substituting dried cranberries for raisins."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Lisa G."
},
"reviewBody": "A nice crunchy side dish and great alternative to a mayo-based salad. I served this for a casual mid-September cook-out of hamburgers and hotdogs. Those that tried it really liked it. I used a medley of granny smith, braeburn, red delicious, and gala. I also used half dark raisins and half golden raisins. The best part for me is the toasted walnuts and walnut vinaigrette. AND, the salad stays good and crunchy as leftovers."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "PROV31WANB"
},
"reviewBody": "Oh, man! This is delicious. I tried it tonight to prepare for tomorrow's Thanksgiving meal and I ate the whole test batch. I used Gala apples in place of the Red Delicious and dried cranberries in place of the raisins. It is a perfect salad for a holiday meal. I can't wait to serve it to my guests tomorrow. The walnut oil really makes it special."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "LynnInHK"
},
"reviewBody": "This was surprisingly good despite my initial skepticism. A good quality walnut oil is a must. Don't substitute!"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/48361/waldorf-salad-with-walnut-oil-vinaigrette/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/210/side-dish/sauces-and-condiments/salad-dressings/",
"name": "Salad Dressing Recipes"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/2601/side-dish/sauces-and-condiments/salad-dressings/vinaigrette-dressing/",
"name": "Vinaigrette Dressing Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/48361/waldorf-salad-with-walnut-oil-vinaigrette/",
"name": "Waldorf Salad with Walnut Oil Vinaigrette"
}
}
]
}
}
, "about": [
]
}
]