				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Watermelon Sangria"
,"datePublished": "2009-07-06T14:19:45.000-04:00"
,"dateModified": "2022-11-15T09:54:22.000-05:00"
,"author": [
{"@type": "Person"
,"name": "bewitched"
,"url": "https://www.allrecipes.com/cook/3831210"
}
]
,"description": "This watermelon sangria with white wine, vodka, orange liquor, simple syrup, lime, and fresh fruit tastes just like summertime in a glass!"
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/3bPonlDkO69U2cw-4dkV4kl-B5k=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/1195340-04826085da4f4806a49dd4e752a992de.jpg",
"height": 960,
"width": 960
}
,"video": {
"@type": "VideoObject",
"embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=4235048700001",
"description": "Refreshing summer beverage with watermelon juice, white wine, vodka and fruit.",
"duration": "PT1M13S",
"name": "Watermelon Sangria",
"thumbnailUrl": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/1033249144001/0f014e1e-2b9f-47e5-8167-7513711d5737/97bbc4a7-50bb-412d-b4f6-f7f461ddd0c8/1280x720/match/image.jpg",
"uploadDate": "2023-02-03T15:38:22.323-05:00"}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Watermelon Sangria"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.5",
"ratingCount": "84"
}
,"prepTime": "PT20M"
,"recipeIngredient": [
"12 cups cubed watermelon, divided",
"1 (750 milliliter) bottle dry white wine",
"1 cup vodka",
"0.5 cup triple sec",
"0.5 cup simple syrup",
"1 orange, cut into wedges",
"1 cup fresh blueberries",
"1 medium lime, quartered" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Place 9 cups of watermelon cubes in a blender; blend on high until very smooth. Strain juice through a mesh strainer into a large pitcher."
} ,{
"@type": "HowToStep"
,"image": [
{
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/3bPonlDkO69U2cw-4dkV4kl-B5k=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/1195340-04826085da4f4806a49dd4e752a992de.jpg"
}
]
,"text": "Pour wine, vodka, triple sec, and simple syrup into the pitcher; stir to combine. Add remaining 3 cups of watermelon cubes, orange sections, blueberries, and lime quarters; chill sangria for 4 hours before serving."
} ]
,"recipeYield": ["16"]
,"totalTime": "PT260M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Penelope Mickens"
},
"reviewBody": "I loved it! I adjusted the amount of alcohol because I like my fruit to be a bit boozy. I also adjusted the watermelon juice, if you have one I highly recommend using a juicer for the watermelon. Also, I used the juice of the lime and not the segments. I found that to give the sangria a better taste."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rachel Joy"
},
"reviewBody": "I tripled this recipe and made in a 3 gallon container for a girls day. Everyone absolutely loved it! Neddless to say.. I am making again for a pool party this Weekend! 100% 5 star recipe!! Enjoy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Char Shelsky"
},
"reviewBody": "Made this for a summer ladies night out last summer. It was a hit."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "OODLES_OR"
},
"reviewBody": "We have only made this twice but it is soooo delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Maryenos"
},
"reviewBody": "Doesn't really need the simple syrup.\n\nAlso good with red wine"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "24carrots"
},
"reviewBody": "No changes, just something to drink. I wished that I had used all that watermelon differently."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "mtgplnrlisa"
},
"reviewBody": "This was good. A little labor intensive but everyone liked it. I would make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Hannah"
},
"reviewBody": "This sangria went over well at the 4th of July party I brought it to and was perfect for summer! I put more like 10 cups of watermelon in cause it had a ton of juice and I also left out the simple syrup - watermelon is already sweet! I used a $5 bottle of sauvignon blanc for the white wine and it seemed to mix reasonably well, although I think something with a bit more flavor (like maybe a chardonnay) would have been even better. I wasn't a huge fan of the overwhelming watermelon taste, but it was a unique sangria and it was still pretty good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cheryl-Ceece Cole"
},
"reviewBody": "Good"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bobbi Rubingh"
},
"reviewBody": "What a hit! The guys at our happy hour even switched out their beers for this. Good thing I made a gallon!\nAgree with others that this is a lot, but I have a gallon Tupperware pitcher which is perfect because I use 2 bottles of wine (Vino Verde for sparkle). Used Gran Marnier and less simple syrup which made it plenty sweet. I made my left over pulp...watered down... into ice cubes. Chilled without diluting."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Diana Guthrie Hanrahan"
},
"reviewBody": "Delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "marydiann"
},
"reviewBody": "I did not have triple sec or any orange liqueur. I squeezed the juice of one large orange and lemon and added. Added another 1/4 cup vodka and 1/4 cup simple syrup. About 6 cups of pureed watermelon. I added 2 cups frozen blueberries and a cup of frozen organic mixed fruit, (mango, Peach, Pineapple, strawberries) It is quite delicious and the fruit is amazing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kar"
},
"reviewBody": "Very Sweet as written. The next time we make it, I think I will hold off on the simple syrup and taste it first. Also, chilling is crucial. I tasted it after assembling and it was just okay, but after chilling the flavors really came together. A very good summer cocktail. I will make again but add simple syrup to desired sweetness."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carie"
},
"reviewBody": "This was a refreshing and strong sangria. Following the advice on the other reviews I used a small round watermelon and it was plenty."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Terry Butler"
},
"reviewBody": "Loved this Sangria . I tried the watermelon Sangria at Applebees recently so had to find one to make at home. I made it exactly as written, scaled by half. the only change I made was to use the watermelon puree with pulp without filtering. Definitely have to let the flavors meld( I made it 2 hours before tasting!) Perfect blend of flavors, crisp and light for summer. I did not think the watermelon was overpowering at all. I did use the simple sugar as I only had a Chardonnay for the wine. If I used a sweeter wine I might cut down or leave out the sugar, but with the drier wine it was perfect. Try it!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mrs. Klett"
},
"reviewBody": "I have made this for several ladies nights out, to rave reviews. To those who complain that it tastes \"too watermelon like\", this is not the recipe for you. If a refreshing watermelon cocktail will make your world a happier place, this is for you."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Keeli"
},
"reviewBody": "Take some watermelon in serious need of being used and add one really hot afternoon and the result is a perfect oppertunity to hunt down a new refreshing cocktail. I used a moscato wine and some gingerale so I left out the simple syrup and just squeezed the lime and orange into the blender (just never been found of the flavor the citrus pith leaves in drinks). Light and lovely and just perfect for relaxing on the deck after a hard day of yard work."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Eric Johnson"
},
"reviewBody": "Have made this a couple of times and everyone loves it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lisa Tacchi Brinkmann"
},
"reviewBody": "Loved this. I doubled the recipe for a party. When I make this again, I will double he simple syrup and the triple sec. It needed a little more sweetness. It was a hit!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ms. Mercado "
},
"reviewBody": "I made this a couple a weeks ago at our camping trip, friends came to visit and it was a hit. I added blueberries and kiwi to lighten the watermelon a bit. Def will try this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Barbara Dickerson"
},
"reviewBody": "Put 1/2 as much triple. Sec and symple syrup. Use two lines and two oranges, using the juice from one line and one orange"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jjsas898"
},
"reviewBody": "Very refreshing! I made it for a Christmas in July party. Since I wanted to stick with red and green I used watermelon, strawberries, sliced lime and frozen green grapes. I found that it was sweet enough on it's own so I skipped the simple syrup. Everybody raved about it. Will make it again for sure."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "vnguyen820"
},
"reviewBody": "Doubled the recipe using 1 bottle of red wine and 1 bottle of white wine, no simple syrup, 3 oranges cut into wedges, 2 lemons, no blueberries. Delicious when chilled with ice. Becomes more acidic with time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jim"
},
"reviewBody": "Made this for a party we hosted for my wife's work and it was a huge hit. I blended up an entire watermelon and got 4 batches worth. I didn't really strain it except to get the seeds out. Plan to make it for another party this weekend."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jennie Olivero"
},
"reviewBody": "This was a big hit with family and friends at a recent summer bbq party. I followed the recipe as is the first time. Pureeing and filter watermelon is a bit labor intensive but delicious. I did find a short cut with some watermelon water I recently found and have been enjoying at Costco. It is pureed watermelon, rind and all with no added sugar, etc and it worked just as well as the juice I made myself. I took some of the watermelon juice and made ice cubes so not to dilute the sangria too much to keep it chilled. I also froze blueberries and strawberries and put those in. I found you can freeze the mix after it has chilled the 4 hours if you need to transport it to a party. It defrosts quickly with the alcohol content and is ready to go in no time. This will be a long time summer favorite cocktail for us."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Karen Helkenn Weiman"
},
"reviewBody": "I used a single small watermelon and strained the juice thru a cheese cloth after I put it in the blender. The color and flavor were beautiful! I used Grand Marnier instead of triple sec and pinot griot wine. I did not add the simple syrup as it was sweet enough as it was, and used one orange, one lemon and one lime for the fruit. An extra lemon provided the garnish for each glass. It was a big hit!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mere1180"
},
"reviewBody": "I thought this drink was amazing! I'm not a sweet drink person so I was a little hesitant to use all the watermelon as well as the simple syrup that the recipe called for so I added it in small amounts to make sure it wasn't too sweet. I wound up using all the watermelon and simple syrup and did not find it too sweet as others had reviewed. The only deviation from the recipe for me was I used prosecco rather than white wine (had a bottle of it laying around), the bubbles gave it an extra bit of fizz which was nice!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Chris McCoy"
},
"reviewBody": "Made it exactly as instructions say. Very tasty and refreshing on a 105 degree Georgia summer day! Most excellent. Thanks for sharing this!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "tysmom13"
},
"reviewBody": "This was fantastic. I have to be honest I used strawberries instead of blueberries, white rum instead of vodka, grand mariner instead of triple sec because those were what I had on hand that was close to the recipe without buying new stuff. This recipe was refreshing and so yummy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Auriel Dye"
},
"reviewBody": "The recipe made wayyy too much watermelon juice. I tweaked the recipe a bit. I gently muddled the blueberries, not completely smashed them, so I could taste them and give them purpose. I also added more limes and oranges to combat the over powering watermelon taste. If the recipe didn't make so much watermelon juice I don't think I would need to add the extra fruit, but I still recommend muddling the blueberries. \n\nOverall, my friends and I enjoyed this sangria and I will definitely be making it again (with my modifications)."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Shell & Bill"
},
"reviewBody": "It was really good. I made it exactly as written. Simple syrup according to both all recipes and Martha Stewart is equal parts of water and sugar boiled lightly until sugar dissolves. Sangria tends to be slightly on the sweeter side. I thought one cup was perfect for the amount of watermelon and alcohol. Not too ironic that this tastes just like sweet watermelon and alcohol. Serve chilled, or over ice."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "opheliamiller"
},
"reviewBody": "This was awesome. I was a little worried at first because I tasted it before I added the fruit and let it chill. The watermelon I used wasn't very sweet so I used more of the simple syrup. I served it 24hrs later. It was great. I will be making this again!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Wicked_Twyst"
},
"reviewBody": "I tried this recipe as per the directions it was too much for my taste. I then made over the recipe and I used 6 cups of blended watermelon, 12oz if sprite, I used Moscato instead of the Zinfandel. Turned out fantastic."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Katrina"
},
"reviewBody": "I removed the simple syrup and it made all the difference. The watermelon flavor is a lot lighter without the extra sweetness. I also added less cubed watermelon in the end. Delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "JLAdams"
},
"reviewBody": "Although very good, by the end of my first glass I was already tiring of the sweetness and strong watermelon flavor. I added fresh slices from one Jalapeño to counter balance the sweetness and 'fruit only' flavor. For me and my guests that turned out to be the missing ingredient. Thanks for a wonderful summer drink."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Debbie22"
},
"reviewBody": "We started out by following the recipe exactly, but the sangria had no flavor. I thought we had a nice, sweet watermelon, but the juice just didn't have much taste. We ended up with a bland sangria....so we doctored it up with other juices until it tasted good. Don't think I will try this one again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Sweetie"
},
"reviewBody": "I followed the recipe exactly and used a whole round watermelon (seedless). I thought it was very good, but not 5 stars. I then read others reviews and added a little sprite to my glass and a little more triple sec to cut the watermelon and it tastes great. I'm going to experiment adding squeezed orange juice."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "bnc1219"
},
"reviewBody": "Perhaps I expected too much, but this was just eh. If I make it again I think I'll use a higher quality vodka and I may cut back on the watermelon used."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "What you cooking Willis?"
},
"reviewBody": "Love it. Used all the watermelon, which was for me 3/4 of a big melon. The straining part was crucial and brought the volume down tremendously. I didn't love the lime pieces, will probably just put in a 1/2 limes worth of juice instead. And for easy eating I just used canned mandarin oranges instead of the real fresh deal. That way without the chunks of lime and fresh oranges the fruit is easier to eat in your drink (less peeling involved). This was in the magazine!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Drmomoftwins"
},
"reviewBody": "Big hit at summer party!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Amy"
},
"reviewBody": "This recipe is so easy to make, and so delicious!! Everyone who tries it, loves it!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lisa Boyle"
},
"reviewBody": "This tasty delight is a lovely treat to toast summer. As suggested elsewhere, the simple syrup isn't needed unless you like things to be VERY sweet. The drink is sweet without being overly so without it. There's a discrepancy between the ingredients and the directions; use the directions for the amount of watermelon (12 cups total) and you'll be able to fill a gallon-sized container. We used our kitchenaid juicer attachment on the watermelon and got 8 cups of juice out of 9 cups of watermelon. (Experts are correct that watermelons are mostly water, it seems!)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Linda Lussier Provencher"
},
"reviewBody": "This was very tasty, but I found it to be a lot of work cutting up and blendnig the watermelon, then straining it. More effort than it was worth."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Aswish313"
},
"reviewBody": "Too \"watermelony\""
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Tricia Melat"
},
"reviewBody": "Very enjoyable! I followed the recipe excepting the orange (I forgot to get it), and I think that would have helped. Next time I will probably add orange juice or lemonade for some additional acidity."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Michele Mariotti"
},
"reviewBody": "So good - but it does take some time to make. But it is worth it! I didn't find it too sweet - maybe some people's proportion on the simple syrup was off? Very good summer drink! And it has a good kick!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tabitha"
},
"reviewBody": "Three guests and I thought this was a yummy drink will make again"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Diana Moutsopoulos"
},
"reviewBody": "What an amazing cocktail!!! I served this at a party and everyone loved it. I should say, however, that made as written it would be ridiculously sweet. My watermelons were average in sweetness, but I still omitted the simple syrup. The result was perfect. I used Cointreau instead of triple sec, but both are sweet, so the simple syrup is not needed. If I had added the syrup, the drink would have been disgustingly sweet. So, make as is - but forget the syrup!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Gessica"
},
"reviewBody": "Not much to say here EXCEPT this is so darn tasty I could have made this the entire summer if I found this recipe earlier. I didn't do much different to this except put different fruit (what I had on hand: Orange, lime, lemon). It is divine! Be careful --you can get tipsy quick =)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BFire"
},
"reviewBody": "Perfect! Didn't have blueberries on hand but it didn't matter. Will definitely make again during peak watermelon season!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Bonnie Middy"
},
"reviewBody": "This was great on a hot summer evening. I decreased the simple syrup to 1/4 cup and it was perfect."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "GRIAM01"
},
"reviewBody": "I noticed that the ingredients and directions are a bit off, so I made it with 9 cups of blended watermelon and then added the other 3, for a total of 12 cups altogether. I thought it was very good. If you wan to turn it into a spritzer, you can add sprite or 7-up. I am not sure how there are 16 servings, because it made about 3/4 of a gallon which is not enough for 16. So I doubled it for a concert and will take it to a concert for tailgating!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "gobbledog"
},
"reviewBody": "This was very good. I agree with one of the other reviews that it has a very strong Watermelon flavor. After one glass I was ready to dilute it with some 7-up (which was very good, by the way). Next time I will probably cut back on the watermelon. If you are wondering how much watermelon you need - buy ONE of the round seedless watermelons and that is more than enough. I didn't know what simple syrup was so those of you that don't know....its 2 parts sugar to one part water (1 cup of sugar to 1/2 cup of water is plenty for this recipe). Boil the water, add the sugar stirring constantly until desolved, remove from heat and there you have it - simple syrup!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Regan123"
},
"reviewBody": "I just made this and it is soo good! It hasn't even sat for the 4 hours and already wonderful! My husband even likes it and he doesn't normally like fruity drinks. I better stop sampling it or there will be none for the party tomorrow (and I'll be too tired to make it to the party!) I double the recipe, but only used half a watermelon. The watermelon is seperating a bit as it sits, but I'm sure I can just give it a quick mix before serving. Great Recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Sasha Jade"
},
"reviewBody": "It's an acquired taste"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BREEZYONE"
},
"reviewBody": "Nice for a refreshing, summer drink!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ange"
},
"reviewBody": "This recipe is sooooo good! I took it to a sangria party and this was easily the best one of the bunch. (I did not take credit... mind you, I'd have liked to!) Straining the melon is a bit of work, but it's well worth the resulting nectar!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kisavirgo"
},
"reviewBody": "Thought I would update my original 5-star rating since I made this again this summer. It's still excellent. I used Marq Phillips Hollys Blend wine and Agavero Orange liqueur. Wow, sensational! I used as little pulp as I could.\n\n\nExcellent. I froze it so it got slushy. I was skeptical to use a whole bottle of wine, so I made a half recipe and then went and made the other half."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "thisisprogress"
},
"reviewBody": "Delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Chance503"
},
"reviewBody": "It tasted like grapefruit juice. Wasn't watermelon enough. Disappointed."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sarah"
},
"reviewBody": "Excellent summer drink! I made it once and my mom and brother were begging me for the recipe! I used white zinfandel instead of dry white wine, I think it compliments with the fruit better. Also,I used frozen blueberries when I served it so it would keep the drink cooler for longer."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This was a hit, I make sangria for all our gatherings but thought I would try something different. Nice lite and refreshing, tasted like summer time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "afashionmaven"
},
"reviewBody": "This was a hit, I make sangria for all our gatherings but thought I would try something different. Nice lite and refreshing, tasted like summer time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "beerchick11"
},
"reviewBody": "This is one of the best drink recipes I have ever come across. The watermelon is so refreshing. It has been a hit at parties. I run the watermelon through my juicer to get rid of pulp and seeds."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Katrina"
},
"reviewBody": "It's actually a 3.5 star. I didn't have a container large enough to hold a full batch and had to play with the amounts to get it to fit, so that may account for some of my review. It does take a lot of watermellon. I used Pinot Grigio for the wine. It did come out quite sweet. But the other ladies in my documentary club loved it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rosa Bures"
},
"reviewBody": "Excellent, the girtls loved this one, next time I will replace the Triple Sec for Cointreau."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Anita Rita Chesney"
},
"reviewBody": "Made half a batch to try. Wasn't sure until it had fused. Yummy. What a refreshing drink to use the \"in season\" fruits. The blueberries add that extra flavor. Great job!!! I didn't srain the watermelon, love the texture as is..the \"pulp.\" This drink is flexible. Add more vodka or add more wine...it all taste good. I squeezed the orange and lime right into the mix. I think it would be a fabulous frozen drink."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Angela Dayle Windley"
},
"reviewBody": "I didn't use all of the watermelon called for. It was just too much. As it is any more watermelon flavor would have overpowered the rest. Also left out the blueberries. But all in all this was fabulous!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Uncle Dave"
},
"reviewBody": "Did anyone else think this made almost an unmanageable amount of watermelon juice? Maybe I did something wrong but I ended up with over 8 cups of juice before I added any wine, vodka, etc.. I don't have anything big enough to hold all that and the small ratio of wine to juice didn't seem right either. I ended up using a 2 quart pitcher, mixing the triple sec, vodka and simple syrup into the juice, adding the fruit and wine to the pitcher and filling up the rest with the juice mixture. It was very, very good still."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ModernSteph"
},
"reviewBody": "My guests and I really enjoyed this. Next time I'll put even more watermelon and maybe use a sparkling wine. But the recipe is delicious as is."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "gubby420"
},
"reviewBody": "I really loved this recipe, and I am not a fan of watermelon, per se. The first time, I halved it, and the only thing I had to change was I used light corn syrup instead of simple syrup. (I assembled all ingredients before I realized I hadn't made any!) Then I topped each glass with some lemon-lime pop, just for some fizz. It is so light and delicious, and to say it tastes like summertime is very accurate. The second time I made it, due to my lazyness, I just squeezed the juice of the orange and lime right into it. I didn't want all those pieces of fruit gettin' in the way of some good drinking! ;) You can have your alcohol, and still feel healthy about it. Thanks for the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "tigrejoyeux"
},
"reviewBody": "We found it to be a little heavy-tasting &amp; I added a can of peach nectar plus a sprig of mint which lightened it up nicely."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/202438/watermelon-sangria/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/77/drinks/",
"name": "Drinks Recipes"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/242/drinks/sangria/",
"name": "Sangria Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/202438/watermelon-sangria/",
"name": "Watermelon Sangria"
}
}
]
}
}
, "about": [
]
}
]