				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Watermelon Gazpacho"
,"datePublished": "2020-06-19T21:50:16.000-04:00"
,"dateModified": "2022-10-07T14:07:09.000-04:00"
,"author": [
{"@type": "Person"
,"name": "USA WEEKEND columnist Pam Anderson"
}
]
,"description": "Start your hot-weather meal with this easy, intriguing variation on the classic tomato cold soup."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/15Kc1msXICrBNzQbAFK4In1APLs=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/413340-510be2cf881641e4bd1ae90c8338f2b0.jpg",
"height": 250,
"width": 250
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Watermelon Gazpacho"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.3",
"ratingCount": "48"
}
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "110 kcal"
,"carbohydrateContent": "16 g"
,"fiberContent": "1 g"
,"proteinContent": "2 g"
,"saturatedFatContent": "1 g"
,"sodiumContent": "3 mg"
,"sugarContent": "12 g"
,"fatContent": "5 g"
,"unsaturatedFatContent": "0 g"
}
,"recipeIngredient": [
"2 cups 1/4-inch-diced watermelon",
"2 cups orange juice",
"2 tablespoons extra-virgin olive oil",
"1 seedless cucumber, cut into 1/4-inch dice",
"1 small yellow bell pepper, seeded and cut into 1/4-inch dice",
"1 small onion, cut into 1/4-inch dice",
"2 medium garlic cloves, minced",
"1 small jalapeno pepper, seeded and minced",
"3 tablespoons fresh lime juice",
"2 tablespoons chopped fresh parsley, basil or cilantro",
"Salt and freshly ground black pepper" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Process 1/2 cup of watermelon, along with the orange juice and oil, in a blender or food processor until pureed. Transfer to a medium bowl, along with remaining ingredients. Season with salt and pepper to taste. Refrigerate until ready to serve. (Can be made several hours before serving.)"
} ]
,"recipeYield": ["6"]
,"totalTime": "PT0M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "John Boston"
},
"reviewBody": "so refreshing on a hot summer day. some of the ingredients came straight from my garden. everyone loved it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kim A. LaBelle"
},
"reviewBody": "So refreshing"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Margot Lyons Puleri"
},
"reviewBody": "Perfect as recipe calls for! Second time making it and so refreshing and healthy for the hot summer! I used fresh basil this time, last time I used parsley and basil, both great! I added a little more lime juice than recipe. Got rave reviews from all our guests young and old!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Daniel Papadatos"
},
"reviewBody": "I did it use Jalapeño. I added fresh coriander and peppermint, garnished it with copped parsley and cracked pepper. A nice cool refreshing flavour. Enjoyed make it and will make it again with my own twist"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Alison Cattelona"
},
"reviewBody": "I loved this recipie. Because I had several on hand, I substituted two red ripe tomatoes peeled and seeded for a 3/4 cup of OJ. It reduced the acidity (I think). I blended with watermelon."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Alli Shircliff"
},
"reviewBody": "This was so quick and easy to make. I cut the pieces really small (like the size of pencil erasers) so you get all the ingredients in each bite. I used 1/2 cup oj and 1 1/2cup water instead of 2cups oj. Delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cassiopeia"
},
"reviewBody": "I LOVE this recipe! I've made it a couple times in the past, and I just made it for a boating trip this weekend. I doubled the recipe and made it as written, but without jalapenos, with dill instead of cilantro/basil/parsley (YUM), and with low-acid OJ because someone here suggested it. In my experience, people are often cautious to try this recipe, but get them to smell it and they always go, \"ooooh!\" You really can't imagine what the flavor will be until you try it, but it's goooood. I think next time I might puree the whole shebang and drink it out of a glass!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Veggie-cita"
},
"reviewBody": "This is the second gazpacho recipe I tried this week and this one is the winner! Since I had tomato juice from my first fail (different recipe) I used it rather than OJ which I didn't have. This was a delicious blend of \"warm\" not spicy, and refreshing flavors. Thank you for sharing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MegKowalski"
},
"reviewBody": "Super easy! The whole family enjoyed it! Perfect summer treat!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "PinchofThis"
},
"reviewBody": "Reached consistency of true Andalusian gazpacho by using only 1 and 1/4 cup OJ, processing half of the watermelon and dicing the rest, along with half of a cantaloupe. Did not reduce cilantro.\r\nServed as a starter in margharita glasses with very large croutons (day old french bread) and a Spanish white wine."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Denise"
},
"reviewBody": "I adjusted the proportions of the ingredients to taste; much more watermelon to 1 cup orange juice. I keep it relatively chunky. Finished amount fills large mixing bowl. Love it. Great response at pot luck July 2012. Made again yesterday; very very good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Susan Pettinger"
},
"reviewBody": "Just delicious! This will become a favorite, fast!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "dpillion"
},
"reviewBody": "This is a great recipe and I have served it many times for a benefit dinner party. I served it in a martini glass with a wedge of watermelon on the edge... looks impressive and oh so cool and yummy on a hot day"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Quinny"
},
"reviewBody": "This is a great summer soup and fairly easy. I omitted the jalapeno but kept everything else the same. The garlic flavor was a bit strong for me but everyone else loved it. A very nice change from regular gazpacho. Thanks for sharing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Abbey"
},
"reviewBody": "This was OK, but I didn't like the combination of the sweet watermelon with the other, more zesty ingredients in this dish. I will stick to more traditional gazpacho recipes from now on..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "rebeccahelen"
},
"reviewBody": "I loved this recipe. It's refreshing and healthy! I made a big batch for our concessions stand, but...it wasn't a big seller. I guess my crowd just isn't very adventuresome when it comes to food. Anyway, I loved it. I used a half cup of frozen OJ concentrate instead of orange juice because many reviewers mentioned this recipe being watery. I also tossed in some canteloupe, as someone else mentioned. Wonderful!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ChristineM"
},
"reviewBody": "I have tried to acquire a taste for gazpacho, as it is so healthy for you, but until now I just could not get into it. The fruity twist in this gazpacho recipe makes it easier for someone like me to enjoy. I LOVED this! The coolness of sweet watermelon, crisp cucumbers and yellow peppers combine beautifully with the zip from the garlic and jalapeno and herbs (I used a combination of cilantro, basil and mint). I used slightly less orange juice (squeezed two large oranges) and it was still very liquidy - but it is a soup, not a salsa, so it's fine to have a little extra \"broth\". Great idea and a wonderful recipe for someone who may not find cold soups appealing. I'm already rethinking my opinion of traditional gazpacho thanks to this recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "NATTYRO"
},
"reviewBody": "This was amazing!! Served at a summer al fresco dinner party and everyone loved it! A nice change to the traditional- try it!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "lisa"
},
"reviewBody": "We didn't like it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Julia"
},
"reviewBody": "Most of the time a food addiction is never a good thing unless it's as healthy and outstanding as this knock your socks off cross between spicy and cool, ying and yang most refreshing Watermelon Gazpacho. Be as indulgent as you want without a drop of quilt. This became my new favorite food EVER. However I think I went overboard a bit with this one and I ate it so frequently I am ready to put this to rest until next summer! It's probably a good thing watermelon is seasonal. I did however add a whole jalapeno pepper and I mixed things up a bit and exchanged 1/2 cup of Pineapple juice for the Orange. And Mint for the Cilantro. I just submitted another version of this Gazpacho with the ingredients and changes I just described to the Allrecipes team hoping they will include the other version. The marriage of all the ingredients is an unexpected and exotic blend of flavors. This makes an excellent first course or surprising contribution to a summer pot luck. Deeelish!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Damon"
},
"reviewBody": "This is definitely an off-the-beaten path recipe. Super healthy and a yummy mix of flavors. Definitely go with the cilantro! It tastes awesome. Also I recommend chopping everything pretty small-- otherwise you're basically eating salad with tons of watery dressing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "margaret"
},
"reviewBody": "This is a great recipe! Really yummy and a great way to use part of a watermelon. There is always so much watermelon - now I have a great way to use it! Thanks for sharing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Carolyn H"
},
"reviewBody": "Made this twice. Added zest of lime and more lime juice and some Sake wine...Love it.."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Hobbitjeff"
},
"reviewBody": "Absolutely delicious. Perfect for a first course on a hot summer evening, or even as a light lunch. Also, fits into my \"this recipe is incredibly easy but is so tasty that people think you truly slaved away over it\" category."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SUSIE"
},
"reviewBody": "This was fabulous! I made it for a large group today and they all loved it. I basically tripled the recipe but I used 2 English cukes (they were huge), about 4 cups of O.J., 2 jalapeno peppers, 1 each of yellow, red and orange bell peppers, 1 small red onion, and cilantro. The ingredients were the same but I adjusted the amounts a bit for the larger recipe. I also let it sit overnight and it was good advice. It mellowed a lot. The taste was wonderful and refreshing and it's now in my favorite recipes folder. Try this one. You really can't describe the flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Melissa"
},
"reviewBody": "Thank you so much. The tomato is too acidic for me, and though I'm not a fan of cold soups, I love this recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Iz"
},
"reviewBody": "This recipe is so refreshing and crisp. I'm a big fan of cold soups, and this one is so simple and easy on a hot summer day."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "khalito"
},
"reviewBody": "Great taste however Its definetely more watery than I would like. I tried it with less orange juice, cilantro, and try only processing half of the watermelon and dice the rest along with half of a cantaloupe"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Lora"
},
"reviewBody": "Very good but a lot of chopping. I'd suggest using a bit less onion than the recipe states."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kayjeckel"
},
"reviewBody": "AWESOME! Fast, easy, and delicious. I substituted peach/white cranberry juice instead of orange juice, which probably made a big difference in taste, but it was still a great summer dish. Thank you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "pinkypink"
},
"reviewBody": "Really good and refreshing. Definitely needs to be chilled overnight. Tastes amazing the next day. I love the combination of salty/garlic/sweet/sour/hot. It's a pretty good combination of flavours."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Brian Chaffee"
},
"reviewBody": "This was OK - I was disappointed after reading all the other great reviews. Perhaps my palate is not sophisticated enough to appreciate this one. My kids are champs at trying new things and neither one liked this at all. Probably will not make this one again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "cburke"
},
"reviewBody": "We like this a lot at my house. I substituted the juice of one ripe orange and two lemons for the orange juice and lime juice, and left out the garlic. It makes and excellent side dish for really spicy gumbo, with some crusty bread."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jennifer Lord"
},
"reviewBody": "I was intrigued by the concept of the cold soups.. so I decided to give this a try. I used Parsley (it was on hand) and orange bell peppers (they were on sale)... it came out very well, very cool and mildly sweet flavors. The notes are crisp from the vegetables and fruits in the soup, and no one flavor of anything stands out. I served it to the boys and they were in awe, it was gone very quickly. I suggest you try it just to see how you like it! I was hoping the acidity would be brought down from the cukes and the watermelon, so my only suggestion is to get the low-acid OJ, I will make it again with the low-acid someday. Perfect dish for a hot day when you dont want to eat. I also saved a smidge in a bowl to be refrigerated overnight, the next day it had AMAZING flavor. I highly recommend putting it in the fridge overnight."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "IMVINTAGE"
},
"reviewBody": "I cut the recipe in half &amp; I added two small homegrown serrano peppers (omtting the jalapeno). I also used an orange bell pepper because that's what I had. Pam's recipes are great so I never make many changes. This was really good &amp; refreshing &amp; paired perfectly w/ Grilled Honey Shrimp &amp; Grilled Asparagus w/ Orange Wasabi Sauce. Thansk for another great recipe Pam!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Donna Arends Hansen"
},
"reviewBody": "All the adults who tried this gazpacho enjoyed it very much. The children didn't care for it, but I didn't really expect them to. This is an excellent, refreshing soup. I imagine if it were all pureed, it would also make a nice drink (a la V-8)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kimco"
},
"reviewBody": "This recipe goes down like gangbusters everytime I make it for a summer BBQ. Everyone begins by being incredibly skeptical; \"watermelon soup with GARLIC???\" but ends up raving.\nThe second time I made it I added 2 extra cloves of garlic and used 3 cups of watermelon and OJ. The taste effect was negligable.\nMake this!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Excellent recipe...I will definitely make it again. Only change I might make is add a second jalapeno...I like my food spicy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Michael Dinsmore"
},
"reviewBody": "I really enjoyed this. I thought it sounded weird and after I tasted the watermelon that I bought (which was mediocre) I didn't think this would be good, but I was wrong. It was very refreshing and lighter than a normal gazpacho. I paired it with chili and that was perfect! I followed the recipe except that once it was done it was a little too chunky for my taste and put it back in the blender for a very quick spin."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "lindsah of the sauga"
},
"reviewBody": "i tried this recipe in the hopes that it would make me like watermelon...it didnt but it is an interesting take on regular gazpacho."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/76987/watermelon-gazpacho/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/184/soups-stews-and-chili/soup/vegetable-soup/",
"name": "Vegetable Soup Recipes"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/14767/soups-stews-and-chili/soup/vegetable-soup/gazpacho/",
"name": "Gazpacho Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/76987/watermelon-gazpacho/",
"name": "Watermelon Gazpacho"
}
}
]
}
}
, "about": [
]
}
]