				
[
{
"@context": "http://schema.org",
"@type": ["Recipe"]
,"headline": "Weeknight Chicken Cordon Bleu"
,"datePublished": "2018-06-08T09:14:54.000-04:00"
,"dateModified": "2022-07-14T16:18:05.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Elaina"
,"url": "https://www.allrecipes.com/cook/196415"
}
]
,"description": "Chicken breasts are wrapped with sliced ham and Swiss cheese, and baked in a creamy chicken soup sauce."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/LDewmfpF3r0Ou9CqYLvGBC--Hik=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/8619602-01c5bd239d5045e5b79db05359f2b518.jpg",
"height": 1688,
"width": 1125
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Weeknight Chicken Cordon Bleu"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.6",
"ratingCount": "226"
}
,"cookTime": "PT25M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "538 kcal"
,"carbohydrateContent": "20 g"
,"cholesterolContent": "144 mg"
,"fiberContent": "1 g"
,"proteinContent": "46 g"
,"saturatedFatContent": "14 g"
,"sodiumContent": "1034 mg"
,"sugarContent": "4 g"
,"fatContent": "29 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT15M"
,"recipeIngredient": [
"1 cup milk",
"1 cup dry bread crumbs",
"6 skinless, boneless chicken breast halves - pounded to 1/4 inch thickness",
"salt and pepper to taste",
"6 slices cooked ham",
"6 slices Swiss cheese",
"2 tablespoons vegetable oil",
"1 (10.5 ounce) can condensed cream of chicken soup",
"0.5 cup heavy cream" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Preheat oven to 350 degrees F (175 degrees C)."
} ,{
"@type": "HowToStep"
,"text": "Place milk and bread crumbs in two separate shallow bowls. Season the chicken with salt and pepper. Place one slice of ham and one slice of cheese on each piece of chicken; roll, and secure with toothpicks. Dip each chicken roll into milk, and then into breadcrumbs."
} ,{
"@type": "HowToStep"
,"text": "Heat oil in a large skillet over medium-high heat. Brown rolled chicken on all sides. Arrange the chicken in a 9x13 inch baking dish."
} ,{
"@type": "HowToStep"
,"text": "In a small saucepan over medium heat, blend soup and cream; season with salt and pepper to taste. Pour over the chicken."
} ,{
"@type": "HowToStep"
,"text": "Bake in the preheated oven for 15 minutes, or until chicken is no longer pink and juices run clear."
} ]
,"recipeYield": ["6"]
,"totalTime": "PT40M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "p-gootee"
},
"reviewBody": "Delicious, everyone loved it to the last drop. I used garlic salt and garlic pepper on the chicken and grated parmesan cheese in the bread crumbs. The sauce is simple and so good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "TheDarkLord"
},
"reviewBody": "This recipe is great. I edited it a good amount by turning it more into a casserole to save time on the pounding of the chicken. instead I cut the chicken into bite sized bits and breaded them. I threw them in the cast iron pan with chunks of ham and fried them up nice. I slowly transferred them to a casserole dish as they finished. then threw on the cheese and the soup and baked as directed."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Toni Tanner"
},
"reviewBody": "I needed to cook it fifteen mins longer than it said. The flavor and texture was good. I will make it again. Needs more spices."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Elizabeth"
},
"reviewBody": "This is a pretty basic recipe, but you can make the sauce your own. First, I used seasoned panko breadcrumbs with an egg wash. The sauce needs help. I started by sautéing some garlic and butter and added some chicken stock to the pan. I added the soup, but it was still lacking flavor so I added some cooking sherry. That helped, but I decided to add some herbs from my garden too. I added fresh parsley, thyme and sage. It was so good after that! I left the sauce off of the chicken while it baked to keep the chicken crisp and used it more like a pan sauce than a gravy. Definitely a good way to use up some of that old soup in your pantry."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Yoly"
},
"reviewBody": "This is very good considering the little effort and time it took to make. I used Costco's Kirkland ham and in my opinion, it's a little too much. Or maybe my chicken breast filet was too thin? Regardless, we enjoyed it very much. Thank you for the recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "fabeveryday"
},
"reviewBody": "This was delicious, and very easy to make. It’s a keeper for sure!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Erica Morales"
},
"reviewBody": "Very Delicious. The only thing I tweaked was I Seran wrapped the chicken after breading it and let it sit in the fridge for an hour (this helped the breadcrumbs stick better). I also cooked the chicken in the air fryer, I recommend spraying the breadcrumbs with PAM first and air frying it at 380 degrees for 20-25 mins (flipping chicken halfway through). Then I added the sauce to it at the end. I made a simple rice pilaf (using Sarah's Rice Pilaf recipe from AllRecipes minus the chicken broth) and mixed veggies. The sauce gave everything so much flavor, super tasty!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Pipersmom"
},
"reviewBody": "I made this for a ladies get together and it was a smash hit. Very easy ans directions were spot on."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Chris MacNeal"
},
"reviewBody": "it was tasty. I probably should have butterflied and folded the chicken instead of rolling it"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lindsay Winterton"
},
"reviewBody": "So yummy! I substituted the ham with bacon (because that's what I had at home, and bacon makes everything better) and the swiss cheese with muenster. I'll definitely be making it again. My husband loves cordon bleu and this is an easy recipe to make even with a busy schedule."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "ThoHug"
},
"reviewBody": "My children loved it, but I thought the sauce that's on top of it is too rich. Also, I had to cook it for almost twice the time suggested to cook the chicken breasts throughout"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "nilla"
},
"reviewBody": "Had to cook it longer then the recipe called for but the taste was amazing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Freddy Arreola"
},
"reviewBody": "On fire! wow, everything came together perfectly."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Reebee315"
},
"reviewBody": "My husband and I LOVED this recipe. I didn’t have Swiss cheese so I added mozerrella. Also, I added a package of dry ranch dressing to the sauce before pouring over the chicken. Gave it a really nice flavor. Definitely will make this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dawn"
},
"reviewBody": "Awesome!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Roseann Culin Lindsey"
},
"reviewBody": "Everyone loved this. Next time I'll add a little more cheese. I made the sauce, but I put in way too much pepper. I added brown sugar to counteract the pepper. This really made the sauce terrific."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Dominic"
},
"reviewBody": "It turned out pretty good! I liked the soup mix on top. I’d definitely cook it 20-25 minutes instead though, 15 minutes isn’t long enough."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Mzchini"
},
"reviewBody": "came out pretty good..for the most part I followed the recipe but i seasoned the chicken more with garlic powder and onion powder and mixed the bread crumbs with flour. I also sprinkled some parmesan cheese on top to give it a little extra flavor. cream of chicken sauce was good, didn't realize something so simple would go so well with cordon bleu. I will make it again but I think I will try to flatten out the breasts next time or buy it like that to save time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lisa"
},
"reviewBody": "It was delicious!! The only thing I did differently was only put some of the sauce on the chicken when I put it in the oven to cook. I let the rest of the sauce stay warm on the stove top, then when chicken was done cooking I added more sauce."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kafreier"
},
"reviewBody": "I followed the recipe exactly. the sauce had a nice flavor but could have used more depth. Be sure to brown the chicken well in the skillet before putting in the oven with the sauce over it, to avoid it getting too soggy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Pinrecko Artis"
},
"reviewBody": "This is my weekday \"go-to\" recipe when the wife wants Chinese, the kids want pizza, and I want Mexican. This dinner is SURE to bring the family to the table with a smile on their faces! Get ready for a lot of lips smackin' goodness when you make this."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "ginga"
},
"reviewBody": "This would have gotten 5 stars except that it did not cook with the time stated. It was still raw after the pan fry, and 15 min in oven. I had to continue to cook an additional 25 minutes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Laura Johnson"
},
"reviewBody": "I've got to say this is only about the 2nd recipe that makes me feel like a gourmet cook in my Central African home! Of course, I didn't have the exact ingredients so instead of ham and swiss cheese I used bacon bits and mozzarella. I had to make my own condensed soup (about the easiest thing ever to do with a thick white sauce and chicken bouillon.) BUT I did have cream. Who could know you shouldn't guard your precious cream just for desserts?! I was really pleased to discover I could do all the cooking on the top of my stove since turning on my oven in the evening really heats up my house. I left the chicken in the frying pan, added the sauce and covered the pan. I turned the burner to low and used my stove top spacer ring to move the pan off the direct heat and it was done in the same amount of time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "david"
},
"reviewBody": "not much on soup for me i'll do it again later using my own doctoring"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "48fan"
},
"reviewBody": "I read many of the reviews and incorporated several into my dish. I didn't have a good tool to flatten the chicken and had purchased large breasts so I cut them in half , breaded them and then fried them in a small amount of olive oil. I then placed one half of the chicken breast in the pan, cheese, ham and topped it with the other half. And like another reviewer, I used 1% milk instead of the heavy cream due to the calorie content. When it was all said and done the dish was delicious and I will make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cookyjar"
},
"reviewBody": "ABSOLUTELY FABULOUS! I'm a big fan of cream of chicken soup for sauces."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rich Bradley"
},
"reviewBody": "This was on the money. I added diced green onion in the rollup and used a bit of garlic salt. Huge success."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Christine Dove Barnett"
},
"reviewBody": "I used another reviewers hint to lay the chicken breast flat, layer the cordon bleu ingredients on top without rolling and bake..! It was perfect! I'll never roll again! It wasn't too thick, it was juicy and every bite was perfect with this amazing recipe. Side note, I didn't have heavy cream but used buttermilk to coat my chicken and milk with the soup and it was delish!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kevin"
},
"reviewBody": "This recipe was easy to make and a family favorite!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ellen23"
},
"reviewBody": "Easy dish to make! I used cream of mushroom soup instead of cream of chicken, and 1% milk instead of heavy cream. I also added some sliced mushrooms and a little splash of red wine to the sauce! Yummy"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jessica Kloeppel"
},
"reviewBody": "This was absolutely delicious, my husband raved about it for days!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Vae Solis"
},
"reviewBody": "Chicken Cordon Bleu is not hard to make, but I thank you for the inspiration!\n\nI made breadcrumbs by taking a loaf of Italian bread before it turned, sliced it and drizzled olive oil and chicken stock, sprinkled rosemary and thyme (fresh from the garden), baked it at midway until it was dry, not burnt, then used the magic bullet to pulverize.\n\nI split three fat chicken breasts into six filets, added ham and swiss, rolled 'em, browned them in olive oil with garlic pepper salt, and baked 'em for 10 min at 350.\n\nMade a simple sauce as suggested from condensed cream of chicken soup mixed with half &amp; half, pepper, salt, etc.\n\nServed with steamed broc, carrots, snap peas, and water chesnuts. Loosening my belt buckle as we speak."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sylva"
},
"reviewBody": "I was nervous about making this, my husbands favorite dish is Cordon Blue. He LOVED it!!!!!! I used two pieces of Black Forest ham on each roll and I instead put the chicken on a oven safe rack over a baking sheet so that it wouldn't get soggy. I added the sauce after as well to keep the bread crumbs texture. This was a definite hit and super easy to make! I will be making future tweaks to it to see how much I can improve it, but it is by far the best Cordon Blue we've had!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "HistoryBuff"
},
"reviewBody": "This was good. It was also my first attempt at making chicken cordon bleu, so I was pleasantly surprised at the results. I tried following the recipe exactly as it's written, but browning the chicken in a pan did not work out for me. The chicken pieces kept falling apart, so I gave up and just went ahead and put them in a 9 x 13 baking dish and into the oven they went. I baked them for 40 minutes, then poured the cream mixture on top, and baked them for an additional 15 minutes. The chicken pieces stayed together, and everything cooked just fine by skipping the browning step. \n\nI do agree with other reviewers who suggested using milk instead of heavy cream to save on fat and calories. I think the taste would be the same, so I'll plan to make that change next time. I seasoned the chicken with liberal amounts of salt and pepper before dredging them in milk and bread crumbs, but I still thought the flavor of the chicken was a little bland. Next time I will probably try some additional spices."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "RYLA06"
},
"reviewBody": "My whole family said they would eat this again, so it's a keeper for me. The only thing I changed was using half and half instead of the heavy cream in the sauce. I will make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "shelia s "
},
"reviewBody": "Very good, used thin chicken breasts...no leftovers, was a big hit, will make again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Michael Josephson"
},
"reviewBody": "I added Montreal Chicken seasoning and it turned out fantastic"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I don't know if I did somthing wrong but this was awful."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tbryan08"
},
"reviewBody": "Yes it was good, leftover tasted líke KFC."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nik Halaszi"
},
"reviewBody": "So easy and fast. Tasted great. Added a few slices of Swiss to the sauce and allowed to melt down. Required 35 minutes for interior temp to get high enough."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "michelle "
},
"reviewBody": "This recipe works great we just had to bake it for 35-40 minutes to make sure it was cooked."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Seanna Oliver"
},
"reviewBody": "Delicious!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "chrissymoo"
},
"reviewBody": "Very good, but a little harder to make than I expected. The chicken had to cook a little longer than indicated as well."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "tannis"
},
"reviewBody": "I have made this and think it is awesome! Even my picky kids loved it. The only thing I did different is to leave the sauce on the side to dip cause I like the breadcrumbs crispy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "karataronno"
},
"reviewBody": "my hubby didn't care for this recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KerriK112"
},
"reviewBody": "Very tasty! I will be making this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kianna"
},
"reviewBody": "If I could I would make this every night! Best chicken recipe I've made in a long time! It was a huge hit in my house!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Avariella"
},
"reviewBody": "I used honey wheat bread crumbs and it turned out even better. It was surprisingly easier to make then I thought it would. It only took 10 minutes of actual prep time so I will definitely add this to my usual weekly recipe box."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Mikey Kone"
},
"reviewBody": "This was good, didn't take too long either. I added 1/2 slice of swiss on top before adding sauce. I also added some fresh thyme to the sauce. Thanks for a nice recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jeff and Jeni"
},
"reviewBody": "My family really enjoyed this recipe. We did not have the sauce as we're not big on them and I forgot to make this one. I used corn flake crumbs and a taco blend of cheese since these were what I had on hand. I also didn't brown on the stove top but cooked them for 45 minutes as others suggested in the oven. Without the sauce the coating on the chicken came out crispy. We'll be making these again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Valeri Brown Wolffe"
},
"reviewBody": "Great for any night and presents itself great for guests! Husband isn't a huge chicken fan but he cleaned the plate. Tastes terrific!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "StephaniePalmer"
},
"reviewBody": "I didn't have any cream of chicken soup, so I used cream of mushroom instead. It added a really nice flavor, and I think I'll continue to use it. I also used mozzarella instead of Swiss. Didn't make much of a difference, and I usually have mozzarella around so it's easier. Overall, I really loved this recipe. It got added to my monthly rotation of meals!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "deet"
},
"reviewBody": "The best way to eat chicken in my opinion!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rod_R"
},
"reviewBody": "Quick &amp; Easy and soooo goood! I had to use provolone and milk instead of heavy cream,topped w/cheddar, otherwise as prescribed. No leftovers, family wanting more."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sassyoldlady"
},
"reviewBody": "So easy, and tasty too. I pounded, rolled up with some deli honey ham I needed to use up, put on some shredded cheddar(out of swiss), stuck in a few toothpicks. A little dusting of garlic powder and some s&amp;p, dipped in buttermilk(something else I needed to use), into some panko and then a hot skillet. Browned, put in 13x9. Mixed in some buttermilk with a can of cream of chicken, spooned over, covered and cooked till up to temperature. About 45 minutes, my chicken was still pretty thick. Thanks for an easy weeknight recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sassyoldlady"
},
"reviewBody": "So easy, and tasty too. I pounded, rolled up with some deli honey ham I needed to use up, put on some shredded cheddar(out of swiss), stuck in a few toothpicks. A little dusting of garlic powder and some s&amp;p, dipped in buttermilk(something else I needed to use), into some panko and then a hot skillet. Browned, put in 13x9. Mixed in some buttermilk with a can of cream of chicken, spooned over, covered and cooked till up to temperature. About 45 minutes, my chicken was still pretty thick. Thanks for an easy weeknight recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "boys2"
},
"reviewBody": "This was time consuming but delicious. I would not have time to make it on a weeknight. For the sauce, I misread the recipe and mixed the soup with sour cream but it was fine."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "soapscrubs"
},
"reviewBody": "So. Ridiculously. Good. As per other suggestions I browned the chicken first, and cooked the sauce separately. I cooked it for about twenty minutes and served over egg noodles. Thank you for the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "laurmoore"
},
"reviewBody": "Added a touch of spicy brown mustard to the sauce. So good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Betty Crocker"
},
"reviewBody": "I subbed turkey for the ham and used pepper jack cheese instead of swiss. This made a very moist chicken. I recommend flavoring the bread crumbs if possible because my boyfriend thought this was a little plain. I think adding medium hot breading mix to the bread crumbs would be a tasty addition. Just something for a little extra kick. I also served this with a side of quinoa and purple potatoes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ALASKANSNOBUNNI"
},
"reviewBody": "Such a great recipe. I made rice, instead of noodles...and it was DELISH! \nI also fried the chicken breast with ham and swiss inside, first, and then placed them in a baking dish, and put it in the oven at 200 to finish cooking off and stay warm while the rice was cooking. The cream of chicken soup and heavy whipping cream sauce was perfect...I added a couple dashes of garlic powder."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I made this using egg first then breadcrumbs and I baked it without the sauce. I used 1/2wine 1/2water instead of cream and I spooned the sauce over after."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Amy"
},
"reviewBody": "This wa delicious. The only changes I made was to add italian seasoning to the bread crumbs, and made my own sauce as my son is sensative to MSG (no canned soup). 1 tbsp butter melter, 1 tbsp flour, cook over heat for 1 min, add 1 cup chicken broth, and 1/2 cup milk for creamyness, simmer until think adding whatever spices you like, I added garlic, onion and pepper. I also added 2 cups of sauted fresh mixed mushrooms. Me and my son wait until chicken breast goes on sale and then make a ton of these, bread them, wrap them in saran and freeze them. The breading stays on great, but do not defrost them in the mic as the cheese will melt and leak out."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ForneySAHM"
},
"reviewBody": "THIS WAS AWESOME...My husband, 2, 3 AND 5 year old kids all ate it up. I used cream of mushroom because I was out of cream of chicken. I also used crushed Ritz instead of regular breadcrumbs. A KEEPER!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "ERiley"
},
"reviewBody": "Very good and easy. The sauce is ok - I'm going to play around with it and come up with something equally as easy but a little better tasting."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lollylew"
},
"reviewBody": "I have made this a few times now and my husband just RAVES over it! One suggestion is make sure that you pound the chicken EXTRA thin as this helps when you have to roll them up. Definitely a keeper!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Sandra6007"
},
"reviewBody": "THis was delicious, only modification I made was adding tbs of Marsala wine to the sauce."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Wiser1"
},
"reviewBody": "This was good- my husband and son loved it- I coated theirs with bread crumbs and parm cheese- parm cheese for mine only (I low-carb)- used campbell's cream of chicken and mushroom and 1/2 &amp; 1/2- (lowest carb) - thanks for the recipe-"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "scotty"
},
"reviewBody": "was a good dish, my girl friend loved it,and i will be making this one again!THANKS"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Caitlyn"
},
"reviewBody": "This was FANTASTIC! Only thing I did different was to use half and half and it was absolutely delicious. Served over noodles, the whole family loved it. Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sherry Silveira"
},
"reviewBody": "I started following this recipe, then made changes as I went along. I cut up the chicken in 2\" chunks, dipped them in beaten eggs, rolled them in cracker crumbs then fried in oil. I set this aside. In a casserole dish, I placed cooked rice, partially cooked broccoli, the chicken, diced ham and covered with a basic cream sauce. Then sprinkled the top with cheese and baked it in the oven. It was excellent."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Patricia Canerdy"
},
"reviewBody": "Excellent and easy. My only mistake I should have pounded my chicken out thinner."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "COOKIES4MONSTER"
},
"reviewBody": "My husband said this was by far the best thing, I have ever made."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rebecca Matichuk Huebner"
},
"reviewBody": "We all loved it. I didn't bother browning the chicken (too much hassle with the toothpicks). I just cooked it in the oven without the sauce for 10 min. to brown, then added the sauce and cooked for 10 or 15 min. longer. I have made it for friends a couple times and it has been a hit everytime."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KRNLANCE"
},
"reviewBody": "This was a fast and easy recipe to do. It has become a family favorite.Pre browning the chicken before putting into the oven cuts baking time in half and the cheese doesn't melt out of the chicken before its done baking.."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "VOODOOCHEESE"
},
"reviewBody": "This was ok.. I don't usually make recipes with soup in them, but I made an exception this time. I added some dried mustard, onion powder and a little white wine to the sauce to give it more flavor, and that helped. Although I didn't like the breadcrumbs very much either. I think I'll give the other cordon bleu's a try!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "JEN27VA"
},
"reviewBody": "We really liked this recipe. The second time I made it I marinated the chicken (after pounding it) in some Italian dressing (for about 2 hours) and used seasoned bread crumbs. Yummmm!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LaurenHammond"
},
"reviewBody": "Big hit with everyone, although I used breasts-butterflied and then pounded thin, also wrapped each roll tightly in Saran Wrap and threw in the fridge for a few hours, then finished the breading and browning, the rolls stayed together beautifully with minimal leaking."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kybred72"
},
"reviewBody": "Excellent and not difficult! Husband really enjoyed this and asked that I add this to my recipe collection! Wish I knew how to prevent the cheese (I used provolone) from melting and oozing out. I ended up adding a slice of cheese on top of each chicken breast. Will definitely make again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Amber Pawlicki"
},
"reviewBody": "Super good and easy. The bread crumbs didn't stick to the chicken very well. Next time I will use egg."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "lexpsu"
},
"reviewBody": "I didn't have enough chicken or the condensed soup to make the full recipe, so I pared down the sauce suggestion from Cooking 101 below. Took WAY longer to cook than 15 mins; it took mine 45 mins to cook all the way through. Taste was good though, not too time intensive."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "pat"
},
"reviewBody": "made this today ,,it was great.\nthe only thing I had to cook it longer than 15 minutes"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Pepe"
},
"reviewBody": "I tried this recipe and it is really great. The name says it all. Perfect for after work. The whole family loves it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "katiewinn"
},
"reviewBody": "tasted amazing but was a mess to make"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lyndylou"
},
"reviewBody": "Made this for New Years and it was yummy. Made a couple changes. After I rolled up chicken I coated with egg wash and rolled in a mix of half flour, half bread crumbs with paprika. Did not need toothpicks. Then I browned rolls which locks the moisture in the chicken. Baked without sauce for about 30-40 minutes. On the stove top I combined cream with cream of chicken with herbs soup and added swiss and cheddar to the sauce. we love cheese. Very good next time i will just use milk for the sauce as cream is so fattening and did not taste much differnt. THANKS for the recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sugarspice173"
},
"reviewBody": "This was a very quick &amp; easy &amp; yummy dish. I followed all instructions pretty much to a tee, but used no salt, used thick cut sweet ham from the deli, used reduced fat cream of chicken. I had to cook quite a bit longer than 15 minutes, I would estimate I cooked it about 45 minutes. It was very moist on the inside &amp; the outside breading was wonderful! The cheese melted a little out, but not much. I did use swiss &amp; monterrey jack &amp; it tasted great. My fiancee kept telling me how good it was. As a side, I made plain white rice &amp; chopped broccoli seperately &amp; when they were both finished, I combined them, added some pepper &amp; butter &amp; scooped some of the sauce from the chicken dish into rice. It was soooo good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MommyChelle"
},
"reviewBody": "Great Recipe. My wonderful husband made the whole thing! He was so proud to serve it that night. This was the second time we've made it. Tastes good with any kind of cheese."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "COTECOTE"
},
"reviewBody": "Most favorite recipe!! It takes no time at all to put this together and looks like you spent all day! I could eat this every night! I always double the amount of meat and cheese in each chicken. Just gives it more flavor!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Meg E."
},
"reviewBody": "Great recipe. I put the prepared chicken rolls over a bag of baby spinach and then pour the soup mixture over that. Sprinkle with extra swiss cheese. I have also had luck using turkey instead of chicken. Serve with brown or wild rice."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Heidi"
},
"reviewBody": "Great!! My b/f loved it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "KATE911"
},
"reviewBody": "I thought it was good, and my parents liked it. It took much longer to cook than 15 minutes though, may have been because I skipped browning the chicken in oil first. The sauce however is wonderful! I added some swiss cheese and served it on the side and it was great! Especially good over asparagus."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Vicki Piatt"
},
"reviewBody": "\"Weeknight\" Chicken doesn't do this chicken justice. Although I made a few minor tweaks I made it when I was short on time on a Sunday evening! It was decadent for my husband and two boys! We will definitely have it again weekend or weeknight!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I have a large family, and everyone loved it. Will be a favorite in our house. Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Excellent taste and so easy! I had never made anything like this before. I will make it again and again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cooking 101"
},
"reviewBody": "This was good. I've made this several times but my husband is not a big fan of the soup so instead of the soup, I mixed 1/3 cup of butter, 1/3 cup flour, 1 3/4 cups of chicken broth (99% fat free) 2/3 cups of 2% milk. 1/4 tsp. pepper, 1/2 tsp. salt (optional) Mix well. Whisk in sauce pan till thickens then pour over chicken and bake."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "molly f"
},
"reviewBody": "My family loved this dish! The second time I made it, I changed the used healthy request soup and 2% milk. I also added a little white wine to the sauce. Turned out great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Andrea Hope"
},
"reviewBody": "A very tasty and easy dish! I also used the thin-cut chicken breasts and did not add any salt. The dish turned out very well and was simply delicious. My husband loved the sauce in this dish -- you would never guess it is a cream of chicken soup. Thumbs up!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Brandy Lee"
},
"reviewBody": "Excellent AND easy! I started with thin-cut chicken breasts; they may have been a bit more expensive, but it's worth any time I saved. I did season each piece of chicken with salt and pepper, although I will definitely skip the salt next time; in the end, it was slightly TOO salty. I chose Provolone over Swiss and used deli thin-sliced honey ham. I used olive oil for the browning, but I think I'll skip this step altogether next time; it just doesn't seem totally necessary. The sauce was really good! Who'd know it was a cream-of-something soup? I added a lot of pepper at this point; pepper is a wonderful thing! I can't say enough about how easy and truly delicious this is. My family couldn't say enough about the delicious part either!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jennifer Coelho Smith"
},
"reviewBody": "Excellent and very easy to make. Thanks"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/23630/weeknight-chicken-cordon-bleu/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/16954/main-dish/chicken/",
"name": "Chicken"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/17371/main-dish/chicken/chicken-cordon-bleu/",
"name": "Chicken Cordon Bleu Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/23630/weeknight-chicken-cordon-bleu/",
"name": "Weeknight Chicken Cordon Bleu"
}
}
]
}
}
, "about": [
]
}
]