				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Whipped Cream Cream Cheese Frosting"
,"datePublished": "2000-04-08T10:50:41.000-04:00"
,"dateModified": "2022-12-18T13:54:55.000-05:00"
,"author": [
{"@type": "Person"
,"name": "Tom Parker"
,"url": "https://www.allrecipes.com/cook/24328948"
}
]
,"description": "A whipped cream cheese frosting that is delicate but creamy, making it the perfect icing on any cake. This will be your new favorite frosting."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/NiqXUAh_EkAxZ9FyMGUmWyS6A1o=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/7856595-whipped-cream-cream-cheese-frosting-Catarina-Lewis-1x1-1-19ab4858c7f8476b80f58a3e9be6dd9a.jpg",
"height": 1500,
"width": 1500
}
,"video": {
"@type": "VideoObject",
"embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=1811420662001",
"description": "Cream cheese and whipped cream make an addictive frosting.",
"duration": "PT2M5S",
"name": "Whipped Cream Cream Cheese Frosting",
"thumbnailUrl": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/1033249144001/d3a76121-2fd9-4901-a2ee-edb164a031a6/63df2bb1-e072-4937-821a-3e2d4d4c2f2d/1280x720/match/image.jpg",
"uploadDate": "2021-07-01T00:24:20.039-04:00"}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Whipped Cream Cream Cheese Frosting"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.7",
"ratingCount": "1796"
}
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "233 kcal"
,"carbohydrateContent": "18 g"
,"cholesterolContent": "61 mg"
,"proteinContent": "2 g"
,"saturatedFatContent": "11 g"
,"sodiumContent": "91 mg"
,"sugarContent": "17 g"
,"fatContent": "18 g"
,"servingSize": "enough frosting for a 2 layer, 9-inch cake"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT15M"
,"recipeIngredient": [
"1.5 cups heavy whipping cream",
"1 (8 ounce) package cream cheese",
"1 cup white sugar",
"0.125 teaspoon salt",
"1 teaspoon vanilla extract" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Beat whipping cream in a mixing bowl until stiff peaks form; set aside."
} ,{
"@type": "HowToStep"
,"image": [
{
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/NiqXUAh_EkAxZ9FyMGUmWyS6A1o=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/7856595-whipped-cream-cream-cheese-frosting-Catarina-Lewis-1x1-1-19ab4858c7f8476b80f58a3e9be6dd9a.jpg"
}
]
,"text": "Combine cream cheese, sugar, salt, and vanilla in a large bowl. Beat until smooth, then fold in whipped cream."
} ]
,"recipeYield": ["12"]
,"totalTime": "PT15M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This is my favorite recipe ever!!! Everyone always thinks I bought the cake when in reality it was homemade. For anyone who has issues with the stability of the cream, I will admit as is it will not hold up unless piped directly on top and cooled. However, after research and trial and error I found if you add unflavored gelatin your life will be changed. Stabilizing this frosting is a must if you want to pipe intricate designs that will hold."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I'm with those who say the right consistency is all in the whipping of the cream. I whipped the cream until it left the sides of the bowl (probably a little too much but I wasn't taking any chances). Chilled the bowl and beaters first. The consistency was perfect, and I adjusted the sugar down to my taste. Oh yum!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "njj"
},
"reviewBody": "Used powdered sugar. Not too sweet."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sandy Crabtree"
},
"reviewBody": "Nice and light, not too sweet. Used 3/4 c sugar instead of 1 c"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This frosting was a hit! It was light and not too sweet. I used powdered sugar instead of granulated sugar. I was looking for a base frosting that I could add crushed Oreos to and this worked perfect. I will definitely use this recipe again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "perfect. I whipped the cream way past the point of firm points: I did this as I read the frosting was runny for some people. Then I whipped the cream cheese with confectioners/powdered sugar as I misread the recipe to use white sugar. Then I folded the two together. Consistency was perfect, slightly thicker than pudding. I also used half the sugar but it was still very sweet, probably because I used powdered sugar."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Abigail Frey"
},
"reviewBody": "I feel it must be said, chill it before frosting or icing anything. Best I've ever made but it had to be cold do be piped. And I added a tad bit of food color to mine."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tessa Kib"
},
"reviewBody": "This is, by far, the BEST cream cheese frosting I’ve ever eaten. Everyone absolutely loves it. It’s good on ANY cake but I pair it with Sam’s Famous Carrot Cake from this site the most. They’re both perfect compliments to each other. Make this exactly as it is, nothing else needed."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jim"
},
"reviewBody": "I made this last night and it was delicious! I had read some recipes that called for cold cream cheese beaten and then switching from a paddle blade to a whisk and adding the heavy cream. That just did not make sense to me and this recipe sounded more straight forward. I have a Kitchen-aid stand mixer. I whipped the heavy cream until nice stiff peaks appeared. Scooped that out and put into a bowl and into the frige. No need to wash the bowl in between. Then I changed to a paddle blade. I have one of those newer paddle blades with rubber scrapers. It worked just great. I put in the room temperature cream cheese, sugar, salt and vanilla. Once I had beat it for a while and everything was well mixed I took the whipped cream out of the frige and carefully folded it into the cream cheese mix. This was the perfect amount for a 9 x 13 cake pan. I made this as a topping for a dump cake of cherry pie filling and chocolate cake mix. It became my version of an imitation Black Forest Cherry Torte. It was very good last night at room temperature but absolutely devine this morning after sitting in the frige all night. Thanks for making this recipe available!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Regina Linsley"
},
"reviewBody": "Excellent recipe. I added some cinnamon and nutmeg to match the banana bars I put this on. I beat the cream cheese and sugar before folding in the whipped cream mixture. Devine!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Followed the recipe exactly as described. Turned out great albeit slightly slack in consistency, but some time in the fridge remedied that issue. Mine was a little grainy, but I believe it was due to using cane sugar. All in all it was an easy tasty recipe"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Elaine MacLaughlin"
},
"reviewBody": "it tastes great but you're unable to pipe this frosting. It is soft and runny. Had to refrigerate the cake as soon as it was iced."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This is not the first time that I made this frosting. It has been in my mind ever since I first made it a while ago. The only thing I added was lemon zest from a full lemon and it made what was a perfect frosting into an epicurian wonder. I'm the future I will not hesitate to use this recipe s as is or as a base for trying other flavors, i.e. orange zest, maple extract or syrup, etc."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This recipe is perfect just the way it is. I love how fluffy it is. It's lightly sweet and tangy, not overwhelming at all. This is also very easy and quick to make so I'm sure hubby will want it on every cake from now on. I used it to top Sam's Famous Carrot Cake. Perfect pairing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This was the perfect icing for the gluten free wedding cake. It was not very sweet but was tangy (like cream cheese always is). It does not set very firm and that is what made it great. I chilled it for 2 hours before using it and just poured it on the cake layers. It gave the perfect effect I was looking for. Added the fruit and the topper and voila! a perfect cake. Thank you for sharing your recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Best whipped cream cheese frosting I've ever tasted 😋 For the whipping cream I froze my utensils including bowl to mix it in. Absolutely awesome!! Thank you"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Marj"
},
"reviewBody": "It turned out good. I put it on an Orange Chiffon Cake and added some orange filling to the frosting. Everyone loved it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "mel7087"
},
"reviewBody": "Disappointing waste of ingredients. I followed exactly as written and tried again using extra sugar as suggested by a few people.my cream and instruments were chilled and yet I ended up with a sloppy mess that I couldn’t apply to a cake, let alone pipe. It tasted great but was useless as a frosting. Not even pudding consistency."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "nicole12345"
},
"reviewBody": "curdled and did not whip, absolutely terrible. tried to pipe for holiday cupcakes and didn't get there at all. stayed as a liquid."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "abonnieforclyde"
},
"reviewBody": "This is fantastic. Well balanced, traditional, and super yummy!! I made it to top a tres leches. Added a sprinkle of cinnamon and fresh raspberry compote on top!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Forgetful"
},
"reviewBody": "A good basic recipe for a filling or rustic topping on a sheet cake,but not something I would try to pipe. You'd need a stabilizer like gelatin for that,or maybe even combining this recipe with a commerical whipping cream that already has those properties. \n\nAnd on another note, I usually switch out 1 cup of white granulated sugar for ¾ cup of powdered sugar to make it easier to whisk.\n\nSometimes,I will sub half of the usual cream cheese for mascarpone and a tad more salt for a less sweet filling (absolutely amazing on homemade carrot or orange cake)."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Amanda P"
},
"reviewBody": "The flavour is nice and I'm sure it pipes well; however, this is not the icing you want to use for decorating. It's just too loose. I had it in the fridge for 2 days and it wouldn't set."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "mollyjewell1010"
},
"reviewBody": "This came out alright , not the best frosting I've ever made but it's a good starter recipe. I've made whipped cream / various whipped cream frostings and I've never had issues with it being this runny. I used this on a sheet cake so it was fine and it tasted good, but you wouldn't be able to ice a cake or top cupcakes with this recipe. I actually poked holes in my cake and let the frosting seep in , so the cake with the frosting still came out pretty good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Momoftwins"
},
"reviewBody": "this is the BEST cream cheese frosting I have ever made and tasted. \nThe 18 servings allowed me to frost both a cookie fruit pizza and a pan of brownies."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Misty Ahhaitty"
},
"reviewBody": "This frosting always comes out amazing! The perfect light and creamy whipped topping. It is definitely my family's favorite. We love it with angel food cake!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "JillieBean"
},
"reviewBody": "Do NOT make this for a cake. Followed the recipe the first time and when it turned out too soft and runny, I made it again, using powdered sugar instead. I tripled the amount of sugar, chilled the frosting and it was still too thin. It slid down the side of my cake and after being up all hours of the night, I had to call it quits, scrap my cake and order one from the grocery store the next day for my son’s birthday. I’m a trained cake decorator and this was the only birthday cake I’ve ever had to buy from a store. \nDon’t waste your time like I did!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Katielady86"
},
"reviewBody": "I added two teaspoons of lemon juice but otherwise followed recipe exactly and it was so light fluffy and an amazing compliment to my cheesecake"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sandra Crowell"
},
"reviewBody": "5/1/2021\n\nMade frosting for Dino Cake!! Green, yellow, black"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Deanna Schnepp"
},
"reviewBody": "Wow, this was fantastic! I made the recipe as is. I made the whipped cream with the kitchen aid mixer first in a bowl I chilled in the refrigerator for 25 min. I put the whipped cream in another bowl and stuck it in the fridge and made the rest, whipping until the sugar granules weren’t crunchy anymore. Then I folded it all together, refrigerated for 15 min, and used it on my 2 layer round carrot cake. It wouldn’t be great for piping but it tasted amazing and wasn’t runny!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Leesa"
},
"reviewBody": "This icing is the bomb! So airy and not too sweet. East to make and I piped it onto my Easter carrot cake, it was perfection. If it didn’t work for you, you did something wrong. Totally recommend."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rose Harris"
},
"reviewBody": "I made this in no time at all. I am definitely NOT a pro or even accomplished baker. However, I did follow a few recommended alterations. Froze bowl and beaters all day because I got side tracked. Also used 1 3/4 C. Of powdered sugar instead of white. It turned out A MA zing! I can’t wait for my family to eat the carrot cake for Easter that I made."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BakinBob"
},
"reviewBody": "Great frosting. I whipped cream using an electric hand blender with whisk attachment and blended room temp cream cheese with a hand held mixer. I chilled the whipped cream before folding in. It came out perfect. I did notice my cake was not completely cool and the frosting began to run. I let the cake cool completely and frosting spread and piped perfect. Thanks for sharing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cherie"
},
"reviewBody": "fantastic recipe! even better the next day"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "bakemorecake"
},
"reviewBody": "was VERY runny, more like a liquid than frosting. tasted very good though, I mixed it with another frosting that was too thick and made it just right. I suggest mixing it with chocolate frosting that is thick because the two mixed is very good. but again, very runny."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Melissa Graves"
},
"reviewBody": "I love this recipe! I've used it for quite a few cakes that I've made since I was 10, and I'm almost 25. I've also made this in a variety of flavors, such as orange pineapple and orange vanilla. I substitute the regular cream cheese for the whipped variety to get rid of the little lumps in the frosting. As for it being runny when decorating, as a southerner, I was taught to make the frosting first and place it in the fridge to set up while I was working on the cake itself and it stiffens right up. If I am baking in the late spring or summer, I take into account the humidity and use a little bit less whipping cream, but otherwise making the frosting first and placing in the fridge for an hour or two works just fine."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nelva"
},
"reviewBody": "It is the lightest fluffiest icing is made super good also it’s really good on a cake. Do you make a two layer cake you might have to make double the icing because I ran out of frosting at the end."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Angela"
},
"reviewBody": "Very simple!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ashley Roberts"
},
"reviewBody": "Love this!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Donna"
},
"reviewBody": "This icing is so good. I put it on this Pineapple upside down. I added a little pineapple juice to it. I give it a “10”!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Rylie DeRusha"
},
"reviewBody": "This recipe is very, very thin. It is DELICIOUS but I had to add extra cream cheese for it to be pipeable. Even then, it was pretty thin. I added another 8 oz. of cream cheese for it to taste, and hold it's shape better."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sarah"
},
"reviewBody": "This frosting was amazing! It was the perfect center for my pumpkin whoopie pies. I used 1 3/4 cups of confectioners sugar in place of the white sugar. It took a while to get the whipping cream thick, but it was totally worth it! This will be my go to cream cheese frosting recipe from now on!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Amanda Jean"
},
"reviewBody": "Absolutely delicious! I think the tips from the top comment will be helpful the next time I make this!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "HARLEYHON444"
},
"reviewBody": "Pretty good. I didn’t have whipping cream so just used some cool whip. I also used confectioners sugar instead of regular white sugar. Tastes great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "ska74"
},
"reviewBody": "It was a bit soft - didn't hold the candles well. But the flavor is good and everyone liked it:) Whipped the cream in the chilled bowl, then rinsed it with warm water and mixed the cream cheese with the whisk mixer attachment."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KAIRI"
},
"reviewBody": "This frosting was Amazing! Thank You for sharing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "ReneePaj"
},
"reviewBody": "For flavor and ease of prep, five stars! Fluffy and not overly sweet, which is nice and a nice change from frosting made with powdered sugar. Used it to frost a 13 x 9 inch pan of banana bars and it was perfect for this purpose. However, I ultimately gave it 4 stars because it does come out quite loose and I don't think it would stand up to frost a 2 layer cake or be piped."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "chewie"
},
"reviewBody": "This frosting is AMAZING!! Best cream cheese frosting ever! Some tips, put a metal or glass bowl and very clean beaters in the freezer for a bit before you beat the whipping cream. Once beating, it takes several minutes to firm up, be patient, it’ll get there! After beating the whipping cream, move on to the cream cheese step. Make sure your cream cheese has sat a room temp for at least a few hours, until soft to the touch. After adding the sugar and salt, make sure you beat it long enough until they are both dissolved and not gritty in the cream cheese. This is the most important step if you want to use this to decorate a cake, REFRIGERATE before using!! I have refrigerated this overnight and it worked beautifully to pipe on a cake. I have also used this immediately after making it and it was a sloppy mess so do yourself a favor and make it in advance! This is by far my favorite cream cheese frosting!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Ana Pratt"
},
"reviewBody": "It was a little salty."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Victoria"
},
"reviewBody": "This recipe was amazing and so delicious. I put them on top of red velvet cupcakes. I was concerned at first because the sugar crystals were not dissolving into the cream cheese. I ended up having to let the frosting sit overnight in the fridge because my cupcakes were too warm and by morning the frosting was smooth and sugar was completely dissolved. This recipe is a keeper!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sheila Spera"
},
"reviewBody": "Excellent taste! The trick to beating cream is to make sure beaters and bowl are free of grease. Wash your bowl and beaters in dish detergent AND vinegar. This will remove any greasy residue. If you do this, your cream will whip up perfectly every time. ( I learned this when I went to cake decorating school). Works every time! I do this when making royal icing too. Perfect icing every time!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cheryl Pivirotto"
},
"reviewBody": "My 15 year old son who is a novice made this frosting and it was perfectly delicious!!! No lumps. Not runny. He followed the directions to the T and it came out amazing. I did suggest leaving the cream cheese sit on the counter while he prepared the best ever chocolate cake recipe from this site."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Virginia"
},
"reviewBody": "I used it for a lemon cake so I used lemon juice instead of vanilla. My daughter said it looked so fluffy, a cloud cake. It was delicious. Better than the cake, I would have been happy with just the frosting!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LLCHOW"
},
"reviewBody": "This frosting tastes great, and I’ve made the process much easier. Since I only have one bowl for my mixer I just mix the cream cheese and granulated sugar, add the vanilla, then add some of the whipping cream. About 1/3 of a cup. When the cream cheese and whipping cream is combined I add the rest of the whipping cream and turn it on high until I get stiff peaks. The cream cheese must be at room temperature to prevent any lumps. No need to dirty extra bowls."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Canineequine "
},
"reviewBody": "Really rich and tasty! After I folded everything together, I gave it an extra whip with my mixer. This made it smooth and gave it more of a firm, traditional frosting consistency. This will be my new go-to frosting recipe. Thanks for sharing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mandy Kesler"
},
"reviewBody": "This was an amazing recipe! This will be my go to! I did heat up water in my bowl before I put my heavy cream, that trick made it so much easier for me!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dolores Evans Smith"
},
"reviewBody": "Loved this recipe but the first time I made it I thought it was too salty. The second time I omitted the salt and it was great! Best Frosting I've had in a long time!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Heather_in_VA"
},
"reviewBody": "This was fabulous! I used it to frost a two layer banana cake and was given numerous compliments. The only change I made was to beat the whipped cream and cream cheese together with the hand mixer after folding in the whipped cream. It made it a little sturdier. I’ll definitely be using this recipe again! Thank you for sharing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jsoneill"
},
"reviewBody": "My husband said it was the best frosting he has every had."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This is the yummiest recipe I have found (so far). The only changes was that l let the cream cheese warm a bit outside of the fridge before using. This eliminates the lumps. I also used 1 cup of heavy whipping cream instead of the 1 1/2. Great consistency and plenty of frosting to top my sheet cake."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rox"
},
"reviewBody": "I cut the sugar to 3/4 cup because I was filling the middle of my lemon cake with lemon curd and some of the frosting. The frosting was easy to work with. My family wants me to use this frosting on my carrot cake. It's much lighter then regular cream cheese frosting."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carolyn"
},
"reviewBody": "This is an amazing frosting!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Alex Castro"
},
"reviewBody": "To have been using this recipe for a while and make me seem like I know what I’m doing when I bake..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kristad83"
},
"reviewBody": "This was my first time making a frosting with heavy whipping cream. It turned out wonderful and delicious! At first, I couldnt get the mixture to thicken or stiffin up at all! Then I learned everything has to be very cold. So I stuck The mixing bowl, metal mixers and frosting in the freezer for 10-15 minutes several times throughout the whipping process to keep everything cold. That is the key to this receipe! Cold! It worked and I was able to beautifully pipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kenijwa"
},
"reviewBody": "Not too sweet not to Salty it’s Perfect"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Candice Smith"
},
"reviewBody": "I will defiantly make this again! Great icing. Not too sweet."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Abigail Favela"
},
"reviewBody": "So easy to make and it is delicious I added blue food coloring....My kids loved it"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Alice S"
},
"reviewBody": "I just made this frosting for the first time. It is so good and not too sweet. I used it on a home made cake. I haven't cut the cake yet, but I'm sure it will be wonderful! I have a dumb question though. Does my cake need to be refrigerated because of the frosting ingredients?"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "amym23"
},
"reviewBody": "This is so yummy! Absolutely perfect for over pumpkin bars. Thank you for sharing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "hearobin"
},
"reviewBody": "this is my favorite frosting recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jasmine Norton"
},
"reviewBody": "Amazing! I use this recipe for almost all of my cupcakes/cake. I also use the strawberry and chocolate cream cheese and it’s so delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Athena Black"
},
"reviewBody": "Use whole fat brick cream cheese, not the spread, and it should be stiffer. I actually use a small amount of brick cream cheese to stiffen my home made whipped cream and keep it from deflating. You may also want to use powdered sugar and make sure your cake has cooled completely before frosting."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Savannah Dennis"
},
"reviewBody": "really good, want to try with less sugar, more cream cheese"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Alaina"
},
"reviewBody": "All my friends said this was the best frosting they’ve ever tasted. I piped this easily just whip and heavy cream till it’s very stiff and then just put it in the fridge for awhile. It was the best!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rebecca Feldman"
},
"reviewBody": "I made it for my dads bday cake and he doesn’t like cannula so I just switched it out for almond extract and it turned out SOO amazing!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mary Sue McDade"
},
"reviewBody": "So delicious. Omg"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Emily Coprada"
},
"reviewBody": "How I wish I could send you a picture how pipeable your recipe is. I love it. Thank you so much. This is the best cream cheese frosting that I made."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "xnycman"
},
"reviewBody": "very smooth"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Grace "
},
"reviewBody": "We love this recipe it's so good we make it for our carrot cake e everytime."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Likestocook"
},
"reviewBody": "I replaced the vanilla with lemon juice and used this frosting to ice \"lemon cake from scratch\". I used dehydrated lemon slices to decorate it and the cake was to die for."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "joyce01247"
},
"reviewBody": "Excellent recipe, I used cool whip instead of heavy cream, worked out very well"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CK White"
},
"reviewBody": "I will DEFINITELY make this again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nancy Beeman Houston"
},
"reviewBody": "I absolutely love this recipe! Piping problems? No! I did use 1 1/2 cups of confectionery sugar instead of granulated. Chilled the bowl and beaters for the whipping cream. Cream cheese was almost room temperature (last minute Nancy here ??). I piped this on my cheesecake cupcakes. Sliced strawberries stood up fine, and the ones with 1/2 cookie on top stayed up as well. \nI had some extra, so I just mixed some sliced strawberries and blueberries with it. My snack for work tomorrow! Shhhh! LOL"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Katherine"
},
"reviewBody": "Oh wow. I loved this. It is so light, but keeps a great cream cheese flavor! I was running low on granulated sugar, so instead used 1.5 cups of powdered sugar after reading some of the reviews. It turned out delicious and was quite easy! I kept my whipped cream bowl cold, and warmed the cream cheese bowl. A perfect topping for my carrot cake! I had plenty to frost an 8x13 sheet pan, with a little left over."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "miss marti"
},
"reviewBody": "The only change I made. I lessened the amount of sugar. IIt was delicious. My cake was devoured. Then talked about for rest of the evening. Awesomeness. I will definitely make this again and again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Janice Nosovitch Nielsen"
},
"reviewBody": "I have 32 people in my office and I bake each person whatever they want for their birthday. I made this frosting to go on my French Vanilla White Chocolate cupcakes. Everyone loved it so much that one of the guys said he just wanted a gallon of this and a spoon for his birthday!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cbs"
},
"reviewBody": "This is the best cream cheese frosting ever!!! I put my mixing bowl and beater in the freezer for around 30 minutes and let the cream cheese soften on the counter during that time. I mixed the whipping cream first and then added the cream cheese mixture!!! I could eat this by spoonful it’s that good!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Megan shipley"
},
"reviewBody": "This recipe turned out perfect! I was hesitant on making it after reading the reviews because there were many that didn't get the \"whipped\" frosting they were hoping for. I am SO GLAD i chose to try it anyway. I did use a cold bowl and beaters. It definitely could have been piped. I would recommend it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Tazz"
},
"reviewBody": "Substitute white sugar for brown sugar"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "William Ciocco"
},
"reviewBody": "I made this to ice an orange layer cake.\nI added 1.5 oz orange juice and 1t Grand Marnier\nThe icing was plenty thick. I whipped the cream until it was very thick and heavy, not quite butter. I put it in another bowl and set it aside. Then, I mixed the remaining ingredients and folded the whipped cream in. \nYou definitely want to whip the cream first with clean utensils and get it thick. You might be able to get away with using less whipped cream, but then you will be a little sparse on the icing, especially if you cut your layers in half so you have four nine inch layers.\nI would have liked a lighter icing. I prefer a chantilly cream. This was a good icing though."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Megan Adams"
},
"reviewBody": "Easy, easy recipe which nets wonderful results. Can’t wait to make it again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Elaine"
},
"reviewBody": "Love it! Not too sweet-just right for my pineapple carrot cake!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kamosun"
},
"reviewBody": "I have made this recipe several times. Always pipes well (even on hot summer days) and the flavor is amazing. It tastes so good we have talked about just making it for a fruit dip."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tina"
},
"reviewBody": "Delicious! Very easy to make. Family licked the bowl clean."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Donna Kelly"
},
"reviewBody": "Excellent! Very nice texture... those saying it cannot be piped might not be whipping their whipping cream stiff enough. Love the lightly sweet flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Denise Demgen"
},
"reviewBody": "great recipe"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jazzy"
},
"reviewBody": "This is a great tasting whipped frosting. In Germany, where I grew up, whipped topping was what we always used in our home. I remember my grandmother putting her bowls and beaters in the freezer ahead of time..it takes a little while making solid whipped topping, but I wouldn't use anything else on my Black Forrest Cake. The addition of cream cheese is absolute genius!!The Cream Cheese should be at absolute room temperature! Powdered Sugar seems to make it stiffer, but you get great results with regular Sugar as well, I tried both.\n I am reviewing this recipe just by making it as posted and it was a huge hit and has become a favorite in my family. 10/18/2018...Once again, I made this frosting. It came out perfect, like it has done time and time before!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jessica Evans"
},
"reviewBody": "I used confectioners sugar rather than granulated and the icing tastes amazing. I am left missing the kind of crunchy shell regular icing gets, but I think that's all whipped icings."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shacura Wright"
},
"reviewBody": "It's delicious as is. I wouldn't change anything."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Donna Stanojevic Jaksic"
},
"reviewBody": "LOVE this frosting. If u can use real vanilla beans - it’s worth the splurge bc the flavor was AMAZING. If u can’t, using high quality PURE vanilla extract is a must (don’t use imitation vanilla). . I needed to double this recipe but chose NOT to double the cream cheese bc I didn’t want the cream cheese flavor since I was making chocolate cupcakes. Turned out EXCELLENT."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/19108/whipped-cream-cream-cheese-frosting/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/17100/desserts/frostings-and-icings/",
"name": "Frostings and Icings"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/2420/desserts/frostings-and-icings/cream-cheese/",
"name": "Cream Cheese"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/19108/whipped-cream-cream-cheese-frosting/",
"name": "Whipped Cream Cream Cheese Frosting"
}
}
]
}
}
, "about": [
]
}
]