				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "White Peach Sangria"
,"datePublished": "2020-06-18T23:05:06.000-04:00"
,"dateModified": "2022-08-23T05:41:58.000-04:00"
,"author": [
{"@type": "Person"
,"name": "FOODINC5"
,"url": "https://www.allrecipes.com/cook/172223"
}
]
,"description": "This white peach sangria recipe combines peach vodka, white wine, peach slices, and grapes to make a refreshingly fruity punch that&#39;s sure to please!"
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/G5DWpJH9fggvDsIMA5DXVqwtKHs=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/2458626-c48c05fbe9c14e2eb0d05846ac890ce8.jpg",
"height": 960,
"width": 960
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "White Peach Sangria"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.7",
"ratingCount": "503"
}
,"prepTime": "PT10M"
,"recipeIngredient": [
"1 (750 milliliter) bottle dry white wine",
"0.75 cup peach flavored vodka",
"6 tablespoons frozen lemonade concentrate, thawed",
"0.25 cup white sugar",
"1 pound white peaches, pitted and sliced",
"0.75 cup seedless red grapes, halved",
"0.75 cup seedless green grapes, halved" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Combine white wine, peach vodka, lemonade concentrate, and sugar in a large pitcher; stir until sugar is dissolved. Add sliced peaches, red grapes, and green grapes."
} ,{
"@type": "HowToStep"
,"text": "Refrigerate sangria until well chilled and flavors have blended, at least 2 hours to overnight."
} ,{
"@type": "HowToStep"
,"text": "Serve over ice, and use a slotted spoon to include sliced peaches and grapes with each serving."
} ]
,"recipeYield": ["6"]
,"totalTime": "PT130M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Yum! I had some peach moonshine to use and found this recipe! Just added the moonshine with the wine, (dry and cheapest) lemonade and sugar and it was delicious! We did add ginger ale as I know my family and I wouldn’t want everyone having to stay the night! Lol…."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Donna"
},
"reviewBody": "Love this recipe. All my friends love it too. Even took a big canister to serve at a tailgate. Big hit."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jeannie"
},
"reviewBody": "Delicious! I used dry riesling and peach schnapps instead of the vodka. I did not have limeade concentrate so I squeezed 1 fresh lime and added 1/4 cup of Gran Gala liqueur. Also used agave nectar instead of sugar. Too strong for me as-is so added 1/3 ginger ale to glass."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kathleen Elizabeth Elston"
},
"reviewBody": "I made a patch asked my partner if I should make more. Thank h my family doesn’t drink he says. Guess what his family was unhappy that I didn’t make enough! Everyone loved it! Only thing I used pink lemonade and peach schannes and just touch of sugar,frozen peaches,strawberries and fresh blueberries. Excellent!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LHOMMRICH"
},
"reviewBody": "Omg! I doubled the recipe, used pinot griigio and cut the sugar in half. I agree with others to cut it with sprite or something carbonated - I used Diet 7 Up. I mean, I've gotta work tomorrow!! I didn't think ahead enough to let it sit for more than two hours but it's still amazing!! Everyone I've made this for loves it!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CONESPRATT"
},
"reviewBody": "Add either ginger ale for sweetness or club soda to dilute a bit."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Annalisa"
},
"reviewBody": "This brings the house down every time I make it. Killer sangria recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Vadie Schultz"
},
"reviewBody": "I made this for book club. Followed the recipe and tried some. It was delicious. Perfect!!! However, I cut it with some Ginger ale or the ladies would likely have an accident driving home. Definitely buy frozen peaches. They were better than any fresh that I could buy, peel and slice. I used fresh raspberries. Next time I might try frozen. Also, ! think strawberries &amp;/ or kwis would be good, while adding color."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Melanie"
},
"reviewBody": "I’ve made this recipe many times for large parties and we never have any leftover! Everyone loves it! It scales up very easily. I usually leave out the grapes and use frozen peaches. I add half the night before to let them soak up the flavor and then serve the remaining frozen peaches as ice cubes for the sangria. I do melt the sugar and lemonade together to avoid the sugar falling out of suspension. I’ve also tried the recipe with both peach vodka and peach schnapps and they are both winners. I usually use a Pinot Grigio for the wine."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "H Wallace"
},
"reviewBody": "I skipped the grapes"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Devon Carruthers"
},
"reviewBody": "This is the best sangria ever. It is lethal as it goes down so easily and there is a lot of alcohol so I usually mix in club soda to make it not as deadly. I swapped out the grapes for frozen raspberries as I like them better and used frozen peaches. Everyone I've made this for raves about it. Thank you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "shanak"
},
"reviewBody": "Big hit for ladies night!\n\nI made a double batch 24 hours in advance.\n\nI must not have scooped enough fruit into each drink and had a half pitcher of fruit left behind.\n\nNo problem. Throw into a vitamix and add ice. Sangria smoothie for 4! Yum."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Elizabeth Pitts Craven"
},
"reviewBody": "Yum! I usually make a double batch and then add 7-Up or Ginger Ale just before serving. Perfecto!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Trish621"
},
"reviewBody": "Used a Rose instead. It was delicious. Next time I won't put the sugar in when using Rose."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Susan Stanley"
},
"reviewBody": "Way too strong alcohol taste, couldn't even tell it was Sangria. This only works if you add soda or some other kind of mixer to it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Leanne Mitchell Wright"
},
"reviewBody": "I didn't put any sugar in it. It was plenty sweet and yummy. My book club loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Darla"
},
"reviewBody": "I have made this recipe countless times. It is absolutely delicious, but if you let it sit for less than about 48 hours it is way too boozy. If you only are able to let it sit 12-24 hours, I would use about 1/3 cup of vodka instead of the full 3/4."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Janet Lee Hope"
},
"reviewBody": "easy to make, everyone enjoyed it! I also used frozen peaches and peach schnapps in place of vodka. I only used peaches, no other fruit"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Julie Knight"
},
"reviewBody": "Had a group of girlfriends over. They loved the flavor. It is a good idea to have ginger ale or 7Up available to cut the impact. I doubled the recipe and it was completely consumed!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Paula Hartel"
},
"reviewBody": "I've made this several times and I change it up a little each time. I garnish the glasses with fresh raspberries and mint leaves. It's awesome!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kim Ortiz"
},
"reviewBody": "ADD PEACH CITRUS FRESCA!! In my opinion this is a 1 star recipe as it is. But I made some small changes that made it a 5 star. I made a double batch and it was almost impossible to drink as it was...so I added about a 1.5 cans of Peach Citrus Fresca to cut down the tartness and the STRONG alcohol taste. Since I served it in a covered beverage dispenser with a spout. I added a bowl of sliced peaches marinating in the remainder of the peach vodka and as well as mint sprigs for garnish. It was a hit! I would definitely make this again with the added Fresca, drunken peaches and mint!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cassie Taylor"
},
"reviewBody": "I made this for the first time this summer, and now my friends and family are obsessed. I’m not a big peach person, but this sangria is amazing!\n\nAs other reviews have mentioned, it IS strong, so don’t be afraid to mix with some ginger ale. Also, because you are going to have to make a TON (this will go like ice water on a hot day!), I used peach schnapps instead of peach vodka because the schnapps bottle is cheaper."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Loni Wilson"
},
"reviewBody": "Everyone loved this Sangria. There was none left. I used Pinot Grigio for the wine. I tripled the recipe except for the sugar. \n\nI will definitely make this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jessica"
},
"reviewBody": "This recipe is always a hit! I’ve made it many times over the years, and always change it up a little. It always comes out great. I tend to use a dry Chardonnay. I’ll usually use raspberry vodka instead of peach. Sometimes I omit the sugar. I always serve it over ice with club soda and vary the fresh fruit."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Teri Niewoehner"
},
"reviewBody": "It was incredible! The peach flavor came through beautifully (used frozen peaches)."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "debbie h"
},
"reviewBody": "Very nice sangria - tasted even better when I had it the next day - gave it time for the flavors to meld. I did use peach vodka and it was good. Perfect for hot summer evening"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Suzy Myers"
},
"reviewBody": "This drink was pretty good. I used raspberries and frozen peach slices. It looked pretty in the glass. \nI thought the alcohol was way too strong, so I added a bottle of sparkling Pellegrino water. I also thought it could use a little more peach flavor, as it tasted ok, but kind of like a wine cooler.\nI might try it again using peach schnapps or brandy. \nThis drink needed something more.."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DCurtis"
},
"reviewBody": "At first it was a little strong then input the rest of the frozen lemonade in it came out perfect. 12 OZ lemonade concentrate total"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bianca"
},
"reviewBody": "This is pretty yummy. Be carful Lol!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sabrina T"
},
"reviewBody": "I've made this twice now and both times, the whole thing went quickly! It's a great recipe for parties on hot summer days. I do make some tweaks for personal taste. I doubled the recipe both times. The recipe as is comes out very strong. I usually add Ginger Ale or Club Soda (about half a liter) when doubling the recipe. I also add a little water (to taste-- balances out the sweetness). I've used Sauvignon Blanc and Chardonnay. Both come out very good. I also like to use frozen fruit-- it's a time saver! I like frozen peaches and frozen berries. I've also added apples. I let the recipe refrigerate overnight to let the frozen fruit thaw out and for the sangria to absorb all the fruit juices. Also, I highly suggest using peach vodka (I buy Svedka or Absolut but Taaka makes one too). We made it once with peach schnapps as people have suggested and it totally changed the recipe. I learned quickly I'm not a schnapps fan. I think it came out sweeter, and personally, I don't care for it if it's too sweet."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shelly Lyvers"
},
"reviewBody": "Husband loved it. I made it for him since he loves peach sangria. I love peaches but hate peach flavored things. I used fresh peaches so I could eat them and strawberries. I stuck with peach vodka but the husband wants me to try it with peach schnapps. I definitely will be making this again for him."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Franci"
},
"reviewBody": "Used peach schnapps, no sugar because I diluted with ginger ale. Try adding a splash of brandy for richer flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Barb"
},
"reviewBody": "Very tasty!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "curly"
},
"reviewBody": "The drink was great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Nita Pessarra Waterman"
},
"reviewBody": "I made it according to the directions but had the bright idea to add pineapple. It was way too sweet. Everybody seemed to like it though."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Sharita Leonard"
},
"reviewBody": "I doubled the recipe to make a pitcher. To enhance the peach flavor, I added one can of Jumex Peach Nector, a tablespoon of homemade simple syrup, and a 7.5 oz can of Sprite. It was a hit at the cookout and tasted even better the second day."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Roxyzcakez"
},
"reviewBody": "This is a neighborhood favorite; I've made it at least \na dozen times. However, today I made one boo-boo followed by one necessary change. It turned out amazingly well so thought I would share. I thought I had peach vodka. Wrong. Stores closed. So I used Peach Schnapps, same amount as the vodka. Since Schnapps is sweeter than vodka, I eliminated all sugar. Then the store was out of frozen lemonade concentrate so I went with the only other option - frozen raspberry lemonade concentrate. Perfection nonetheless!! I do plan to use peach vodka from now on and adding back the sugar (I cut the sugar in half per our local preferences ) in order to remain true to the recipe. But the raspberry lemonade was amazing in that it gave a peach hue to the sangria which vodka (or Schnapps for that matter) and regular lemonade does not. I couldn't detect any raspberry flavor; I just detected delicious peach sangria!! I will definitely use frozen raspberry lemonade concentrate from now on. Enjoy this recipe; my neighbors and I sure do!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kay"
},
"reviewBody": "Made this for a bridal party and everyone loved it. Used peach schnapps instead of vodka and added some 7up. It was a bit sweet for me but most really enjoyed it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JessD1115"
},
"reviewBody": "This is my goto beverage for summer gatherings. I change it up based on what I had on hand when I first made it and it was FABULOUS! It's a crowd pleaser for sure. I use pear vodka instead of peach schnapps and the cheapest dry white wine I can find. I cut back on the lime concentrate and use 1/2 the sugar and in addition to frozen peach slices I used blueberries and sliced strawberries instead of grapes. In a pinch, I've used frozen raspberries in place of blueberries and it turned the sangria into a gorgeous pink color. You won't be disappointed!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Joy1964"
},
"reviewBody": "Be warned! This stuff is lethal. My guests love it. The last time I served this (at a July 4th party I hosted), I ended up in bed at 10 PM while my guests continued to party into the night. I heard it was a great party. Get plenty of rest and take lots of vitamins before you serve this."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ajax30062"
},
"reviewBody": "This turned out excellent. I used frozen peaches and diced some pears. Right proportion as it was not overly sweet."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "walling3"
},
"reviewBody": "I just made this last night for a family gathering and instead of adding the sugar I added the whole can of the frozen lemonade. I also only added 1/2 cup of the vodka as this recipe is super strong."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Deb"
},
"reviewBody": "I made this and loved it!! Nice and refreshing for a summer cocktail instead of the usual red sangria. I doubled the recipe and used white nectarines instead of peaches. Next time I make it I am going to cut the amount of sugar down. I liked the suggestions of peach schnapps instead of peach vodka."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "maryruhmann"
},
"reviewBody": "Made a double batch for a party.. Everyone thoroughly enjoyed it... The vodka flavor was a little overwhelming, so added a can of sprite zero and lots of ice... you can cut back on the amount of peaches.. that too was overkill."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Made a double batch for a party.. Everyone thoroughly enjoyed it... The vodka flavor was a little overwhelming, so added a can of sprite zero and lots of ice... you can cut back on the amount of peaches.. that too was overkill."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "RickyBobby"
},
"reviewBody": "Wow! This is strong! That's probably why my guests loved it so much :-) Took everyone's advise &amp; went with frozen peaches. I also didn't have any peach vodka so I used peach schnapps. I let it \"marinate\" overnight. This won rave reviews at my BBQ. It's also pretty sweet, so if you don't like your booze on the dry side, this one isn't for you."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Christique07"
},
"reviewBody": "I made this recipe for a large birthday party. Tripled the recipe using 3 bottles of Pinot Grigio wine, one 1/2 pint peach schnapps, a whole can of frozen lemonade, and a 1/2 cup of sugar. For the fruit I used frozen peaches and red and green grapes cut in half as I didn't want the fruit to get mushy. I made it early in the day for that evening and wondered why I made so much. It was a huge hit. One small glass left for me to enjoy as I enjoyed the success of a great party... Had several requests for the recipe. Very fresh tasting, not too sweet. Fruit was great \nWill definitely make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kfoster"
},
"reviewBody": "This has been my go-to white sangria for a couple of years. As per other reviews, I use peach schnapps and a bag of frozen peaches. I sometimes add grapes, but I change the added fruit depending on what's available locally. You definitely have to cut it with sparkling water or whatever carbonated beverage you prefer."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "heatherfardy"
},
"reviewBody": "So good! Made this for myself and brought it to a party, everyone wanted to try it! Huge hit!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "BAKERBAKER"
},
"reviewBody": "This is a perfect light summertime drink! I did make a couple changes. \nI used 3/4 cups of peach schnapps instead of the vodka. (Mainly because I didn't want to buy a whole bottle of peach vodka that I probably wouldn't use except for the small amount for this recipe.) I also omitted the sugar since the schnapps had the perfect sweetness to it. I add whatever frozen/fresh fruit I have on hand when making this (strawberries, grapes, frozen peaches, etc). This is awesome! Rated it 4 since I made some alterations."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Robinwalsh1020"
},
"reviewBody": "I add some more types of fruit. Oranges, cherries, etc. All my friends love this"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Leticia E. Cortes"
},
"reviewBody": "Dangerously wonderful"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "atwee"
},
"reviewBody": "I have made this too many times to count. It's the best recipe for white sangria and it always gets rave reviews. White peaches are best for this as they are firmer and don't get as mushy as regular peaches."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mz_anderson"
},
"reviewBody": "Made it in bulk and used frozen peaches and raspberries instead. It can hit ya pretty fast so gave the option to add 7up as a mixer. Everybody LOVED it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jennifer Hartman"
},
"reviewBody": "This is one of my favorite Sangria recipes. I make it for parties all the time and I constantly get asked for the recipe. It's fantastic!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Teri Scott"
},
"reviewBody": "I used 1 bottle of rose moscata (barefoot beach), 2 C. pineapple juice, 1/2 C. peach schnapps, 1 glass of lemonade, 1 liter of gingerale, 1/2 mango, 1/2 can pineapple, 1/2 small watermelon, 2 kiwi, 1 nectarine, (all the previous fruit was the remainder of a fruit salad) plus 1 lemon, 1 lime and 2 clementines sliced. Delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Emily Nottingham"
},
"reviewBody": "I added peach brandy to punch up the peach flavor. Delicious and a big hit at our BBQ."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "patreeseeya"
},
"reviewBody": "I've tried a lot of sangria recipes in the last year. I love sangria! It's not easy to get just right. This is a great recipe! It was a little sweet, but that is not the fault of the recipe. Wines vary greatly in their dryness so the sugar is something you have to play around with. I used Franzia White Zin (box) which is sweet and omitted the sugar. I subbed peach schnapps for the vodka and only used 1/2 c. Threw in a bag of peaches and let it sit overnight. This stuff is awesome! I just poured some into a big wine glass filled with ice and added a splash of club soda. It's amazing!!! Very pretty too with the peaches floating around. I'm putting this into my recipe files under entertainment. Perfect for any kind of shower and I'll add raspberries!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Valerie Metcalf"
},
"reviewBody": "Party is gonna happen.\nWell the Sangria will give it a nice start anyway.\nI did modify this recipe slightly because I had plenty of vodka in the house but not an ounce of peach vodka. So I switched it up a tiny bit. One part Peach schnapps AND 2 parts regular vodka. I think that was the perfect fix and now I have peach schnapps in the house for other cocktails and creations.\nI think you could do without the sugar entirely too.\nI suggest you ditch the grapes and use peaches, nectarines, mango, and maybe strawberries and blueberries to brighten up this delicious beverage. I also added thinly sliced lemon, lime, and orange.\nWould suggest a little extra fruit on the side so you don't need a spoon to scoop out some fruit for each beverage.\nEasy to make. \nDoesn't not require the suggested time for the flavors to meld.\nLast thing I want to suggest, if you or your guest think this is too toxic (heavy on the alcohol), give it a splash or two of sparkling or soda water. You still have a refreshing cocktail but with a bit less guilt.\nI'm not a big peach cocktail fan but this is high on my list for a White Sangria."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Suzanne"
},
"reviewBody": "I modified this recipe by halving the vodka and using peach schnapps as the other half instead of sugar. I omitted the frozen lemonade and used martelli's sparkling lemonade instead and used frozen peaches. It was the hit of the party."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cookie Puss"
},
"reviewBody": "Flippin awesome!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CA Cook"
},
"reviewBody": "Very good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "tamtam024"
},
"reviewBody": "Love this! I made the recipe as it is the first time and it was great but I added frozen peaches instead of fresh. The next time I added mixed berries as well. Makes it look really pretty and gives it some nice color! Instead of plain vodka, I use either peach schnapps or peach vodka. It seems to be a bit sweet with the recipe as it is, so I like to add sparkling water to it to taste :) this drink will hit you so good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lgm"
},
"reviewBody": "Delicious, refreshing and very easy to make. I made this for a party and everyone loved it, I had to make several batches of it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "dhi"
},
"reviewBody": "So easy and dangerously delicious! I added peach schnapps and replaced the sugar with a splash of ginger ale. Yum!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "georgiapeach"
},
"reviewBody": "I've made this several times experimenting based on what other reviewers have said. I think the last time I made it was the best. I use any sort of white wine, 1/2 cup peach vodka, 1/4 cup peach schnapps, 1/4 cup brandy. I also omit the sugar as the alcohol has so much sugar you don't need any more. For fruit I use 1 peach and half an apple. I'll also throw in grapes or raspberries if I have any on hand. We add a few splashes of ginger ale or Sprite to each glass when serving. Delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jennifer"
},
"reviewBody": "I made this sangria for a party and everyone LOVED it! I used Anakena Viognier Tama Vineyards Selection for wine and Absolute Apeach vodka. I also used half the recommended sugar. To help keep it chilled throughout the party I froze some extra whole grapes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jess1129"
},
"reviewBody": "This is by far the best white sangria in existence. I've tweaked it to perfection... Use Absolut Pear vodka instead of peach, use 5 tbs of froz lemonade concentrate and cut back on the sugar. I use a 1 lb bag of frozen sliced peaches, and omit the grapes and use fresh blueberries and sliced strawberries instead. You could use frozen blueberries or raspberries/blackberries too. If you do, it'll make the sangria more pink. Also, any cheap pinot grigio or sauvignon blanc will do. Every time I make it, I get RAVE reviews. Make sure to double or triple your batch because everyone will want it and it'll go quickly."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DiannaCaters"
},
"reviewBody": "Excellent Recipe - Great for parties and for the beach! I modified the recipe to use half vodka and half peach schnaps. If fresh white peaches are not available, you can also substitute with frozen or canned peaches."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shelano"
},
"reviewBody": "Fantastic sangria! I only had green grapes so mine didn't take on the pink hue pictured with the recipe. These are strong and delish!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CourtMroch"
},
"reviewBody": "I made this and the \"Sangria! Sangria'l recipe for a party. This was the first to go. I used tips from other commenters (MDH12 &amp; RG1) and used peach schnapps instead of vodka and added raspberries. I did use fresh peaches and nectaries. My husband kept eating all the fruit. There was little left for our guests. Was really refreshing and peachy and perfect for our Summer Solstice Celebration!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mickdee"
},
"reviewBody": "Loved, loved loved this! Had a party and served both this and Sangria a la Las Vegas. If you are looking for inexpensive serving containers for sangria, Anchor Hocking has 3 sizes of glass jars from about 2 quarts to 2.5 gallons. I bought (2) 2.5 gallon containers. It's nice because it allows to ladle out some fruit in each cup as apposed to spigot beverage servers. It also allows you to store the whole jar in the fridge overnight and you don't have to fuss when you want to serve. I found white organic peaches at Whole Foods and let them ripen a couple days; they were perfect and so pretty. The green and red grapes added a nice touch. I loved the fact this has a peach vodka rather than a sweet liquor and I didn't even add any of the sugar. I did, however, add some lemon lime sparkling water to dilute it a bit. In the ice bucket, I added cubes I froze with lemons &amp; lime wedges in mini muffin cups. Party City has long appetizer forks that were nice to put in the glasses as a stirrer so people can munch on the fruit. I have also made these in small batches to have on hand for tumblers on the boat. It's a great, refreshing summer cocktail everyone seems to enjoy! Thank you for sharing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JoannZ"
},
"reviewBody": "Loved it! Used peach schnapps and less liquor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Edie Brice"
},
"reviewBody": "I just made this sangria for my sisters baby shower. I used a 5 liter box of Pinot Grigio and adjusted the other quantities accordingly. I replaced peach vodka for peach schnapps like many other reviewers did. Since the schnapps is much sweeter, I halved the amount of white sugar. I must say.... The women RAVED about the sangria. Many people told me it was the hands down BEST sangria they ever had. I'm pregnant myself and very sad I didn't even try it out but my husband was my tester and said it was awesome as well. Oh, I added about 4 liters 7-up and one liter seltzer right before serving it. Next time I won't put grapes in it as they sank to the bottom and got stuck near the spout. But I'm very impressed with this recipe. Next time I will have to use about two or three boxes of wine since it went super quick."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Ravdy3"
},
"reviewBody": "I have made this recipe, and a number of variations, numerous times. As written I only give it 3 stars. The lemonade doesn't seem to fit; gives it an off taste. I substitute other fruit juice concentrates, usually apple because it's sweet but fairly neutral. I use more of the concentrate and then just omit the extra sugar. I usually leave out the grapes, simply because it's too much work, and use frozen peaches. Also, I have no idea why other reviewers are substituting the peach vodka with peach schnapps!?! You can ADD the schnapps for some extra peach flavor but put real alcohol, not just that syrup!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "kajohnson08"
},
"reviewBody": "Tasted deceptively delicious! If you and your girlfriends wanna get drunk, this is the sangria for you. Kicked my butt!! Won't be making again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carly Ka-t"
},
"reviewBody": "Absolute hit at my birthday party! I cut it with Vernor's ginger ale to keep people from hitting the floor because without it, the sangria is VERY strong. I used New Amsterdam peach flavored vodka. Delicious and easy to make, especially if using frozen fruit."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BlissfulBargains"
},
"reviewBody": "This is absolutely amazing! I used regular vodka (had it on hand) and Pinot Grigio (which ever brand is on sale). I let it sit in the fridge over night and I must admit...it is intoxicating! The fruit becomes infused with the alcohol and its very tasty. I took the advice of another review and I cut it with ginger ale for a 1:1 ratio. I mixed it with the ginger ale as I was serving it so it does not go flat and Viola! PERFECT! Very refreshing and tasty. I will whipping up a few batches for the weekends we are out on the boat entertaining friends and family. This recipe is a winner!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "KatieW9908"
},
"reviewBody": "This wasn't bad, but I will keep looking for a \"go-to\" white sangria. I admit I followed some of the modifications that other reviewers recommended, and I'm not so sure they were all for the positive. I think peach schnapps may have actually been a bad move, it left a very fake-y peach aftertaste. I also put a berry mix in, which I think muddied the flavors a little too much. This recipe might be best as originally written without modification!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "MOMMY2TRIS"
},
"reviewBody": "Very good! Added orange slices and used less grapes. Cut the sugar in half and added a little ginger ale right before serving."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "pymama"
},
"reviewBody": "The best sangria hands down! My only recommendation is use peach schnapps instead of vodka. It gives the sangria a sweeter taste. People keep telling me it \"taste like kool-aid\"! I didn't cut it but it will sneak up on you. Peaches aren't always in season so sometimes I have to use frozen. They fruit always taste better fresh. However if you use frozen make sure they are thoroughly thawed (run under room temperature to thaw quickly). Make sure you let it soak for at least 2 hours longer if the peaches weren't fresh."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kar"
},
"reviewBody": "Made this for a barbeque and everyone loved it. Lighter than a traditional sangria and maybe a tad sweeter but that's how we like our drinks. Watch it though, it goes down very easy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cjlevinsk22"
},
"reviewBody": "This is a delicious, albeit somewhat “deadly” sangria. Super sweet, with a sneaker bite! Always a huge hit at parties, and the first to go! I always use a dry chardonnay (cheap is fine….don’t splurge), and something inexpensive like a Burtnett’s vodka. I’ve tried with more expensive Absolut, but you just cannot tell the difference give the price difference. I’ve made this both with sugar and have also substituted Splenda to clip some calories. I never do the grapes, as they tend to sink and don’t add much flavor. Be sure to let sit overnight to allow the recipe to set. You won’t be disappointed!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tashvyn"
},
"reviewBody": "I love this recipe, I've made it for to GIRLS NIGHTS and it was a HUGE hit!!! The second time I used white nectarines and they worked just as well as the white peaches. Will definitely keep this recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MarinasMommy"
},
"reviewBody": "I have made this and shared this for two parties and it goes soooooo fast! Used Peach Schnapps instead of vodka. Frozen peaches instead of fresh and omitted the sugar. Chill for as long as possible to marry the flavors. And make sure you cut it with sparkling water or sprite. SOOOOOOOO GOOOOOOD!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Peachy keen"
},
"reviewBody": "Made for a dinner party. I worried that it might taste too sweet, but it didn't. Everyone raved about it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dawnie"
},
"reviewBody": "Used two 750ml bottle of Sauvignon Blanc, 1c peach schnapps, 1/2c peach vodka, 6 shots of lemoncello, 1 LB of white peaches and some halved red grapes. I am letting this sit overnight for a party on Friday, Will be adding some 7 up or Ginger ale and cut up strawberries to this right before I serve it. As it sits now without the Ginger ale, it is Way Strong! It definately needs to be cut w/ soda of your liking. It also really needs either the frozen lemonade concentrate or Lemoncello. I would not omit this. I dd however omit the sugar. IMHO it doesn't need it. Great recipe!! Cheers!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nicole"
},
"reviewBody": "I took the advice of other reviewers and cut the drink with soda water. This is a strong drink even with soda water added! I did not use grapes. I used fresh peaches, plums, and blueberries. I let the Sangria sit for 5 hours in the fridge before serving. Another reviewer noted the Sangria does not taste good when first mixed and I also found this to be true so do not judge the taste until all the ingredients have time blend. I will try this recipe again with frozen peaches."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Beth"
},
"reviewBody": "Loved this recipe very refreshing! I skipped the sugar and grapes. I added Sierra mist, Blueberries and strawberries. Highly recommended!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "suzanne"
},
"reviewBody": "perfect summer drink! everyone loved it"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "sueburk"
},
"reviewBody": "Really it's a 5 Star with the help of everyone's comments: Peach Schnapps in place of vodka, no grapes, peaches, nectarines and raspberries best, warm frozen lemonade in microwave and dissolve sugar in that before adding to pitcher, when serving, 1/2 sangria 1/2 sparkling water makes both the Sangria and your guests last longer ;)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "hawk"
},
"reviewBody": "Great adjust vodka up or down depending on your tolerance. Fruit is great this season and I chose absolute and barefoot and this combination is absolutely fantastic!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Samantha"
},
"reviewBody": "Great for a day at the beach. subbed in Peach Schnapps for vodka and added club soda to taste. Perfect!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Maureen"
},
"reviewBody": "Made traditional red sangria and this peach sangria for a graduation party last summer. This PEACH SANGRIA was such a HIT! \nEveryone was raving about it. Easy to make...used peach schnapps rather than Vodka and did cut it with a small amount of Ginger Ale and Club Soda so it wasn't too strong or too sweet. And served over ice. I had multiplied the recipe 6x to make enough for 40 and we ran out quickly. Am only making peach sangria for a pre-wedding party this weekend."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Karen Davidson"
},
"reviewBody": "Refreshing. Made for a BBQ and it was a huge hit! Had to make another batch :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "TheDowg"
},
"reviewBody": "Loved it! Huge hit last summer and again this summer. My friend Sue is such a lush! I'm giving her this recipe, but she'll probably have to double it! Bacardi Lemon is way better than the schnapps. Sue always finishes the bottle--no waste either!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ultra2025"
},
"reviewBody": "This was a hit at a birthday party we through. It's very potent so definitely make sure to have 7up or Sprint to tone it down. We ended up using frozen peaches and peach vodka."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cathy Allen"
},
"reviewBody": "My friends always ask me to make this during the summer. I do cut back on the amount of grapes and I cut them smaller to make it easier to drink."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jjinsmyrna"
},
"reviewBody": "Look no further. I have perfected this amazing sangria. All my friends are obsessed and I am requested to bring it often. 1 bottle of wine isn’t enough. Use 2 bottles Pinot Grigio. My favorite is Santa Margherita. 1 cup Mr. Stacks peach schnapps. 1 can (12oz) frozen Minute Maid lemonade. Omit sugar. Stir in frozen peach slices. Let sit overnight in the refrigerator. Serve the next day over frozen blueberries and frozen strawberries."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/23734/white-peach-sangria/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/231/world-cuisine/european/",
"name": "European"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/726/world-cuisine/european/spanish/",
"name": "Spanish"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/23734/white-peach-sangria/",
"name": "White Peach Sangria"
}
}
]
}
}
, "about": [
]
}
]