				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "White Brownies"
,"datePublished": "2020-03-04T23:56:44.000-05:00"
,"dateModified": "2023-01-18T11:42:53.000-05:00"
,"author": [
{"@type": "Person"
,"name": "Colleen"
,"url": "https://www.allrecipes.com/cook/24322318"
}
]
,"description": "Brownies made with yellow cake mix. Brown sugar and butterscotch chips make these irresistible!"
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/sxECHudQuqwdWJdORKwb6S6nXpY=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/863847-cfbcce5e331f4c429c759a8884afd618.jpg",
"height": 960,
"width": 960
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "White Brownies"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "3.9",
"ratingCount": "83"
}
,"cookTime": "PT25M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "96 kcal"
,"carbohydrateContent": "16 g"
,"cholesterolContent": "5 mg"
,"fiberContent": "0 g"
,"proteinContent": "1 g"
,"saturatedFatContent": "2 g"
,"sodiumContent": "103 mg"
,"sugarContent": "12 g"
,"fatContent": "3 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT5M"
,"recipeIngredient": [
"1 (18.25 ounce) package white cake mix",
"0.33300000429153 cup brown sugar",
"1 egg",
"0.33300000429153 cup milk",
"1 cup butterscotch chips" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Preheat the oven to 325 degrees F (165 degrees C). Grease a 9x13-inch baking pan."
} ,{
"@type": "HowToStep"
,"text": "In a large bowl, stir together cake mix and brown sugar. Add egg and milk; mix until well blended. Stir in butterscotch chips. Spread dough evenly into the prepared pan."
} ,{
"@type": "HowToStep"
,"text": "Bake for 25 to 30 minutes in the preheated oven, until brownies pull away from the edge of the pan slightly. Cool in the pan on a wire rack, then cut into bars."
} ]
,"recipeYield": ["36"]
,"totalTime": "PT30M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mgresist"
},
"reviewBody": "My daughter is allergic to the cocoa in chocolate so I'm always looking for a recipe she can eat. We made this as written except that we put in Hershey's birthday cake kisses instead of the chips. The flavor was over-the-top fantastic. We made ours with a cake mix from Aldi which is smaller (14 ounces) and even with that, the batter was pretty dry and sticky. It also looked like too little batter to put in a 9x13 pan so we baked it in an 8\" square pan. They came out with the perfect thickness and consistency. I will definitely make this again, maybe trying it with butterscotch or white chocolate chips next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Rajjae Lawrence"
},
"reviewBody": "Making this recipe as is didn't workout for me. it was super dry so I ended up adding more milk. even doing that, once it was done the taste was awesome but the texture wasn't there for me. it didn't have a cake or brownie texture, just kinda gooey all around. it's a good base recipe but needs a little work"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Fading Dandelion"
},
"reviewBody": "Loved this simple recipe baked in an 8x8 and pie shell. Next time I will find a Carmel sauce recipe and bake all the mix in pie shells . Perfect texture. Loved them"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "LisaMR12"
},
"reviewBody": "These were very sweet, but yummy . I had toffee bits, so I used those in replace of chips. I bet the chips are delicious too. I followed some other reviewers by increasing the milk to 1/2 cup and adding an extra egg. Next time, I may add a bit of vanilla."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Angela Cochran"
},
"reviewBody": "Quick delicious dessert! I will definitely be making again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "joe b"
},
"reviewBody": "So I added the second egg and did the 1/2 cup of milk instead of the 1/3. It fluffed up a little more than I like but tastes well."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Planetsuz"
},
"reviewBody": "Okay recipe. Batter was too thick. Bland and overly sweet. I probably wont make them again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Kelly Lynn"
},
"reviewBody": "Mine turned out horrendous! I am not a good baker regardless, so I don't know why I expected a masterpiece this time around :s Anyways, mine did not cook throughout at all ... I ended up testing a cooked corner but there was no hope. I supposed I could have tried throwing it back in the oven for a lot longer, but probably better for my thighs in the trash can."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "maggie"
},
"reviewBody": "After reading reviews, I used a half cup of milk and added a pinch of kosher salt and capful of vanilla extract, but followed recipe here otherwise. After baking in convection oven at 325F for 15 minutes, I upped the temp to 350F for the remaining 15- 20 minutes. (I used a butter cake mix and an entire regular size bag of semi-sweet morsels). \nTuned out great and our house smells amazing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Clvlanddr"
},
"reviewBody": "Hit the spot. I had almost expiring white cake mix, along with all the other ingredients, so I thought I'd give it a try. Like other reviewes, I added a little milk (1/4 cup) and used white chocolate chips. Very good. I'll definitely make them again"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jessFu"
},
"reviewBody": "I took them to work and everyone seemed like them. I followed the reviews and used extra milk. They turned out very delicious and moist."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "zodia81"
},
"reviewBody": "I made this recipe only changing butterscotch chips to white chocolate chips (only because that's what I had on hand) and they are soooo delicious. Great, easy recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rose"
},
"reviewBody": "Decided try this recipe out, and it was a big hit with the family. From reading most of the reviews I decided to also increase the milk to 1/2 cup and the egg to 2. I also went with chcolate cake mix instead of white."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "grandma nummy's daughter"
},
"reviewBody": "I loved these! And I don't like blondies. These were quite sweet, and I liked that! After reading all the reviews I decided to up the liquid. The chocolate brownies I make use oil so I used the 1/3 cup milk and then added about 1/4 cup oil. I must have gotten lucky when spreading these out, I used a plastic spatula and maybe the oil helped, but I just got on a roll and was able to push and smoosh the batter down and filled a 9x13 pan perfectly. I baked about 10 min. longer. I also put tinfoil down in a glass baking dish cause I wanted to be able to pull the whole thing out so I could cut nice squares for a potluck, this worked, but the ends where I didn't have tinfoil it got a little darker and crisper, which I liked. I'll be making these again for home, but without the tinfoil. Oh and I really liked the white cake mix for these!\r\nThanks so much for the recipe!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "MomInPort"
},
"reviewBody": "Has potential, but tooth-aching overly sugary. It would be better as say a lemon cake mix with caramel pieces or berries or even switching the butterscotch chips with a semi-sweet chip to balance out the sweet (but then they wouldn't be white brownies, I suppose). Definately not in my keep file."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "MrsFisher0729"
},
"reviewBody": "Smelled great while baking! It did puff up quite a bit. I used a shallow 9x13 brownie pan, and it rose to the very edge of the pan. Used white chocolate chips instead of butterscotch so they were truly white brownies. The center pieces definitely taste better than the edges. May be a good idea to add more than one cup of chips. I also used 1/2 c. milk and 2 eggs.\n\nUpdate: Didn't go over very well at Super Bowl party I took them too. Maybe too many other dessert choices."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SMClanton"
},
"reviewBody": "my kids love these! i use funfetti cake mix and white chocolate chips. i also don't use brown sugar."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KimberlyJ"
},
"reviewBody": "Super delicious!! I made it pretty close to as written, but substituted white chocolate chips instead of butterscotch since that was all I had. It was a great choice. Tasted pretty brownie-like to me, and didnt need any extra bake time like other reviews suggest. Maybe the issue was different ovens.. Either way, I will definitely be making these again. YUM"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Kristens"
},
"reviewBody": "Nothing special. They lasted over a week. I will stick with regular brownies."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Michelle C"
},
"reviewBody": "These were just ok. Though I like dense bars, I wish these would have risen a little more. Maybe another egg? Even though I'm not one to like baked goods that are super sweet, these could have been a little sweeter, &amp; I even added a couple pinches of brown sugar more than called for. Just the right amount of chips &amp; a nice texture before baking, easy enough to spread. Think I'll try a blondie recipe next time for taste &amp; a \"higher\" bar though."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Regina Excell"
},
"reviewBody": "Upped the milk to 1/2 c. This is an excellent, versatile recipe! The better has to be thick to keep the chips from all sinking to the bottom during baking."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "kr1065"
},
"reviewBody": "I added 2 eggs, opted for 1/2c milk, added 1c toffee pieces and a splash of vanilla...Yum-o!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "KY"
},
"reviewBody": "This dessert was good tasting, and my boyfriend really liked it. I Think that it should not be under the caterigory of a brownie because it was still more cake like. The texture is more a little more chewy and condensed then it would have been if i made the cake, BUT not chewy enough to be considered a brownie in my book. I also added the milk require plus the same amount of water, and 2 tsp of oil extra."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SweetToothTiff"
},
"reviewBody": "This recipe was quick and easy. These were tasty brownies. My kids loved them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Joanne Paulus Maier"
},
"reviewBody": "It doesn't get any easier than this! These are wonderful and chewy. I agree with adding more milk, too. I used carrot cake mix for my first try. Very tasty! For Valentine's Day, red velvet cake mix and mini morsels. The combinations and possibilites are endless!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Cheryl -Long Island NY"
},
"reviewBody": "NO- I wouldnt make them again. I used yellow cake mix &amp; white chocolate chips. I wanted to use Maccadaian nuts too but couldnt find them. It was tough to mix, tough to spread &amp; I find it tough to eat also! Sorry!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Caroline"
},
"reviewBody": "These were very easy to make and turned out great! I used 2/3 cup and 1 teaspoon of milk, and the batter was very sticky, but not too difficult to smooth into the pan. It did take much, much longer to bake than the recipe stated, though. I had them in for 50 minutes and the toothpick was still coming out sticky, so I bumped it up to 350 for the last five minutes. Once cool, they taste fantastic!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "lisa"
},
"reviewBody": "very easy. I did add 2 extra Tablespoons of milk. Very chewy. My whole family loved them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "cookntaste"
},
"reviewBody": "YUMMY! These were the simplest thing to make and taste so good! I used 1/2 cup of milk, according to previous reviewer's advice. I don't think these are meant to be fluffy - they're more of a gooey bar with a crunchy edge. Thanks so much for this recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Heidi"
},
"reviewBody": "really easy, my husband loved them!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Ashley DeHoff"
},
"reviewBody": "These were okay..nothing special; WAY TOO SWEET for me. But my kids liked them, go figure."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "kristennoelle78"
},
"reviewBody": "These turned out sooo yummy!! After reading other reviews, I did add an extra egg and I used 1/2 cup of milk. Also, I let my daughter pick out the morsels. We used Tollhouse milk choc. peanut butter swirls."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jen"
},
"reviewBody": "Very easy &amp; yummy! You will need a glass of milk with this one!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "ibakegoodness"
},
"reviewBody": "I took the advice of adding more milk to the batter but only ended up with basically white CAKE, not brownies. they were cake-ie and i was not super impressed. next time if i ever decide to make this recipe again i will not add any additional milk."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cookin kathy"
},
"reviewBody": "I took the advice of the others and added a little more milk. They also did need a little more time to cook. But mine look just like the picture - taste delish. Super easy to make. As far as not being able to spread the batter out - Two words - OFFSET SPATULA! Wet with hot water and dry and you can spread it very easily. As far as not being able to get it out of the pan - I line my pan with foil whenever the recipe allows. Easy to cut and nothing much to clean up"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Traci Jordan"
},
"reviewBody": "Very good brownies. Taste delicious but when I cut them they didn't come out all pretty. Who cares? They tasted wonderful."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "AuntieTinka"
},
"reviewBody": "Maybe it was my oven but they took FOREVER to cook (like 45mins) and they were still a bit underdone, but the edges were starting to burn.. And waayyy too sweet.. I would like to try it again tho just use less chips?"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "maiingan"
},
"reviewBody": "I probably should NOT have listened to others who said increase baking time. It came out very dry. Everyone's oven is different I think. Maybe with some ice cream it won't be a total waste. I'll take the blame for the less than perfect outcome."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Adilah"
},
"reviewBody": "Very good ...but I had to add 15 minutes to the baking time.....these are more like blondies than white brownies...and they look nothing like the picture."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cher"
},
"reviewBody": "I'm giving these 5 stars because people couldn't stop talking about them at the party! I did use about 2 TBSP more milk and I melted the chips before adding them to the batter. *Very difficult to spread to I just sprayed my hands with PAM and patted the batter into the pan, worked perfectly!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Raye of Sunshine"
},
"reviewBody": "I made some major modifications to this recipe. First, I didn't have white cake mix so I used butter. Secondly, I took the advice of others and used 1/2 C milk and 2 eggs. And last, I didn't have any chips whatsoever in the house so I used 3/4 C peanut butter (nuked it in the microwave for about 40 seconds to make it easier to mix in). It was still hard to pour into the pan. I snuck a bit of batter and was surprised that it tasted almost like a Do-Si-Dos! It came out more like cake than a brownie, so in that sense I was dissapointed but it was still so good and within a little over 24 hours my boyfriend and I ate them all! Next time I'll try the actual recipe but I might swap butterscotch chips for peanut butter chips since I don't care for butterscotch."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "FERNVS"
},
"reviewBody": "I hate to tweak recipes and I try never to do that here on this site, but I guess we all have things that we make our way. I started with a yellow cake mix. I placed the mix in a bowl and then added 1 cup of white chocolate chips so that they would get coated with the mix. I then added in the brown sugar and mixed well. After reading about other people not being able to spread in to a pan, I thought that most brownie mixes call for oil. So I added 1/3 c. canola oil, then ½ c. water in place of milk and 2 eggs. Once I had the ingredients all mixed together, the consistency was more like brownie batter. My family really enjoyed these and I would make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "BABY"
},
"reviewBody": "Ok was it just me or was it reaaaally tough to get it into the pan to bake?? I had to pull the mixture one way and then pull it another way just to try and fit it onto the pan so it would be even and it would bake correctly. Yes it was simple to make without a doubt but it may have either needed a little more milk or maybe another egg. I don't know cause I followed the directions as stated. Overall it was a good brownie."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "JFoo"
},
"reviewBody": "Followed the directions that were provided. Unfortunately they came out gooey. I'm not sure why they did not bake properly. After baking them on a higher temp they were edible. Unfortunately they sounded delicious but were a bit too sweet for me."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Denise Nika"
},
"reviewBody": "These were ok. You MUST increase the milk. You'll never get them in the pan. Also, unless you're a huge fan of butterscotch, I'd suggest using some other type of chip."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Troye"
},
"reviewBody": "You are absolutely right, the photo looks way too light for these brownies (which smell delicious as they are cooling on my counter). Also explains why there is no evidence of the chips in it. Although thank you for the link, I think I'm going to try those green tea brownies now :) To the poster of the photo: you may want to request permission to use the photo from the owner or remove it. If it is not your photo, it is against the law for you to post it without that permission and/or giving credit to the photographer/owner. It'd be kinda silly to get into legal hot water over a photo of a brownie."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Baricat"
},
"reviewBody": "Relentlessly, overwhelmingly sweet with a pronounced \"processed\" flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "evacooper"
},
"reviewBody": "we call these blondies! i made them once, not this recipe, i don't use cake-mixes, i just made my mother-in-law amazing brownie recipe, but left out the cocoa... although it comes out very sweet!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Joanne Capella"
},
"reviewBody": "I made these for an organization that my husband works with and the volunteers snapped these up in a minute! They're very good and incredibly easy to made. I do agree that the batter is very stiff, and I did increase the milk to half a cup. I found it also very difficult to spread the batter in the pan, but well worth the effort."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Robin M"
},
"reviewBody": "These were delicious! We had to add just a little more milk than what was called for. I am always on the look out for a treat that my son who is allergic to chocolate can enjoy, and he Loved these brownies!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Teri Carrillo-Fox"
},
"reviewBody": "Very good! These were so easy to make, and I was surprised by how much I liked them, since I've only ever had/made \"chocolate\" brownies. The first time I made these I used a butter recipe yellow mix w/white choc chips, and I just finished making another batch with a spice cake mix &amp; white choc chips. I did take suggetions and increased the eggs to 2 and milk to 1/2 c., and mixing the chips w/a little flour before adding absolutely did the trick to keep them from sinking to the bottom. Both flavor versions came out excellent and I'm including them in my Christmas cookie giveaway. I love the texture and the versatility of the recipe--can't wait to try more new and interesting combos!! Thank you for the easy and tasty alternative to the same ole brownie :-)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "bellydancer"
},
"reviewBody": "Edible, wouldn't make them again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sally"
},
"reviewBody": "This is what I'm taking to the next potluck I go to. Delish. Everyone will love them and they are so easy. \nI used yellow cake mix because I had one, 2 eggs, 1/2 cup milk as per other reviewers. Will try as per original recipe next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Magg Lynch Roberts"
},
"reviewBody": "I made these with my 3 yr. old daughter last night, and they turned out great. I did increase the milk to 1/2 c., as some other reviewers suggested, and cooked them in a preheated 325 degree oven for exactly 30 min, and they were throughly cooked. My husband loved them. A great recipe b/c it so easy, and the only things I had to buy were the cake mix (oh, i used butter cake mix) and the butterscotch chips!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "anikaelise"
},
"reviewBody": "These were soooooooo good. The batter is VERY thick so I would suggest more milk also. It was very hard to get all the batter out of the bowl and spread into the dish. So, MO MILK!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Farm Wife"
},
"reviewBody": "Very sweet, easy to make although, yes, a little hard to spread in the pan due to thickness of the dough. Couldn't be much simpler!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Sheila"
},
"reviewBody": "Had to add more milk, as others said. Ended up baking for over 40 minutes before middle was done. The result was something that tasted like overly sweet, but somehow bland, dried out cake - chewy, but not moist. I don't know that we will be able to eat the whole pan of these. Definitely will not make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Alicia"
},
"reviewBody": "WOW!!These are awesome! I am shocked how moist and chewy they came out, especially with out having to add any butter or oil of any kind. I did add almost a whole bag of butterscotch chips however which made them a little more crumbly, but worth it! And I am a HUGE frosting fan so I frosted them with a butterscotch frosting I found on this site as well! VERY easy and VERY YUMMY!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Chowchick"
},
"reviewBody": "These brownies are sooo good!! I tried white chocolate chips rather than butter scotch...peanutbutter chips would be good too!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "FRAMBUESA"
},
"reviewBody": "These weren't BAD, but they weren't anything spectacular. You definitely need more milk than what the recipe calls for. I used about 3/4 cups which made the cake/brownies puffier than what they probably would have without so much liquid. I thought the addition of extra sugar was a bit much...it was just a bit too sweet. Not terrible, but probably not something I'll make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I am in the process of making these now and after 30 minutes of baking at 325 degrees and still having a soupy mix, I turned up the heat to 350 degrees and baked for 10 more minutes. When I make the next batch, I will start out at 350 degrees. \r\n\r\nThey look REALLY good though and I am having a hard time waiting for them to cool."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "ARMYWIFE10"
},
"reviewBody": "I like the way these taste. I did follow the suggestions &amp; added a bit more milk. My problem was in the baking time, at 25 min it was puffy &amp; golden brown (passed the toothpick test as well) so I took them out. The middle completely sank &amp; seems to be underbaked while the edges are perfect. They still taste pretty good, just really watch the bake time for desired doneness."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I love this basic mix recipe. I did modify to increase eggs to 2, and increased the milk to 1/2 cup. I just substitute/vary the ingredients to suit my tastes. Almost a cup of any dry ingredient works marvelously. I like coconut in the chocolate cake version."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "AWESOME!!! My family went crazy over these....I didn't adjust the recipe at all and yes it was sticky to get into the pan and off the bowl sides but totally worth it! thanks will use this again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "SEE NU"
},
"reviewBody": "Tasted like dry cake."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Faith LaBarbera"
},
"reviewBody": "I love this recipe...I've made this many times now. I like using a yellow or butter yellow cake mix better than white and add more milk as well. Great recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "MrsIronChef"
},
"reviewBody": "Easy to throw together and hard to keep in the house. I added a litte more milk 2 more Tbs than the recipe called for due to the hard texture of the mix it was hard to get out of the bowl and into the pan."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I didn't have the butterscotch chips so I used Chocolate chips instead. My kids still loved them!! Very easy to make!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "YMACORR"
},
"reviewBody": "These taste GREAT and are super easy. The batter is really thick though - I increased the milk to 1/2 cup and probably could have added more. They were a big hit with my husband's coworkers!"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/25817/white-brownies/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/362/desserts/cookies/",
"name": "Cookies"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/11977/desserts/cookies/cake-mix-cookies/",
"name": "Cake Mix Cookie Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/25817/white-brownies/",
"name": "White Brownies"
}
}
]
}
}
, "about": [
]
}
]