				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "White Cheese Chicken Lasagna"
,"datePublished": "1999-06-29T00:07:37.000-04:00"
,"dateModified": "2023-01-20T15:22:39.000-05:00"
,"author": [
{"@type": "Person"
,"name": "Lisa Humpf"
,"url": "https://www.allrecipes.com/cook/24325815"
}
]
,"description": "This cheesy chicken lasagna with spinach uses a creamy white sauce that&#39;s made with three kinds of cheese: mozzarella, Parmesan, and ricotta."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/eI7ULWN2lfrCrGGhSe3mWAsw70c=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/8295440-1a4054dae44c41b49c3905994b9430f1.jpg",
"height": 960,
"width": 960
}
,"video": {
"@type": "VideoObject",
"embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=1780426225001",
"description": "See how to make a top-rated 3-cheese white lasagna.",
"duration": "PT4M39S",
"name": "White Cheese Chicken Lasagna",
"thumbnailUrl": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/1033249144001/d9db2c37-7a93-437e-8f39-56ca915e2a93/f17476fd-01ab-4964-9a8f-4019a6ea7964/1280x720/match/image.jpg",
"uploadDate": "2021-06-27T12:28:13.272-04:00"}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "White Cheese Chicken Lasagna"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.4",
"ratingCount": "2498"
}
,"cookTime": "PT50M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "369 kcal"
,"carbohydrateContent": "23 g"
,"cholesterolContent": "77 mg"
,"fiberContent": "2 g"
,"proteinContent": "24 g"
,"saturatedFatContent": "12 g"
,"sodiumContent": "671 mg"
,"sugarContent": "3 g"
,"fatContent": "21 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT25M"
,"recipeIngredient": [
"9 lasagna noodles",
"0.5 cup butter",
"1 onion, chopped",
"1 clove garlic, minced",
"0.5 cup all-purpose flour",
"2 cups chicken broth",
"1.5 cups milk",
"1 teaspoon salt",
"4 cups shredded mozzarella cheese, divided",
"1 cup grated Parmesan cheese, divided",
"1 teaspoon dried basil",
"1 teaspoon dried oregano",
"0.5 teaspoon ground black pepper",
"2 cups ricotta cheese",
"2 cups cubed, cooked chicken meat",
"2 (10 ounce) packages frozen chopped spinach, thawed and drained",
"1 tablespoon chopped fresh parsley" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Preheat the oven to 350 degrees F (175 degrees C)."
} ,{
"@type": "HowToStep"
,"text": "Bring a large pot of lightly salted water to a boil. Add lasagna noodles and cook for 8 to 10 minutes or until al dente; drain and rinse with cold water."
} ,{
"@type": "HowToStep"
,"text": "Meanwhile, melt butter in a large saucepan over medium heat; stir in onion and garlic. Whisk in flour until lightly browned and onion is tender, about 2 minutes. Add chicken broth, milk, and salt; cook, whisking continuously, for 1 minute."
} ,{
"@type": "HowToStep"
,"text": "Stir in 2 cups mozzarella and 1/4 cup Parmesan until well combined. Season with basil, oregano, and black pepper; remove from heat and set aside."
} ,{
"@type": "HowToStep"
,"text": "Spread 1/3 of the sauce mixture in the bottom of a 9x13-inch baking dish. Layer with 3 lasagna noodles, ricotta, and chicken. Arrange 3 lasagna noodles over the chicken and layer with 1/3 of the sauce mixture, spinach, remaining 2 cups mozzarella, and 1/2 cup Parmesan. Arrange remaining noodles over cheese and spread remaining sauce evenly over noodles. Sprinkle with parsley and remaining 1/4 cup Parmesan."
} ,{
"@type": "HowToStep"
,"image": [
{
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/eI7ULWN2lfrCrGGhSe3mWAsw70c=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/8295440-1a4054dae44c41b49c3905994b9430f1.jpg"
}
]
,"text": "Bake in the preheated oven for 35 to 40 minutes."
} ]
,"recipeYield": ["12"]
,"totalTime": "PT75M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sheryl Holder"
},
"reviewBody": "This is a keeper!! Chef’s kiss delicious!!! Only changes I made were in the comments, I substituted cream cheese instead of ricotta, and used fresh spinach. We dug right in cause it smelled so good!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "samanthastaley47"
},
"reviewBody": "This was delicious. I used rotisserie chicken cause I'm lazy, I love ricotta so used a little extra. Will be adding this to my monthly menu."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I made it a day before and baked it for dinner tonight. Family absolutely loves it, I did season and partially cook the spinach. And added crushed rosemary to the chicken and used cream cheese instead of ricotta. Other than the little tweaks it's definitely a winner."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I have made this recipe severaL tImes. I make it per the recipe except I use 1/4 less spinach. I'm using it again for a large dinner party next week and I will make this with a regular classic red lasagna with hamburger and Italian sausage. Every time I do this the white lasagna always goes first I love this recipe!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Ashy"
},
"reviewBody": "My family doesn't like ricotta cheese, so I didn't put that in. Instead of the broth, I used milk and some bouillon powder. I also added cheddar cheese in the mix of the other cheeses. Other than those changes it was a really good recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I tried this and it turned out good. Very tasty and Creamy. Delicious Recipe"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "S «H2OS» Watters"
},
"reviewBody": "Turns out great if you actually know how to cook and don't blindly follow a recipe without tasting as you go. Personally prefer a bit more seasoning, and adjusted to my tastes. All of the bad reviews mention blandness, which is easily remedied with some common sense."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Best recipe I've found on this site by far!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Rick Galda"
},
"reviewBody": "I made the recipe as is, less dried parsley subbing dried. The lasagna cooked perfectly with the given instructions. This is obviously a very popular recipe with lots of fans. I personally found the chicken taste to be overwhelming. A chicken dish with a chicken broth based sauce was too much for me, next time I will take out most of the broth and add more milk. I will also use fresh sauted spinach next time for freshness, taste, and texture."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "doncon"
},
"reviewBody": "This is the second time I’ve made this. This time I felt like it was a little bland. Next time I’ll have to try something to add a little more flavor to it. I still love it though."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Very easy to follow and make. Very tasty, but I used thin sliced tenderized chicken breast instead."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Michele"
},
"reviewBody": "This was a great hit! I basically made it as written with the only tweak I made was throwing in the bit of extra mozzarella I had instead of storing it. I was concerned with the reviews saying it was dry and not enough sauce, I thought it was perfect. (I did use the oven noodles because it was what I had in my pantry but boiled them to prep them instead of having to add the extra liquids you have to put in when you use them directly uncooked in a lasagna. They were perfect). This recipe is a keeper!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "J. Weir"
},
"reviewBody": "This was awesome, but what was even more amazing was the rave reviews by all 4 kids (12, 9, 7, 5).\n\nI did make some minor tweaks that left me plenty of dishes to clean and took much longer to cook, but well worth it!\n\n1- I used fresh spinach instead of frozen. I used 2 (10oz) bags, cooked them for approx. 3-5 mins in 1 tablespoon of olive oil. I then squeezed any remaining liquid/oil out with tongs, and let drain in a strainer until I needed it.\n\n2- I cooked 2 chicken breasts in my sous vide @ 150 degrees for 1 hour. Then I shredded the chicken.\n\n3- I used 32 oz of ricotta, and in a LARGE mixing bowl I mixed together the ricotta, spinach, and shredded chicken.\n\n4- I made handmade lasagna noodles from scratch. I let them dry while the chicken cooked. I did NOT precook them before layering. \n\n5- I also added 1/3 cup of chardonnay wine to the sauce mix for more flavor, and more liquid for the homemade noodles.\n\nThen I layered as the recipe suggests, and cooked for 35 mins, and broiled for approx. 3 mins to golden the cheese"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Michael Baker"
},
"reviewBody": "Very easy and fresh recipe to do! Absolutely delicious!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tara"
},
"reviewBody": "This is amazing and I’ve made it several times. Only thing I’d say is off is the prep time. It takes a great while to do it right but it’s soooooo worth it. Thank you for this recipe. MAKE THIS! You won’t be sorry!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sherri"
},
"reviewBody": "Easy to make and my husband really enjoyed the meal ."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sharon"
},
"reviewBody": "This was a big hit! Will definitely make again. I didn't have lasagna noodles, so just did it with fettucine instead, which was just as good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jodie LeBlanc"
},
"reviewBody": "We absolutely love this recipe. Our picky children love it so much I've had to make it weekly since the first time a month ago. I double the sauce. Add the creamy melt Mozzarella cheese on top. Also because it's less mess chopping food for the littles after the 1st time making this I started using different pastas other than Lasagna pasta. so I guess I make a chicken Lasagna casserole instead? Lol ?? either way this recipe is Ahhhhhmazing!!!!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "SHENDOAH"
},
"reviewBody": "As written? It was super creamy and everyone liked the shift from traditional red lasagna. Unfortunately it is desperately bland, (but with a lot of potential!) This just had no pop. We were sitting at the table shaking salt, garlic powder, Italian seasoning, and red peppers on it. ANYthing to give it some zip. I had a lot of garlic and shallots in the spinach, we added plenty of Italian seasoning to the ricotta. I think it is the Roux that mutes everything. Next time I'll go full creamed spinach for that, roast the chicken with plenty of garlic and rosemary, and figure out something for the roux so that it actually lends flavor to the dish."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "carmicjam"
},
"reviewBody": "This was easy and tasty. I mixed the ricotta cheese with the spinach. I seasoned the chicken with salt, cracked black pepper and lavender. I also cut the recipe in half. It turned out great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "GeoGirl"
},
"reviewBody": "Absolutely delicious! I followed the recipe except I used fresh spinach instead of frozen! This was easy and a great twist to a classic meal! I will definitely make this again :-)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Cindy D"
},
"reviewBody": "Good tomato-free alternative, but flavor not worth the effort."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "shellefisher"
},
"reviewBody": "This is a very good fall/winter dish. \n\nMade this for my family without the chicken, it was excellent. I would follow the folks that had suggested on not using the mozzarella in the sauce, since it's very rich enough with the parmesan. As for the seasonings, adjust by your taste and family. I did Italian seasoning in between layers. \n\nThis is a dish you'll want to make for potluck or dinner with friends, they will love it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "brsharky"
},
"reviewBody": "This was great! I did add a little extra seasoning and cheese after reading the reviews left by others. I also used fresh spinach and oven-ready lasagna noodles. This was delicious and relatively easy to make. Even my picky eaters went back for seconds!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CJ Morgan"
},
"reviewBody": "Very tasty. Followed recipe to last detail EXCEPT- I accidentally added all 4 c of mozzarella to the white sauce. This made the sauce thicker to work with, but still good. Two noodle layers into building is when I realized I was supposed to had held 2 c mozz back for inbetween the 2nd and 3rd layer... so I did what any cheese-loving woman would do and added in another 2 c! This made it the cheesiest, yummiest lasagna ever and I have no regrets. (Though my waist line might.) I think next time I make it I might add more onion and garlic though- I just didn’t really taste it in the end- but then again I did almost double the cheese ratio so..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Donna May "
},
"reviewBody": "This cake out perfect! My family gobbled it up. Only change I made was I used heavy cream instead of milk for the sauce, only because I had it left over from another recipe. Next time I'll try it with milk."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mo1760"
},
"reviewBody": "Very good &amp; easy to make."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "alicia156"
},
"reviewBody": "Made this tonight and it was a hit. It makes 12 very filling portions. I cooked down a 16 oz fresh bag of spinach and mixed with the ricotta. I added the chicken as its own layer but next time I will just add the chicken to the sauce. I used the express no bake noodles and added just a tiny bit of extra broth and they cooked up just fine. Next time I'll probably try adding sauteed mushrooms and bacon to the sauce as well. It is superb as it is though, I just like to try adding new things when I try recipes. Thanks so much for the share!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jenbunni"
},
"reviewBody": "No changes. Love the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "shelly"
},
"reviewBody": "Did not have a lot of flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sandra Kay Williams"
},
"reviewBody": "I loved it, easy and fast. I did't have parsley so I put more spinach on top. I also added small shrimp."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Diana Mercado"
},
"reviewBody": "Great lasagna recipe! I will definitely play around with the cheese quantities. I think it had more mozzarella than necessary but definitely a preference. 1 star off because it ended up in blobs on our plates after cooking. Looked more like cheese dip than clearly defined lasagna layers. Not a great thing for entertaining. Leftovers ended up looking and tasting great though!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Leslie Young"
},
"reviewBody": "Very delicious!! I don’t boil the noodles ahead of time I just put them in uncooked and bake for a full hour. Turned out great"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MrLewis1971"
},
"reviewBody": "So, while quarantining I decided to cook something different for my very picky family and let me tell you I'm happy I did. The final product after everything was completed didn't look that appeasing but let me tell you that first bite was . \n\nI knew it was good when everyone at the table looked up and said \"Dad this is good\"...\n\nI followed the recipe completely with no added ingredients or moderations."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Taresa Lambert"
},
"reviewBody": "Was too bland , most likely would try a different cheese if i fix it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Susan Stunes"
},
"reviewBody": "Excellent first time for a white anything but this was well worth it!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Kathie"
},
"reviewBody": "I was very disappointed... flavor was not good. I followed the recipe and also took advice of others using one box of frozen spinach and adding additional 1/2 cup of milk because I used ‘no boil’ lasagna. I would not make this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sasha Cruz"
},
"reviewBody": "Great recipe! A lot of work but Definitely a labor of love but it was a hit with the family and will make again! I used less spinach than recipe called for but otherwise followed recipe to a T"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Wendi McDaniel "
},
"reviewBody": "I made this recipe last night. The only thing I changed was I used canned shredded chicken (2 big cans, 2 cups worth) and I used 1 6oz fresh baby spinach bag which I sauteed in a little bit of olive oil and salt/pepper. I did mix the ricotta, chicken and spinach together ahead of time. Aside from the kids (teenagers) not liking spinach and picking that out, it was delicious and the whole family enjoyed it! I will definitely make this again, probably the same way I did before just no spinach."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "az cookie"
},
"reviewBody": "I don't understand all the rave reviews. I think my palate is too sophisticated for this recipe. \n\nThis lasagna lacked flavor. I omitted the spinach, doubled my garlic and added mushrooms. I also thought of using artichokes, but didn't bother. It would not have helped. I used rotisserie chicken, which by itself is rather flavorful. \n\nI think the sauce had too much flour and was rather grainy, even though I let my sauce cook as directed. I'll keep looking for another recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "SHRAVK"
},
"reviewBody": "Delicious and easy to orI added sauteed mushrooms to the spinach. Also reduced the butter by half. Didn't miss it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jennifer Trejos"
},
"reviewBody": "Just want to stress that you should use a large sauce pan and not a medium sauce pan. Prep time took slightly longer than half an hour. Overall a good eat!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Demiser"
},
"reviewBody": "I liked it and my husband said it was ok. I added more garlic than suggested but it still lacked something. I might make it again but, like another reviewer said, I used every pot in my house to make it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Aki"
},
"reviewBody": "Love this recipe.....wifey love this"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "M McGrath"
},
"reviewBody": "Loved this dish! Both hubby and I enjoyed it. The only change was I used ground chicken. It was what I had on hand. Excellent choice. I added a few Italian spices while sauteing the chicken. \nMy husband suggested some crumbs on top next time for added texture. He's been listening to that food channel a lot. LOL"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jolynn Sullivan"
},
"reviewBody": "I have tried this recipe twice. The first time, I followed it exactly as is and it turned out to be a good meal. I would have rated it a 3/5 Stars. My family ate it and said that it was “okay” but, not a show stopper. The complaints were that there was way too much spinach and the chicken was a bit bland, too chunky and there wasn’t enough of it. I allowed it to cool for a bit before serving but, it still fell apart when it was dished out so the presentation wasn’t visually appealing. The second time that I made it I made a few adjustments that helped to boost the rating to 4/5 Stars. This time, I only used 1 package of spinach, a much better ratio according to my audience. I also marinated the chicken overnight in 1/4 c olive oil, 1 T minced garlic, 1/2 t coarse salt, 1/2 t ground pepper, 1/4 t oregano, 1/4 t basil, and 1 T fresh parsley. I grilled the chicken and then shredded it this time instead of cubing it like the recipe suggested. It seemed to blend in better this way and you didn’t end up biting into any big chunks of chicken. I added 1 beaten egg, 1/2 t salt and 1 t fresh parsley to the ricotta mixture. This seemed to help hold everything together nicely and made the presentation more appealing without a noticeable difference to the flavor of the dish. To summarize, I will make this recipe again with the alterations but, it didn’t go over well enough in my family to make it into our permanent rotation."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Laurahallie"
},
"reviewBody": "I don’t necessarily agree that this was bland, but I do think that perhaps something key was missing from the dish. That said, it was tasty! Nice and cheesy. And a lot of work. I didn’t make very many changes but I did up the garlic to 1.5 teaspoons (1 tsp equals 1 clove). I didn’t use parsley on top but had so much spinach left over that I ended up sprinkling some on top in place of the parsley. I used chicken thighs cooked in olive oil. If I were to make this again, I might add some additional depth of flavor by adding mushrooms and/or perhaps even some spice with a sprinkling of hot pepper flakes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Margie Robinson"
},
"reviewBody": "This was absolutely delicious! My daughter wanted me to meet some of her friends so I invited them over to dinner and made this. They all loved it...even the ones who \"hate spinach\". I made it as written but I think the next time I make this, I will saute the chicken in garlic infused olive oil and use fresh spinach instead of frozen."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Celia MacDonald"
},
"reviewBody": "Family loves this recipe and so do guests. So delicious!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kristingraceful"
},
"reviewBody": "Smells amazing, I tasted the cheese sauce before I assembled and it has TONS of flavor! It does take a lot of dishes to prep the ingredients, and I halved the recipe so it was a lot of extra thinking and math for the ingredients that were divided. Would definitely make again, just need to plan ahead to have ample prep time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JMac"
},
"reviewBody": "I made a larger/huge lasagna by adjusting this recipe. Increased the sauce by 50%.Used 12 lasagna noodles, a large container ricotta, and used much more mozzarella &amp; parm. (I may try 15 noodles next time, 5 on three layers.) I increased garlic to 3 cloves &amp; used all fresh herbs. I cooked up 16oz baby spinach and a large container mushrooms in two separate pans. I also cooked three large chicken breasts sprinkled with all seasoning in a pan too. I mixed the spinach, mushrooms &amp; ricotta together. I layered sauce, then noodles, ricotta, chicken, sauce, mozzarella &amp; parm twice and then a little sauce on top sprinkled with parm &amp; fresh parsley. I also broiled the top after baking to brown."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "DonnaK"
},
"reviewBody": "I used canned white chicken and didn't have any basil on hand. I also misread the instructions and ended up not using all of the ricotta cheese. Despite those changes, it was a very tasty dish and one that my husband really likes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Aubrey Bush"
},
"reviewBody": "Delicious! Second time making it and worked out both times. Seems to take longer than posted, but probably because I cook my chicken at the same time. Took about an hour to make and then 35 minutes of cooking. I always use far less ricotta than mentioned, maybe about half a cup (since there is only one layer of it)."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mary Dildine"
},
"reviewBody": "I followed the recipe on half the lasagna, but added mushrooms to the other half for my mushroom-lovers. My entire family loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "melanie"
},
"reviewBody": "Looks Very Delicious"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rosalind Winston"
},
"reviewBody": "Loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bobbie"
},
"reviewBody": "I made this but substituted chopped broccoli instead of spinach. YUMMY!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "tweedledeuk"
},
"reviewBody": "Awesome and very straight forward! I halved the recipe because it made more then I needed and it still turned out awesome. Will make again"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "justinianosm"
},
"reviewBody": "Made it now several times it's my go to dish for entertaining. So delicious and worth the time!! Ty all recipies, you rock!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Lisa Tisone"
},
"reviewBody": "Sadly this was not a hit for me personally. My family loved it but I found the onion overpowering."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cchow"
},
"reviewBody": "Being this is the second time I am making this I switched it up with using one bag of fresh spinach and some fresh sliced mushrooms. I sautéed the spinach and the mushrooms together and added the spinach to the ricotta cheese as other reviewer suggested. Was way better the second time! Also used fresh basil and parsley and omitted the salt. Parmesan cheese has plenty of salt! Yummy ;)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jamie53120"
},
"reviewBody": "This was absolutely delicious. I made this last night for dinner and we all loved it! I have some picky eaters and they all had more than one serving. I will definitely be making this again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "CCR"
},
"reviewBody": "Delicious \nVery comforting\nI used a rotisserie chicken instead of cubed chicken and I used the dark meat only this added a lot of moisture and a lot more flavor"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nannette Culclasure"
},
"reviewBody": "I Yeah you seasoning to my chicken breast I also used fresh grated Parmesan cheese I mix the spinach and the chicken together and head to two layers of the mixed spinach and chicken instead of one layer of chicken and one layer of spinach"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nannette Culclasure"
},
"reviewBody": "I used fresh grated Parmesan cheese and put an italian seasoning on the chicken ; let bake for 50- 60 minutes. I also mixed the chicken &amp; spinach together and had 2 layers of mixed instead of 1 layer of chicken and 1 layer of spinach, much better this way."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Celeste"
},
"reviewBody": "No changes first time. Will make it again and play!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Barbara Spano-Stevens"
},
"reviewBody": "I've made this several times over the last year and it always comes out perfect! Absolutely delicious and a real crowd pleaser. Give it a try!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jennifer Reznicek"
},
"reviewBody": "It was too much for my pan and too much spinach"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "MiamiMonica"
},
"reviewBody": "I made this as lasagna roll ups instead of a traditional lasagna. Adjusted the quantities since I only made 8 rolls: 4 with spinach and 4 without (due to picky husband) and I also used ground chicken instead of the cubed chicken. Came out really good, but probably next time I will put the broiler on during the last minutes (for presentation purposes)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kimberly W"
},
"reviewBody": "I used no boil noodles, but wouldn't recommend it, especially for the top layer of noodles because they didn't get soft enough and I had to poke holes and add at least 3/4 cup of broth the get it softer. I used a lot more basil, oregano, pepper and salt to get more flavor. I tasted the sauce until I loved it. The layering instructions were vague at first, but I ended up with sauce, noodles, all of the ricotta, I added roasted red pepper, all of the chicken, noodles, sauce, fresh chopped spinach (about 8 oz), cheeses, noodles, remaining sauce, dried parsley and cheese. I tented the lasagna until the end to brown. Served with a salad and garlic bread. I would make this again. It was flavorful to my liking and wasn't overly cheesy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lori Smith"
},
"reviewBody": "This is rich &amp; creamy. It thickens as it sits. Not like in the video. I added mushrooms to the spinach layer. I Made this for a church event and everyone loved it. I brought home an empty dish."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tony Rynearson"
},
"reviewBody": "Made this with a fresh Parmesan cheese and used about twice as much as the recipe called out, and it turned out fantastic. Will make this again and share with friends."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "AprilN"
},
"reviewBody": "It was amazing! I did add a bit of seasoning to the chicken (garlic and onion powder and a bit of seasoned salt) and garlic and onion powder to the sauce mix. I followed one of the other reviews and added carrots and zucchini. With those additions it was AMAZING!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "GabeC"
},
"reviewBody": "Best lasagna I've ever made. I mixed the chicken, spinach, and ricotta together to make the layering easier, and next time I'll ease up on the cheese as I felt like it was too much."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "April Stolfus"
},
"reviewBody": "Very Cheesy. I used a rotisserie chicken i simply shredded. Delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Kimberly"
},
"reviewBody": "I was looking for a white chicken lasagna recipe and chose this one based on the homemade roux base and fresh chicken. It was a good recipe and cheesy however too bland and would require adding some basic seasonings to the sauteed chicken in the pan (crushed black pepper/salt at the very least). \n\nAlso, I did add crushed red pepper flakes, fresh parsley, and crushed black pepper to the roux . As well as substituted fresh baby spinach over frozen spinach. \n\nMy dinner guests enjoyed the white cheese chicken lasagna and two pieces were left that were up for grabs as leftovers! Thank you for always providing a solid foundation and good recipes for us!\n\nKimberlyDarby"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Arg"
},
"reviewBody": "I did thighs , but other than that I made it the same &amp; did prepare the day before, which, worked out perfect It was very moist &amp; tasty."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Chet & Stacer Lynn"
},
"reviewBody": "This recipe turned out great. I made as directed except I cut the spinach down to only one package, which ended up being perfect for our family’s tastes. I will definitely add this to my regular rotation."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kathy"
},
"reviewBody": "The flavor got better over ort of a chicken &amp; dumplings taste. Layers do separate. I’d make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shawn Jerry Brill"
},
"reviewBody": "Oh my....this was sooooo delicious! I wouldn't change anything, followed recipe to a tee!!!! Ok maybe added extra cheese here and there, served with garlic bread. Make sure to use large lasagna pan!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Giselle Giron"
},
"reviewBody": "Great recipe! The only thing I changed was adding more garlic and using less spinach. I wish I would have swapped the frozen spinach for fresh but there's always next time! I will definitely be making this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JennerDean"
},
"reviewBody": "This recipe is awesome!! Loved it and fairly easy to put together. It was my first time making a lasagna and will definitely be making it again"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Tink"
},
"reviewBody": "It took a longer than I thought to make. It was very tasty, but I think it is much better the next day."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Keith"
},
"reviewBody": "Great recipe! Next time I'm going to try it with crab or shrimp or maybe crab and shrimp."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Martin Knutson"
},
"reviewBody": "This recipe was really labor intensive!!! I was glad I had all \\Saturday to play with this. I was also disappointed with the flavor, it was rather flavorless. It was good, but a little too much work for too little reward."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Gailk"
},
"reviewBody": "I made as directed but put mozzarella on top before baking.\nIt was a great hit."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Donna Russell"
},
"reviewBody": "I mixed spinach in the sauce and used more chicken. It was really good! My 13 yo granddaughter loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Howie"
},
"reviewBody": "Since I had never tried this one before, I followed the recipe precisely. It was great. Everyone cleaned their plates and asked for more. I think when I do this again, I will go with more of a carbonara flavor profile by adding some bacon into the cheesy sauce. This one is a winner. I'll do it again and again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mikeybigb"
},
"reviewBody": "Great, white lasagna. I used 3 skinless boneless chicken breast cubed small and browned with s/p. I love garlic so I put 6 cloves in. Will definitely make this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mary Gordon"
},
"reviewBody": "Delish!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "smickle"
},
"reviewBody": "Excellent. My family really liked it. It is quite rich and I love that. I would make it for guests. I followed the recipe and made no modifications. Will definitely make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Rachel Odle Iversen"
},
"reviewBody": "I used turkey instead of chicken. It was well liked and I will keep it in my all recipes cookbook."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Will"
},
"reviewBody": "Cheesy, creamy and delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "theresa"
},
"reviewBody": "Delicious as is!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lori Fitzgerald"
},
"reviewBody": "Super! It was a great change in routine and my kids (13 and 16) loved it! Prep time is far more than the original recipe states, but it's worth it....so 5 stars."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "James Currie"
},
"reviewBody": "This is a very good dish. Loads of flavor and cheese. This was my first time making my own sauce and it came out great. The only problem I had was with the layering and chicken cubes. I would say shred the chicken and lightly salt &amp; pepper it. The chicken and ricotta layer was a sort of jarring absence of flavor and weird texture the way it is set in the current recipe. Everything else was really good and now that I know to make sure the sauce is properly touching the chicken with every bite, it's much better."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "itsmestefanie"
},
"reviewBody": "I've made another version of this recipe, and this one is so much tastier!! I'm going to use chicken thighs or a rotisserie next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CPrecipes"
},
"reviewBody": "Scrumptious! I added more cheese and half and half to make it extra creamy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kate Semple"
},
"reviewBody": "This was a hit! Next time I would make more sauce, it was dry, but I did stretch everything out to make 2 lasagnas so I could freeze the extra so that was my fault. I mixed the spinach and ricotta together and next time I would mix the chicken into the sauce to make things easier."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/8758/white-cheese-chicken-lasagna/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/502/main-dish/pasta/lasagna/",
"name": "Lasagna Recipes"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/16801/main-dish/pasta/lasagna/chicken-lasagna/",
"name": "Chicken Lasagna Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/8758/white-cheese-chicken-lasagna/",
"name": "White Cheese Chicken Lasagna"
}
}
]
}
}
, "about": [
]
}
]