				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "White Fruitcake"
,"datePublished": "1998-12-06T15:12:50.000-05:00"
,"dateModified": "2022-09-30T15:37:41.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Brenda"
,"url": "https://www.allrecipes.com/cook/24321675"
}
]
,"description": "My mom&#39;s white fruit cake recipe has been a holiday favorite for years. Chewy bits of candied fruit and chopped pecans provide nice texture in every slice."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/17mr8WLzaiACNaxJooQH0rRjvZI=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/4623-7702226a5d4b424a86d626b6d7f2e2a8.jpg",
"height": 960,
"width": 960
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "White Fruitcake"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.8",
"ratingCount": "112"
}
,"cookTime": "PT120M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "369 kcal"
,"carbohydrateContent": "46 g"
,"cholesterolContent": "68 mg"
,"fiberContent": "2 g"
,"proteinContent": "4 g"
,"saturatedFatContent": "8 g"
,"sodiumContent": "102 mg"
,"sugarContent": "31 g"
,"fatContent": "20 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT35M"
,"recipeIngredient": [
"3 cups golden raisins",
"1.5 cups candied pineapple chunks",
"1.5 cups candied cherries",
"1 cup dried currants",
"2 ounces candied orange peel",
"2 ounces candied citron peel",
"0.5 cup orange juice",
"2 cups unsalted butter, softened",
"4 cups confectioners' sugar",
"8 large eggs, separated",
"4 cups pecans, chopped",
"3 cups sifted all-purpose flour" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Chop raisins, pineapple chunks, and cherries into smaller pieces and transfer to a large bowl."
} ,{
"@type": "HowToStep"
,"text": "Add currants, orange peel, and citron peel to the bowl. Pour in orange juice, cover, and soak, 8 hours to overnight."
} ,{
"@type": "HowToStep"
,"text": "Preheat the oven to 275 degrees F (135 degrees C). Place a small pan of water on a lower shelf in the oven. Line one 5x9-inch loaf pan and two 3x8-inch loaf pans with parchment paper."
} ,{
"@type": "HowToStep"
,"text": "Beat butter in a large bowl with an electric mixer until creamy. Gradually beat in confectioners&#39; sugar until incorporated."
} ,{
"@type": "HowToStep"
,"text": "Whisk egg yolks in a separate bowl until thick and pale in color. Add to the butter mixture and mix until incorporated. Mix in soaked fruit and orange juice mixture, then gradually mix in sifted flour."
} ,{
"@type": "HowToStep"
,"text": "In another clean bowl, beat egg whites until peaks form. Fold egg whites into the batter. Fill each of the prepared pans 2/3 full with batter."
} ,{
"@type": "HowToStep"
,"text": "Bake in the preheated oven until golden brown and a toothpick comes out clean when inserted in the center, 2 to 2 1/2 hours."
} ]
,"recipeYield": ["36"]
,"totalTime": "PT635M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "David Nave"
},
"reviewBody": "I cut the recipe to 1/4 and the fruit and nut proportions work just as well which is about 1 3/4 c any fruit, peel etc. and 1 cup of nuts. I also bake in a 8 x8 pan for 1 hour. I soak only the raisins but I add some spices to the orange juice and bring to a boil then add the raisins to cool and set overnight in the frig.. I candy my own lemon and orange peel which makes a big difference."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I have been making fruitcakes and Christmas cakes for years using recipes from Mary Berry to Betty Crocker and yours is the All Star Winner! The fruit flavor shines through and the pecans add that perfect snap to each bite. The beaten egg whites were a surprise and just lovely. Thank you for this addition to our Christmas table for years to come!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Very nice and easy to make"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ksbouver"
},
"reviewBody": "Didn't have any currents or raisins so I used dates and apricots for those two items. Every thing else was the same. The cakes turned out wonderful. Will use this recipe every year."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dnaber"
},
"reviewBody": "Used pineapple tidbits with juice in place of candied pineapple and orange juice Used green and regular raisins, dried mango, apricots and montemorency dried cherries combined and chopped to equal 7cups dried fruit. All other ingredients and instructions are the same, except I used walnuts instead of pecans. My son said, he couldn’t stop eating it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Southerncooker"
},
"reviewBody": "I did make changes, only because I couldn't find the fruit called for - I just substituted dried pineapple, cherries, raisins, golden raisins and dates with some grated lemon and orange peel. I also marinated with a combo of whiskey and orange juice. I would add some vanilla and maybe a little salt next time, but will definitely make again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Epeyton"
},
"reviewBody": "Wonderful and made it just as recipe called for. I will make it (God willing) next Christmas too. Thank you for a fantastic recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Denise Whitney"
},
"reviewBody": "I made some changes... of course... like everybody! lol! I took out some of the sugar and added some molasses to make a dark fruitcake. I also scaled it for 6 servings and it made 7 regular sized muffins."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Margaret Ross"
},
"reviewBody": "Made a very similar version, but didn’t use confectioners sugar, our family recipe and no nuts allowed in the white version. We put nuts and currants in the Imperial Fruitcake."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "jackie"
},
"reviewBody": "Splendid - really liked it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "zanele"
},
"reviewBody": "I highly recommend this recipe. This is the first time I've used confectioners sugar for a cake; I was impressed. The cake's texture is lighter than I imagined; the result off the chart."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DKBrown77"
},
"reviewBody": "The best fruit cake I have ever made! Great recipe"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Doris"
},
"reviewBody": "My husband loves this cake (so do I). I make it 2 to 3 weeks before Christmas and add 1 Tablespoon of Christian Brothers Brandy over the top; of course you can add more..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Paul Gray"
},
"reviewBody": "Great recipe. I’ve made this cake twice now. Turned out great both times. This is the only fruit cake recipe you will need!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "laura"
},
"reviewBody": "Used all dried fruits instead of candied. Added an extra 1/2 cup of spiced rum and brushed baked cakes with additional spiced rum. Baked cakes in 3x6 inch foil pans for 1 1/2 hrs. Baked until golden brown and cake tester comes out clean."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Alice Ortiz Araiza"
},
"reviewBody": "I used only candied cherries and pineapple (along with pecan nuts)because those are the two fruits my family likes in it. Nonetheless, the fruitcake was divine! I've added this to my recipe box. It's a winner!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "David Weir"
},
"reviewBody": "This turned out great! It’s a lot of work, though, as the batter is both large in volume and stiff to stir. You also need to be able to use three loaves. Otherwise, great recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "uncle victor"
},
"reviewBody": "Less fruit more nuts. People love it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "4birdz"
},
"reviewBody": "Made this exactly as the recipe states and it is delicious. My family loves it too. The recipe made 3 loaves. Definitely will be making this again. Thanks for the great recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Joan"
},
"reviewBody": "As I live in Hawaii, I turned this into a tropical fruitcake. I used dried and sweetened mango, papaya and pineapple as my fruits and also added dried coconut (unsweetened). For nuts I used macadamias. I used a mixture of fresh squeezed orange juice and coconut rum to soak the fruit. It tasted great straight out of the oven, but I am looking forward to even more flavor after it has been in the refrigerator wrapped in rum soaked cheese cloth for a few days ."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Barbs favorites"
},
"reviewBody": "I started making this cake 5 years ago for my husband at Christmas. It makes a lot of batter, so with what didn't fit in the 5x9 loaf pan, I make 3 extra slightly smaller loaf size cakes and gave them to good friends. Everyone wants this fruitcake for Christmas now. It is absolutely delicious exactly as written. The only thing I add is some adult beverage as it ages for a couple of weeks. I have used rum, Jamesons, bourbon, amaretto, doesn't matter - they all turn out great! Thank you so much for this recipe, Brenda, I can see it will be my Christmas tradition for a long long time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Stan"
},
"reviewBody": "Decades of searching for fruitcake recipes led me to this one a few years back. I have used it with great success now four times..\nI often change up the dried fruits but keep the quantities the same. I've even used dried figs, dates, prunes and sour cherries successfully.\nI prefer hazelnuts. I also add chopped dried mango for added color. \nThis is basically a good stable buttercake recipe but it makes MUCH more than the recipe indicates. I easily get (6) 3x5 (1) 5x8 and (1) 8\" round cakes. Try halfing if you need less.\n Hats off to Brenda's mom's recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Panduranga Kudige Shenoy"
},
"reviewBody": "Loved how the cake came out. But I did change the fruits in the cake to those I love ... Planning to bake the next batch soon, and this time I am thinking of changing things a little, and using Dark Rum instead of the orange Juice."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Joanne"
},
"reviewBody": "This was fabulous! I don't even like fruit cake too much, but my friend and I thought we'd give it a try! I probably added a smidge more booze just to make it more festive!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Yvonne"
},
"reviewBody": "LOVE THIS RECIPE !!!!!! \n."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Caro Bernardini"
},
"reviewBody": "This was an easy recipe to follow and it turned out OK. I just missed the spices. I'll try it again with some modifications for my taste!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sandra Barb-Cochran"
},
"reviewBody": "This is a really good fruit cake. I've used the recipe to make miniature Christmas fruit cakes for coworkers for the last several years, and now I get requests for it. The first time I made the recipe I made it as written. I prefer dried fruits, however, and since then have substituted different dried fruits for the candied fruit, depending on which dried fruit I had available. It's turned out nicely with any of the combinations I used. I also add about 1/4 cup of rum to the batter, and wrap the cakes in rum dampened cheese cloth for a couple of weeks."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ms Debra"
},
"reviewBody": "I've made this before and I will make it again along with the \"Rich Dark Fruitcake\" from this site. To this recipe I added 1/2 cup apricot jam, 1 Tb vanilla, 2 tsp almond extract and I omit the orange peel. I soak the fruit overnight, sometimes longer, in 1/2 - 3/4 cup of brandy, rum or whiskey (whatever I have on hand). \n\nWhen the cakes are cooked and have cooled down, I use a clean spray bottle and liberally spray the cakes with more alcohol before wrapping in parchment paper and then storing in large ziplock bags which I put inside plastic bins in my cool basement. I make them a month preferable 2 before Christmas and spray them several more times before they are ready, with the last spray no closer than 2 weeks before they are eaten. \n\nBoth of these recipes are so good that people want to buy them from me, so I always make extra."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Ellen Conrad"
},
"reviewBody": "It is delicious but made way more than recipe said. I substituted most of the candlied fruit for dried fruit as well as soaking the fruit in Brandy instead of OJ."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lesa Brooks Reddick"
},
"reviewBody": "This my 3rd time to make this, or my variation of it. I don't use any candied fruit.... i use dried fruits such as pineapple, apricots, and bulk dried cherries. Added 1/2 C. of bourbon also; I have to reduce everything by 1/3 of the total ingredients, since it won't all fit in my mixer. Switch to the dough hook after I add more than 1 cup of flour (before I add the fruit/ nuts); Even then, it's easier to divide the batters into 2 large bowls as your fold in the nuts.; My additions: 1/2 tsp. cinammon, and 1/2 tsp. nutmeg (or substitute pumpkin pie spice). Also, I reduce the sugar to only half of what this lists . You can also use Splenda instead, and it tastes good. (but do not use Splenda in the amount listed for total sugar here.... use half). Check it 15 minutes before the cooking time here. After baked.... pierce cake and pour another 1/2 cup Bourbon on it. Wrap in wax paper &amp; foil, and store at least one week before serving.... one month is better."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Wendye"
},
"reviewBody": "This is I think the 5th year in a row I've made this. I don't like fruitcake, so I don't actually like this.. However, my father likes fruitcake so I made it, husband tried it and he likes it a lot. So I now make it every year."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Suzie Kallin"
},
"reviewBody": "I followed the recipe but didn't add Citron (don't like). I love fruit cake &amp; this cake turned out fine. However, it does not have a depth of rich flavor and needs spices &amp; maybe a splash of liquer."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kundra"
},
"reviewBody": "subbed out a few fruits but it was wonderful! The recipe make a lot more than I was expecting. A loaf, two mini loafs, and a whole tray of muffins!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Judy"
},
"reviewBody": "This is a wonderful recipe. It was my first experience at making a fruit cake and it was a real hit."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "YUMMYCOOK2"
},
"reviewBody": "Oh, my. This is crazy addictive! If I use the \"candied\" fruit again, I will cut down on the sugar just a bit. If using regular dried fruit, the sugar level is probably just fine. That will be a future experiment. This will be my go to quick bread base recipe, and my favorite homemade gift to give. Thanks for a great recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Judy SG"
},
"reviewBody": "Absolutely delicious - and easy to put together once everything is cut and chopped. But ... it crumbled however carefully I cut the slices - delicious crumbles but the slices would have looked better on the platter! It was necessary to make several substitutions because ingredients in original recipe are not available in my area - dried cranberries instead of currents, maraschino cherries (well-drained) instead of dried or candied cherries, dark raisins instead of white, and added some dried apricots instead of citron. Did I drizzle too much whiskey on top, or not make it far enough ahead of eating, or maybe needed a different brand or quantity of flour, or different oven temperature? Will definitely make this again but would like to do slices next time! Ideas anybody?"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Karen"
},
"reviewBody": "My husband decided he wanted to try to may a fruit cake like his mother used to make we did not have her recipe but this looked close. We tweak some of the fruit but otherwise followed the recipe. He bake the cakes then let them set overnight then he put some honey whiskey over them and let them set another night. We took one bite and could not stop eating. DECADENT...."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cindy Raymer Andrews"
},
"reviewBody": "I have made this for several years now. A stable with our family! I would be in big trouble if I didn't make it every Christmas. I wouldn't change a thing about this recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MELODY D"
},
"reviewBody": "So much better than store bought! It's my second year using this recipe and didn't change anything. Letting it sit in the fridge for at least 5 days does make taste and texture even better. Although, smelling the loaves fresh out of the oven in front of me is making it hard to resist."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Caroline Wood"
},
"reviewBody": "This cake is delicious. I did not use the alcohol."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jodi"
},
"reviewBody": "Awesome recipe!! I soaked fruit in whiskey for 3 days, then after it was baked i brushed it once a week with whiskey again, for 4 weeks. excellent flavor"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Melissa Peck Huber"
},
"reviewBody": "Just wonderful. I used all dried fruit versus any candied because I don't care for the latter. After cooling the loaves, I wrapped them in cheesecloth, brushed them with rum, and then refrigerated them in an airtight container for a week or so. Everyone loved them, adults and kids, fruitcake lovers and fruitcake haters ;). Great recipe that I will definitely make again and again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Janet Meadows"
},
"reviewBody": "I made this recipe over 5 years ago and brought it into work. It vaporized -- even people who didn't like fruitcake loved it. This is a no-fail fruit cake. \n\nI think that the 2 oz. each of candied citron and orange peel are what contribute to people liking this particular recipe. Many fruitcake recipes go heavy on the citrus.\n\nThis year I'm making it again and substituting brandy for the orange juice, and chopped apricots in place of some of the raisins. \n\nIt's important to grease your pans, and then line them with greased parchment paper.\n\nExcellent recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "soosan"
},
"reviewBody": "In 2014, my husband wanted fruit cake...but eeuuww...so I halved this recipe. Four days later I remade this recipe! Oh My!! I have used this recipe ever year since. Each year, my fruit &amp; nut ingredients vary. I always use dried fruit~today I used papaya, pineapple, apricots, cranberries, golden raisins &amp; cherries. Plus pecans &amp; walnuts. Sometimes it equals 6 cups, sometimes 7 cups. If the dried fruit is sweetened~ I use a bit less sugar. Most importantly is to beat the egg whites thoroughly. I used 3~4x8 pans &amp; 5~3x6 pans. The small pans I baked 68 minutes. The larger pans baked for 93 minutes. One of the 3x6 is already in my fizogg!! I just love this fruit cake!!\nOh, once last thing I discovered...it does not keep well in the fridge...I was soo bummed to find a couple loaves blue with mold. dang Now I keep any fruit cake in the freezer. Even taken right out of the freezer, it cuts so well. Enjoy!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Elisabeth Mills Shopp"
},
"reviewBody": "This is The Best Ever!!!!! my husband of 23 years informed me (2 years ago) that he really likes White Fruitcake and isn't very fond of dark fruitcake(my regular recipe).... go figure......this is a wonderful recipe, I even made a batch for Valentines Day!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Fiorella"
},
"reviewBody": "It's awesome! I made 2 loafs of it this past Christmas, and my family absolutely loved it, and now they are asking me for more on New Years'. I I did make a few changes thou. I soaked the candied fruit in 1 cup of orange liquor the night before ( instead of orange juice). I used gluten free flour instead of the regular \"all purpose\" one, and I replaced the sugar with splenda. Also, the butter I used was the all natural butter spread, instead of the regular. A few changes made it a little healthier, and the taste was just fabulous. Thanks for the recipe, and Happy New Years you all!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "valerie160"
},
"reviewBody": "This will be my third Christmas baking this wonderful fruitcake. It is so moist and delicious! I replace the candied fruit with dried fruit because this is the way I prefer it. The first year I went out and bought the candied fruits and candied citron and orange peel in the plastic containers and was just disguised with the way it smelled. No way I wanted to ruin a perfectly good cake (and time, effort and money) with that junk, so I replaced with dried cherries, organic raisins, currants and dried pineapples and zested some orange and Lemon peel into the batter. Just a really really good cake - I look forward to Christmas season each year because of this fruitcake!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "prasad02"
},
"reviewBody": "I made these cakes and used 3 cups of sugar instead of 4. Turned out really good. The pan of water in the oven helps keep the cake moist. Very flavorful. Thanks for the recipe"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "RoxieRae"
},
"reviewBody": "Excellent recipe. I made this as the recipe specified though I had to use some different dried fruits based on what was available locally. I sampled it shortly after baking and it was very good then but it has definitely improved with time. I have brushed with a tablespoon of brandy weekly. I highly recommend!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "limogirl"
},
"reviewBody": "This recipe is good except for one thing. It left out the flavorings. I didn't realize it until I finished, but it needs vanilla, or lemon or orange flavoring. I also used only dried fruit and soaked for 3 days in rum, drained it and put it into the mix. While I am soaking my cakes every 3 days with rum, it will still be good but really needed the flavorings to enhance it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Artha"
},
"reviewBody": "The best fruits cake I ever eat.. Basically I don't like fruits cake but after I try this recipies.... Hmmmmm yummmyyyy..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "pmatilda"
},
"reviewBody": "I made this fruitcake this past Christmas. I am from a fruitcake famly as I watched fruitcakes being made from the time I started to walk. This recipe was the best I have ever seen made or made myself. I was so moist and tender. I think it was the powdered sugar and egg whites since this is the first time I have used these two ingredients as called for in the recipe. Thanks for sharing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Susan Love-Childers"
},
"reviewBody": "This is the absolute best fruit cake I have ever eaten. Beats all store bought one too. I love fruit cake and decided to try making one myself (for the first time) Found this recipe and I followed it to the T. Made no changes at all. Thank you so much for sharing. This will definitely be added to my favorite recipes. (btw, my daughter never liked fruit cake until she had a slice of this one)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "TamLou"
},
"reviewBody": "I am one of the ones who can not stand fruit cake, but I was pleasantly surprised by this one. I am not a fan of candied or maraschino cherries so I used dried cherries instead and had to omit the pecans due to allergies. The cakes disappeared within 2 days and having to make again and will have to hide them for Christmas."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "whatscookinwithkate"
},
"reviewBody": "Totally the best! I prefer light fruitcake to dark, which isn't easy to find anymore. So, I made it last year and repeated it this year, soaking it each time in brandy - YUM. I substitute candied papaya for the cherries, just don't like those things and candied my own orange and lemon peel (easy to do) to replace the citron. Just as good with the pecans for those who have nut allergies."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Elaine C."
},
"reviewBody": "Very good. Yielded 3 loaf pans, that were done in 1 1/2 hours. A far cry from the old dark fruitcake that I used to help my mother mix up in a wash pan! (those were probably better suited for door stops). I will be adding this to my Christmas recipe file."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Alicia Coleman"
},
"reviewBody": "I have been trying to find a good recipe for white fruit cake for a long time. This one fit exactly what I wanted, however I was unable to find currants and had to sub in dates. I do believe that the writer WAY underestimated the prep time. The batter was so thick it took me forever to stir in the flour. Also it really does make 2 loaf pans and 2 small loaf pans. Be prepared to eat or give away a lot. Wonderful."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MJM"
},
"reviewBody": "Never have made a fruit cake before. Have always loved them. Decided to give it a try and I was really impressed with the way it came out. Pretty much stuck to the recipe and will make it again after the holidays and the price drops on the ingredients. I did give some to friend that didn't like fruit cake and he really liked it. Can't wait to try it on my family at Thanksgiving. After putting in the cakes in the oven and started washing dishes, I found that the end of one of my spatulas was missing....wasn't in the first cake. Guess I will find it on Thanksgiving! LOL Thanks for the Recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LB"
},
"reviewBody": "I have made this recipe for several years. I add the fruits and nuts we like best. I also soak the cakes in a little brandy for at least a month before Christmas. It always turns out well. I think what makes this cake is the beaten egg whites and the confectioners sugar, as well as the butter."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "w3leon"
},
"reviewBody": "This was my first time making a fruit cake from a recipe, all of my other attempts have been from cake mixes plus modifications. This reciepe turned out a wonderful fruit cake. Since I was giving this fruit cake as a Christmas Gift I wanted it to be a bit special, so I made an Amaretto Fruit Cake. I used Amaretto in place of Orange juice. I also added Almonds along with the Pecans. I didn't want the cake overly sweet so I used \"dried\" fruit, not \"candied\" fruit. I'll make this again along with some additional adjustments, then I'll have an Amaretto Fruit Cake Recipe that I can post.\nThanks,\nWalt"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Betty"
},
"reviewBody": "What a great cake. I had to substitute a few things because they are just not available in Costa Rica. I.e currants and I couldn't find pineapple chunks, But I just substituted equivalent amounts of what I could find. I also added some brandy. Had the cake prepped and ready to go in the oven and realized I had forgot the egg whites. Remixed the cake and baked it in the oven. The smell, the taste, it is abosolutely wonderful. It is a must on my Christmas baking."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Josephine Roeper"
},
"reviewBody": "Made 18 servings which equaled 1 loaf bread. I'll have to update my review in a week to let the fruit cake age."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "u2debb"
},
"reviewBody": "I really don't care for fruitcake but thought I would try this for my husband. OMG! It was the best fruitcake I have ever eaten! I will be making this every year from now on! This recipe is a must!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jeri10"
},
"reviewBody": "This really IS the BEST fruitcake recipe (and I've tried a LOT!) I thought I was the only person on the planet who actually enjoyed fruitcake...but I've made a lot of converts with this recipe. Try it. You'll like it.\nP.S. I made it again and accidentally used granulated sugar instead of confectioner's sugar and it still turned out fantastic (two of my friends came by asking if I had any more of that fruitcake)\nwinner, winner, winner!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cook and a half"
},
"reviewBody": "This is awesome! It is so moist and flavorful. Oh my goodness, my husband who hates all types of fruit cake has already eaten a loaf by himself. I followed the directions and it made 3 loaf pans. Delicious!! not a believer? Try it!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "HoumaHoney"
},
"reviewBody": "Made my whole family and extended family realized that we all LOVE fruitcake! everyone and their MOM asked me for the recipe. :-) thank you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Penny"
},
"reviewBody": "Easy to make and a good way to introduce kids to fruit cake!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "linder"
},
"reviewBody": "i can't thank you enough. brenda. this is the recipe my great aunt lottie used to make every christmas. i have been searching for it for years...no one in her family had the recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Anita Hampe"
},
"reviewBody": "This fruitcake was amazing! I had never made one before and was looking for a good recipe to share with my family. The small alterations I made were to bake it in a tube pan and one-loaf pan, increasing the baking time on the tube pan. I also soaked the fruit overnight using brandy instead of orange juice and wrapped the cooked cake in a brandy soaked cheesecloth, adding a bit more every couple of days, for about 2 weeks. The cake was big hit and tasted amazing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "FireGuysWife"
},
"reviewBody": "Exactly what I was looking for..and boy, was it good! Only some minor tweaks (2 1/2 cups golden raisins, 3 cups chopped pecans and no currants), and still it was fantastic. I have an extra loaf in the pantry that's been receiving a TBL of Apricot Brandy everyday for a week...can't wait to try it tonight!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Heather"
},
"reviewBody": "I've substituted a few different fruits in this and it's great. I used orange juice the first time, but I think this time I will try rum. ;)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Paula"
},
"reviewBody": "This is an very LARGE recipe. I ended up with 5 loaves but I measured the ingredients chopped not whole and that may have made the difference. I followed the recipe exactly except for the orange peel which I couldn't find. Lovely, I will definitely make this recipe again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "maddie"
},
"reviewBody": "Picked this fruitcake recipe randomly and was very nervous about making it. FANTASTIC! It is moist, full of fruit and just plain delicious! It has taken me over 30 some years to get the nerve to try and make fruitcake and I really hit a winner! Thank you."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Elby"
},
"reviewBody": "well this is the best!! Soo good. I soaked the fruit over night in 1/2 cup Jameson and still added the OJ when I made the cake... the fruit absorbed all the Jameson. Then I let it stand for 2 weeks and once a week gave it a soaking of more jameson. It mellowed out tremendously and had such a wonderful flavor not an alcohol flavor and was not at all dry. simply the best!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kellidd"
},
"reviewBody": "I got this recipe a couple of weeks ago and since I have always liked fruit cake pretty well, this one, with the real sugar and no spices seemed to fit my tastes perfectly! I got the fruits I like and soaked them overnight. Put the pan of water in the over and baked 10 mini loaf pans full. I cooked at the designated temp but for one hour and they all came out perfectly. In fact, I had so much fruit and nuts, I baked 3 batches. Now my husband and I have nice gifts to give our employees and still have some for our family and friends. I will age them in the fridge for a week or two and they should be perfect! Thanks so much for the great recipe!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "honey chile"
},
"reviewBody": "I'm not big on fruitcake but my boyfriend has been asking me to make one for ages... so glad I did! I cut down on the sugar by 3/4 of a cup because I don't like too sweet things. I think this would keep as well as traditional fruitcake but there's never enough left for me to test that! My custom version will be posted soon"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BLUEICE"
},
"reviewBody": "Delicious. This has got to be the best fruit cake I have ever made. A fair amount of work but worth it. Hubby loves fruitcake and thought this was one of the best. I followed the recipe exactly only leaving out the currents. I dont know what the hot water in the oven while cooking does, but it sure was moist. I am so happy I picked this recipe to do."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "neha224"
},
"reviewBody": "omg i made this cake for my mom's birthday because she loves fruit cakes but was hesitant at first since no one else likes fruit cakes. i made it anyway and it was amazing. event he non eaters fell right in love with it and i made it again today and only thing i changed was that i put half the sugar because the candied fruits add quite a bit of sweetness already and it still turned out great. this recipe is definitely a keeper :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kieria"
},
"reviewBody": "I thought I hated fruit cake until I tried this recipe! I made it because my husband is one of those few people who say they like fruit cake and since i really dislike alcohol soaked desserts I made this recipe as a compromise to suit both our tastes and we both LOVE it! I do have to sub various dried fruits in place of the candied fruit because I cannot find it in our small town."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mis Roz"
},
"reviewBody": "I am a new fruitcake lover after I made this recipe and modified it by using less of the golden raisins and pineapple, and no currants nor citron. I added dates, dried cranberries, mixed candied fruit and dried apricots. I also added 1/2 cup of dark rum along with the orange juice and after the cakes were baked and cooled I poured about 1/4 cup more rum over each loaf before storing in airtight container. YUM! What a hit for all my friends and family!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "thisgurlluvs2cook"
},
"reviewBody": "Very tasty fruitcake. I made these for gifts. I bought a large container of already chopped candied fruit that had pineapple, lemon, orange, and cherries in it. Couldn't find currants, as they were all sold out. Soaked the fruit in the OJ and the golden raisins in rum. It's time consuming, but worth it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ebelisle"
},
"reviewBody": "It's true this is the best fruit cake. doesn't make to many loaves. The only difference I did since I couldn't find the candied orange and pineapple I used 2 small containers of citrus peel and 1 large container of chopped cherries worked out just fine but be careful when chopping the pecans don't over whiz them in the processor makes it to fine"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Adri"
},
"reviewBody": "This is WONDERFUL! I personally hate all baked fruit, but this is the exception! I made if for a bakesale, and had to make another batch for myself! It's really easy to substitute the dried fruits. The orange juice gives it a real tangy flavor that is delicious. If you don't have time to let the fruit and orange juice sit overnight, put it the fruit in the microwave with the orange juice for about 5 minutes. (I put mine in a shallow pan in the bottom of the oven while I was pre-heating and mixing the rest of it...) All in all, it's a really light, delicious version of fruit cake, that is easy to customize!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tallguysmom"
},
"reviewBody": "I have made this cake for years. I usually cook mine in October. My recipe calls for this cake to be wrapped in wax paper and then foil and placed in the fridge until Christmas. I have found this makes the flavor develop and a more moist cake. It should not be called a fruit cake. Delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kitchenfire"
},
"reviewBody": "This is a great recipe. I used a mix of golden dried fruit macerated in spiced rum and no nuts. I also found this cake to require some aging, preferably with a good rum bath. Fantastic fruit cake for lovers and non-lovers alike."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DEANISUE"
},
"reviewBody": "Yummy! \n\nI decided to go ahead and review it even with my changes because it was so forgiving! I forgot my list so had to guess on the candied fruits - ended up not buying enough pineapple or any currants. So I doubled the candied orange peel (to sub for some of the pineapple) and used dried blueberries and extra raisins for the currants. I also used less nuts because I didn't buy enough. I microwaved the fruit with the OJ as a previous reviewer mentioned but I forget to let it cool before adding it to the butter mixture. Didn't seem to make a difference! I also didn't whip the egg whites quite enough...I have a Kitchen Aid and the bowl was already dirty from the butter/sugar/yolk mixture. It still came out great. The flavor is almost like a sugar cookie - but with the dried and candied fruits!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BakingBot"
},
"reviewBody": "Especially good toasted, if you like fruit cake."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kerish"
},
"reviewBody": "This recipe is perfect but I always make my own changes...LOL I soaked the raisins in scotch for 5 days.I then reserve the scotch to use to feed my finished fruit cake.I added orange extract and some allspice for a lil more flavor.I still added the orange juice to the mix along with the fruits as the original recipe required."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Karen"
},
"reviewBody": "This is the best fruit cake I've ever tasted--including those expensive ones made by the monks. Simply fabulous!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "trysch"
},
"reviewBody": "This recipe is WONDERFUL! Everyone loved it. I tweaked by soaking the fruit in 8 oz. of triple sec and 8 oz. of orange juice. Amazing texture. It gives fruitcake a good name!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jwatson"
},
"reviewBody": "I made this cake as my \"Main\" Christmas dessert this past Christmas and I was VERY VERY pleased with the results! I only made a couple changes, and none of those being fundamental. I used whiskey in place of the orange juice and I used less candied fruit and more dried fruits like dates and apricots and dried pineapple not candied. I also poured 1/4 cup whiskey over top before setting aside on the cold backporch to age a little. Everyone loved it..even my husband who is not a fruitcake person. I will make again and again. This is now my fruitcake recipe that I will use. Next year I will probably only use dried fruits and no candied. It makes for a more real flavor. Thank you for this recipe!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "grannynanny"
},
"reviewBody": "Wonderful recipe. Made several times and gave as gifts. I had nothing but rave reviews from all..Will certainly do this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Wanderer"
},
"reviewBody": "This recipe is really easy to work with. I had to substitute a number of the fruits and the pecans for other fruits and nuts and it still came out looking great! The dough is very thick however, so be forwarned! I also baked it in a couple of bread pans and then since I didn't have three chose to make muffins out of the rest of the dough. I think they'll look great on my Christmas cookie trays (and will probably fool some people into trying them). \nI made mini-muffins which baked for about 22min. and regular muffin size which baked for about 30min. Personally, next time I will fill the mini-muffin tins fuller next time as they don't really rise and grease the top of the tin as well as the cups. Otherwise it turned out wonderfully. \nKeep in mind that fruitcakes should be completely cooled in their tins to retain moisture (which somebody had told me just a little earlier)."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mommy"
},
"reviewBody": "I'd tried this one, it's so good especially when let it set for 5-7 days in the fridge. I think next time I will cut out some sugar because it is a bit too sweet for my taste. I use more portion of preserved mandarin orange, and orange flavor and color showed beautifully.Thank you for sharing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CENOTES"
},
"reviewBody": "You are right, this recipe converted me! I have never made a fruit cake, this was my first and last. BEST FRUITCAKE EVER!!!! I used the mixed candied fruit and raisins and nuts only, because I just don't care for cherries and pineapples so I tweaked for my taste and it was AWESOME! Thanks"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kara Shawcroft Ireland"
},
"reviewBody": "I followed the recipe to a 'T' and it turned out fantastically. I'm not a huge fruit cake fan but I loved it as did my family. I recommend this recipe to anybody and everybody."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "STEPH577"
},
"reviewBody": "This is a great recipe for white fruitcake. I have been looking for a good white fruitcake recipe, and this is definitley the one! Will make again every year!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Chuck"
},
"reviewBody": "This Cake is way better than other fruit cakes I had and this one is the bomb and it's increbibly good!!!!!!!!!\\\nThis a 5 Star Cake *****"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "AUSSIEBEAR"
},
"reviewBody": "I really dislike tweaking recipes before trying them but i had a few problems getting all the necessary ingredients, so i had to substitute pecans for mixed nuts (mostly peanuts it turns out) and a tropicla fruit mix for pineapple. I also couldn't be bothered to wait for the fruit over night so i put it in the microwave for 8 minutes and this did the trick. Instead of using loaf pans i made a round one, and it is absolutely huge, everyone is very impressed! I havn't tried it as i've only just started feeding it, but it turned out fantastically, although it needs 3 hrs cooking this way. Thank you so much! We don't like dark fruit cake in our house, but this balance as almost....well you could say, saved christmas :D"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/9319/white-fruit-cake/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/276/desserts/cakes/",
"name": "Cakes"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/391/desserts/cakes/fruitcake/",
"name": "Fruitcake Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/9319/white-fruit-cake/",
"name": "White Fruitcake"
}
}
]
}
}
, "about": [
]
}
]