				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Whole Wheat Pasta"
,"datePublished": "2018-03-21T12:37:05.000-04:00"
,"dateModified": "2018-03-21T12:37:05.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Gia"
,"url": "https://www.allrecipes.com/cook/gia"
}
]
,"description": "Fresh, healthy and very delish... I sometimes make this the traditional style, and when in a hurry, I throw all the ingredients into my mixer with the kneading hook."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/MzIBfTlCciYdPGsWeULqKUDpAdk=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/429728-3af10068876c48dba661a9bdf0d6f312.jpg",
"height": 960,
"width": 960
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Whole Wheat Pasta"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.2",
"ratingCount": "105"
}
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "416 kcal"
,"carbohydrateContent": "69 g"
,"cholesterolContent": "186 mg"
,"fiberContent": "7 g"
,"proteinContent": "17 g"
,"saturatedFatContent": "2 g"
,"sodiumContent": "293 mg"
,"sugarContent": "1 g"
,"fatContent": "9 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT40M"
,"recipeIngredient": [
"1.5 cups all-purpose flour",
"1.5 cups whole wheat flour",
"0.5 teaspoon sea salt",
"4 eggs",
"2 teaspoons olive oil" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Stir together the all-purpose flour, whole wheat flour and salt in a medium bowl, or on a clean board. Make a hollow in the center, and pour in the olive oil. Break eggs into it one at a time, while mixing quickly with a fork until the dough is wet enough to come together. Knead on a lightly floured surface until the dough is stiff and elastic. Cover, and let stand for 30 minutes to relax."
} ,{
"@type": "HowToStep"
,"text": "Roll out dough by hand with a rolling pin, or use a pasta machine to achieve the desired thickness of noodles. Cut into desired width and shapes. Allow the pasta to air dry for at least 15 minutes to avoid having it clump together."
} ]
,"recipeYield": ["4"]
,"totalTime": "PT40M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jeremy Drescher"
},
"reviewBody": "Great recipe! I'm teaching my kids how to create their own food, and this recipe was a perfect addition. Daddy's kitchen is a happy kitchen!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Bonnie Valentine"
},
"reviewBody": "Made 1/2 recipe. Definitely had to add a little bit of water and more oil than what it calls for. Easy to handle dough, good flavor. I had problems with the fettuccine sticking to itself, but that may have been my technique and not the fault of the recipe, as I don't have a pasta drying rack yet."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "waldo"
},
"reviewBody": "Recipe is GREAT. I ONLY ADDED ALMONDS, because I like the crunch. Really easy to make!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Weekend cook"
},
"reviewBody": "This pasta was never going to come together using the recipe as posted. Gia, the original poster, updated the post - in 2004! - to include the right amount of liquids (water, olive oil). I don't understand why the recipe hasn't been updated on the website. You have to go looking through reviews to discover that the recipe is wrong, which I did only after getting frustrated and feeling like I was wasting my time, ingredients and money."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jtfranklin"
},
"reviewBody": "5 Stars with following Gia's review and edited recipe (Gia is who created the recipe). I also added 1/2 tsp dried basil and 1/4 tsp garlic powder for more flavor &amp; fun!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "KRANEY"
},
"reviewBody": "I think this was good, but with a few adjustments: 1 1/2 Tbl. water and 1 Tbl. oil instead of 2 tsp."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bootsie Ardito"
},
"reviewBody": "I only had tiny eggs (pullets-new layers) so had to use 5 eggs, mixed it up in my kitchen aid. It did take a couple tablespoons of water to get the dough going. Not unexpected as I live in dry Arizona. After the rest period it went through my pasta roller without any problems. Noodles cooked up fast and were super tasty :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Light Fury"
},
"reviewBody": "Amazing. I made it and put it in my Chinese Soup. Perfect flavor and texture."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "lolita21"
},
"reviewBody": "I have to agree with the previous reviewers regarding adding water. I added about 4-5 tablespoons and it worked out great. Everyone loved it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Glenda"
},
"reviewBody": "Added extra egg and it was great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Casey B"
},
"reviewBody": "This recipe needs additional water/eggs/something. I mixed the ingredients as described, and it wouldn't come together (too much flour). I threw in some water, but I did so too late, and the dough was so glutonized and stiff (even after letting the dough rest) that my pasta machine was useless, and I had to throw the dough away. The night was saved by throwing the kids in the car and hitting a restaurant."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Jo Ann"
},
"reviewBody": "This didn't turn out at all for me. It was way too dry. I ended up adding another egg yolk, as per Anne's recipe as well as more olive oil and water. It still wasn't coming together so I ended up adding the egg white and then it finally turned into a dough I could use."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "AmyM"
},
"reviewBody": "I made this tonight and it was delicious. I had to add a bit of water to the dough to get it to form a ball. I loved this dish and ate seconds and thirds."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jessica"
},
"reviewBody": "This was delicious! I read Gina's review with her tips for the water and olive oil that were missing and went with that. I'm also trying to experiment with whole grains, so I substituted all the flour with Bob's Red Mill stone ground whole wheat pastry flour. I think that may have been the perfect flour choice. It rolled out beautifully; they were nice and thin. I threw a little leftover Alfredo sauce on them and wow! I will be making all of my pasta this way in the future."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "lazydazy"
},
"reviewBody": "First try at making pasta but it was delicious. I added some olive oil to make it workable and put it thru a fettuccine extruder. It was a little ragged looking on the edges so maybe a bit dry but it cooked up just fine."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Yvette Purcell"
},
"reviewBody": "I have never made pasta noodles. I received a pasta maker for Christmas so I needed a recipe for the noodles. They cam out perfect. I hand mix the dough when most of the flour was gone it seemed like it wasn't going to work so I opened the dough and it allowed me to get the rest of flour and worked perfet. Easy recipe"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sof-spot"
},
"reviewBody": "Followed recipe. I make this 3x per week, excellent, healthy recipes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DORY"
},
"reviewBody": "Very easy to make with my mixer and dough hook. This recipe requires lot more water and I also added more olive oil. My family loves the pasta and I only wish I had a pasta maker!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "HurdBird"
},
"reviewBody": "Following the recipe as written, it was waaay too dry! After adding some water, this pasta turned out great! I was so proud that I made fresh pasta, but it was so much easier than I thought it would be!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "akahriz"
},
"reviewBody": "Tried this and it came out very well"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Timbo UK"
},
"reviewBody": "Good recipe tasted lovely but need to read the comments to see that the amounts of water and oil included are incorrect. Amounts made are generous!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "one_eyed_chef"
},
"reviewBody": "Great! I added parsley, basil, garlic powder and dill, plus an extra couple drops of olive oil. Yummy! Perfect form my salmon pasta salad."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "hopemccoy"
},
"reviewBody": "This recipe needs to be revised as one ingredient, water, was obviously overlooked. I followed this recipe in my KA and had crumbs swirling for a couple minutes and I knew it wouldn't pull together, so I gradually added about 1/4 c of water and it formed nicely into a smooth ball. The dough rolled out nicely and cooked up delicious. Pinned with revisions :-)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "WildWaysPaige"
},
"reviewBody": "made it in my antique pasta machine and it came out perfect! The taste is so much better than dried store bought pasta."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Debbie Edmondson Nance"
},
"reviewBody": "great recipe I love making home made pasta and so does my grand daughter we have a ball making pasta and she enjoys eating it to we make all kinds of different shapes and with even hand cut some with is funny to me you do not need to use your pasta maker for everything your hands are your best tools give the kid's a butter knife and go to town make it your own that why people know it is homemade when it is all different so enjoy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "pomplemousse"
},
"reviewBody": "I've only made pasta twice before this, once with my sister in law who did most of the rolling, and second with hubs, who again did most of the rolling, so I'll admit I have no idea what I'm doing. So any problems I experienced are more than likely due to my lack of experience with pasta making. I used the KA for all of the steps. This dough is very difficult to knead (don't forget the humidity where you live affects this greatly, so who knows what someone else may experience) and I did have to add water; however, I believe I added too much because it ended up being too sticky. Since I'm an experienced bread baker and bread dough can still be used when pretty sticky, I wrongly assumed the same for pasta dough. Nope, not so much. If you have to add water, do it, but you should add very slowly and may have to add flour back in like we had to do for our pasta dough. I gave up, put it back in the fridge for a day or so, then brought it out and tried it today. I had to add flour back in until the dough was slightly sticky, then push it through the flat pasta attachment, then put in the fettuccine maker. It took lots of trial and error, but now I'm feeling a bit more confident about pasta making, and I believe I will have more success this time! I made loads of this recipe, so am freezing some. It works out to a thick (well, that could just be me!), full bodied noodle. Tastes good. Thanks for the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Michael Beatty"
},
"reviewBody": "The dough this recipe is much harder to work with than it needs to be. There are much better recipes out there."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "FIRECOOKIE02"
},
"reviewBody": "Handmade Pasta is a art all in its self. You need to use the right size eggs (I use extra large) and be sure to measure out your flour, as for the folks that say their pasta never came together, you need to know that you may need to add a bit of water, just like making any bread type recipe, moisture is a key. Too much and you get slpooy mess, too little and your get dry tough dough. This recipe is very good, the only thing I have done differently is use less salt and more wheat flour and less white flour."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Chuckles722"
},
"reviewBody": "I used my hands to mix/ knead the dough and after adding about 3-4Tbsp of water it was perfect. I rolled it too thick and next time I will roll till paper thin before I cut. Very nutty tasting and next time I'll use a pesto sauce. Fun, easy recipe- I think I might even add a tsp of sugar next time and it would be great with just olive oil."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Michelle Marckwordt- Lowery"
},
"reviewBody": "I dont know what I did wrong, but this was a disaster for me."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "D2hill"
},
"reviewBody": "Very delicious pasta. My wife was a little nervous of me making pasta but decided it was very tasty. The only thing I did was add a few teaspoons of water to get it to come together."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Good Eats"
},
"reviewBody": "Easy to make. I grind my own wheat berries for the whole wheat flour. I add a little water while mixing and kneading. Then running it through the pasta maker is great. The family loves the spagetti!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Pris"
},
"reviewBody": "The mix was too dry to come together. I added 1/3 cup water."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Stephen M Riley"
},
"reviewBody": "Excellent basic/base pasta recipe. This recipe can be changed easily, but taking out the oil and adding spinach, sun dried tomatoes or chopped basil."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Mike DeBoer"
},
"reviewBody": "I tried it twice the same night and ended up making store bought spaghetti in the end but at least I had two dough bookends."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nick"
},
"reviewBody": "Very good recipe! Like others I need to add water when kneading, but the end result was terrific."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "laurendfilm"
},
"reviewBody": "The flavor of this pasta is awesome! Delicious and nutty and definitely way better than the store bought stuff. However, the dough is such a pain in the tush to work with that I almost didn't get to the tasting part, which is what earned it the 2 stars. I followed the recipe exactly, but like many other reviewers, found nothing but crumbles in my kitchen aid, so I added 2 tbs of water, then 1 tbs of oil, then another egg, then another tbs of oil, then another tbs of water. It finally came together, and i kneeded for about about another 3 minutes by hand, put it in the fridge for 2 hours, but when I took it out to put it through the pasta press, it was WAY too dry. I had to split it in 4's, literally run it under the tap to add more water, and put it back in the fridge overnight. When i took it out tonight, it kept creating holes when I ran it through the pasta sheeter, so i had to sheet it in VERY small portions, going from 1 -5, then line those pressed portions (pressed to 5) up into an appropriate pasta length and run it through again at 5 a few times to create one sheet of noodle length. It was a giant pain in the butt. I cooked it for about 2 minutes for a good al dente bite, and served it with homemade ox tail bolognese and Parmesan cheese. It holds up really nicely to the sauce and has a great flavor - definitely not cardboardy like store bought whole wheat pasta, but be prepared to WORK if you're going to make this recipe, even if you do use a stand mixer."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kathie"
},
"reviewBody": "I am not a fan of commercial whole wheat pasta (flavor is similar to cardboard, in my opinion.) So I was anxious to try this after reading the reviews!! AMAZING!! I substituted white whole wheat flour for traditional whole wheat -- the results were spectacular!! I mixed and kneaded in my Kitchenaid with the dough hook -- dough was smooth and supple! We will definitely be using this recipe again!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "africangie"
},
"reviewBody": "Great recipe. Added a bit of water per others' recommendation. Turned out great both in fettuccini and lasagna. Thx!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "vickie"
},
"reviewBody": "This is a great tasting whole wheat pasta recipe. It has a great texture that really holds onto sauce. I used my Kitchenaid mixer to make the dough, let is stand as noted for 30 minutes and then used the Kitchenaid pasta plates for forming pasta. As others noted, I also had to add a few tablespoons of water to the dough to get to the correct texture. My kids and husband really loved this pasta and it will become a staple recipe in our house. Thanks for sharing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tanya Ellison"
},
"reviewBody": "Great whole wheat pasta recipe! I mixed mine in my stand mixer with a dough hook and rolled it with pasta roller attachments and it was very easy. I have made pasta by hand before, but the rolling is very tedious because the dough is so elastic... you can mix the dough by hand but at least need a hand crank machine (for your sanity) to do the rolling I think. As other reviewers stated, there did not seem to be enough moisture in the recipe. Adding one more egg and ~1 tbsp of water helped it come together into a smooth, elastic dough."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DarcieA"
},
"reviewBody": "I absolutely love whole wheat pasta- the flavor is more complex than pasta using just AP flour. We really enjoyed these noodles with a simple marinara sauce, however, I think it would be good with some Italian sausage in the mix, too :) As other reviewers said, I did need to add just a little bit of water for my dough to hold together well. I also up-ed the salt to 1 tsp. and the olive oil to 1 Tbsp. just based on personal taste. Thought this was a great recipe and will use it again- thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Fantastic! This dough worked perfectly for my portobello and sundried tomato with goat cheese raviolis. I even froze it for a while and still, the flavour was wonderful. Could hardly tell it was whole wheat (not a fan usually) and will make this again. Thank you so much! Oh and BTW, you can easily make this in a food processor which takes all the work out of the process."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Missy"
},
"reviewBody": "I've never handmade pasta before so this was eye opening. I originally planned on making lasagna noodles but had so much dough leftover that I made lasagna as well as small egg noodles and both came out very well. The only complaint I have is that I did have to add extra water to the recipe and even then it was a very tough dough to knead not to mention roll out hithin enough for good noodles. All in all, though, the work was well worth it as the noodles came out quite well and definitely easier to cook than dry noodles! I will definitely be using this again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mizcox"
},
"reviewBody": "I loved the flavor of the pasta. I had to add just a little bit more water than the recipe called for, but be careful and don't add too much! The more you work the dough the more moist it will become!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "phyl32"
},
"reviewBody": "I MADE THIS TODAY. IT IS WONDERFUL. I DID ADD ANOTHER EGG. THERE WAS NOT ENOUGH MOISTURE BUT THEN IT WAS FINE. I USED MY PASTA MACHINE FOR THE FIRST TIME . IT WAS FUN MAKING IT AND IT TASTED REALLY GOOD. I MADE CHICKEN SOUP AND PUT THESE NOODLES IN IT. GREAT. PHYL32"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Judy"
},
"reviewBody": "I couldn't get the dought to come together, no matter how long I worked at it. Then I checked a package of store bought whole wheat noodles and found this receipe has: 8.6 g. fat, store: 3 g. this recipe:Cholesterol 212 mg, store: 5.5 mg, this recipe: Sodium293 mg, store:15 mg. That is just too signficant."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "AdicaArethusa"
},
"reviewBody": "This was excellent! I made it in my KitchenAid mixer according to the first review (the poster of the recipe), and it turned out great! I did have to add a few extra tablespoons of water to make the dough form, but that's not unusual for bread-like dough. My uncle who makes homemade ravioli every year says that it's crucial to let the dough sit for at least an hour before rolling, ideally overnight. I would also say that, depending on how thick your noodles are, the recipe makes 4 very generous servings. I was worried I wouldn't have enough for 5 people, so I doubled it, and that is too much (though now I have lots of yummy leftovers, so no real loss). I will definitely make this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bob in Houston"
},
"reviewBody": "This recipe makes great pasta and couldn't be easier. I had to add a little bit of water, but I think that because I made it on a cold day and my forced-air gas heater was running, drying out the air. This will now be my go-to pasta recipe. Family loved it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CookingMonster"
},
"reviewBody": "I truly needed to make no modifications to this recipe. (Although I did use all whole wheat instead of half and half) I know it's tempting to add water, but just be patient and work it in well with your hands. It will soften up eventually. This recipe makes an awesome pasta."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jenni22"
},
"reviewBody": "I grind my own whole wheat flour so I just used that kind. I also had to add a little water. I have never made noodles before, I mixed the dough in a stand mixer then used a noodle roller and OH MY GOODNESS these are GOOD! I just put some butter and salt on them and the whole process took less than 15 minutes! The longest part was peeling them apart out of the noodle roller. Would also work to roll it out and cut them, and probably wouldn't take much more time. Well off to finish the last half of the batch, I was just so excited to rate this! Thank you for the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "jules6866"
},
"reviewBody": "Pasta was too dry, had to add an additional egg and some water to even get it close to the recommended consistency. Use a different recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Clint Chapel"
},
"reviewBody": "Very good pasta."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "caroline f"
},
"reviewBody": "I used 3 cups of white whole wheat, 4 eggs PLUS 1 yolk and added 2 TBS of water in addition to the olive oil and salt. I mixed it with the dough hook on my kitchen aide stand mixer. Then, I rolled it by hand and cut out for ravioli's. It turned out great. It really wasn't killer to roll by hand. Though it does have me wanting the machine now. This is totally superior to store bought whole wheat pasta. I wouldn't have guessed such a difference. Tip: if you are hand rolling pasta once you get a little length on your dough hang it half off the counter while rolling. That way you are over the part you are working on and it stretches a little too."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Eric Olivencia"
},
"reviewBody": "I would give it five stars but it needed more water. I mixed the dough in my food processor for it to look all crumbly. It was my first time so I took it out and kneaded it into a ball. The dough was tough and was really hard to roll out by hand. After I boiled it unlike other fresh pastas I've tried it took a very long time to boiled over 6 minutes and was still undercooked. Tasted awesome still. Next time Ill add more water"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Justina Schneeweis"
},
"reviewBody": "The only key ingredients to pasta are flour and eggs. If you have those two things the outcome is entirely up to you. Throw the salt and oil in if you feel like it. But do yourself a favor and research pasta making techniques before you begin. Don't use A/P flour unless you have to. My best batches have all been with bread flour. Or, for REAL pasta, use semolina. Dont' worry about using all the flour. If you have way too much flour, add another egg - not water. Let the dough rest a full hour, not half. Kneading for a smooth, silky, elastic dough, and resting for the FULL HOUR are vital. It's all about feeling it out, and having fun with it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SavedByGrace"
},
"reviewBody": "Perfect! I halved the recipe and had to add 1 1/2 TBS water to make the dough come together. I'm very excited to have leftovers tonight! :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Nicole Mullins"
},
"reviewBody": "Great recipe...very simple! I tossed everything in my kitchen aid mixer added a little extra olive oil and a couple teaspoons of water...turned out perfectly. I used meyer lemon olive oil....gives it a great flavor. I served with with broiled lemon garlic mahi mahi. YUM!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Rachel"
},
"reviewBody": "very nice, but if you roll it out by hand, you have quite a bit of work ahead of you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Breanna"
},
"reviewBody": "I had to add a few TBSPs of water in and knead the heck out of it, but it worked wonderfully in my pasta press! It tasted great too!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "2kids4me"
},
"reviewBody": "These are very good. I make 1/2 a batch for a pot of homemade chicken soup. I used 1/2 of that and am freezing the rest of them for next time. Others are right, this recipe makes a ton! I substitued Egg Beaters for the eggs to make this even more healthy, they are very tasty!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Regina Barnett"
},
"reviewBody": "very good..eacy recipe"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Amanda Gary Smith"
},
"reviewBody": "Tasted great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Tasted great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mewillandale"
},
"reviewBody": "This is a great whole wheat recipe. Just like some other people, I had to add a little bit of water. I highly recommend sifting the whole wheat flour. Your pasta will be grainy without sifting."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ruth"
},
"reviewBody": "This is an awesome recipe! I had to add a few teaspoons of water so I was able to knead the dough. This recipe is so worth the time it takes!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kathleen Suzanne Lindley"
},
"reviewBody": "I tried making this in the stand mixer...I'll try the food processor next time but after adding a little more olive oil (about 1 tbs) and (about 1-1/2 Tbs water) to make it more pliable for me..I let it rest and then finished kneading with the crank pasta maker...it was like playing with PlayDo...it cooked wonderfully and even my husband liked it..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mel Mella"
},
"reviewBody": "My tried this recipe with additions and it came out great. I used the basic recipe and added fresh spices,(1/2 cup)and 2 cloves of garlic chopped. I a food processer and let the processer chop up the spices and garlic. Added some water to get it to stick together. I used my pasta machine to finish the kneeding and cut into fettucini. It smelled so good during the kneeding that I cooked a little right away for a snack with butter only. It was wonderful."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "DELANIA"
},
"reviewBody": "Impossible to do by hand as posted. We tried adding water, but it was just too dry and thick. I think we'll just try adding whole wheat flour to our regular pasta recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "NewGasCookah"
},
"reviewBody": "Mine was too thick - you definately need a good drying space and a roller to make them turn out perfect. I was just impressed I could make pasta. Great recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mel Kalashnikova"
},
"reviewBody": "Turned out exceptional. Good consistency, did not stick, did not break. Good taste. Moisture content was fine for me. Extremely tough dough by design-- I would not suggest anyone attempt this by hand unless they are on steroids ;) I used a bread maker and a pasta roller device."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Heather"
},
"reviewBody": "I'm pretty good in the kitchen and I had a horrible time with these. The dough needed much more liquid than the recipe calls for. I still couldn't get it to a consistency that was good for rolling. Even after adding almost a cup of water I still couldn't get the dough to roll thin. I used a rolling pin, my hands, etc. and it would not budge. Consequently my noodles were on the thick side and it took a long time to cook them. Once they were cooked they didn't even taste very good. These noodles were edible but I certainly won't make them again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "TMMEZZA"
},
"reviewBody": "this sounds great, has anyone made fresh pasta for a baked dish like manicotti? I'm not sure if I'd have to boil the shells first and then fill them, or just fill them and bake. I usually use the no-boil shells but I want to use a whole wheat and fresh pasta is so much better than dried."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "elstilez"
},
"reviewBody": "this was my first time making homemade pasta and i don't have a pasta machine or a mixer so it was all me baby!! and it wasn't really thaaaat hard. the worst was how long it took to unroll the noodles after i cut them (i rolled the dough and sliced to desired width). i had to add a bit of water to get the dough to stick together in the beginning. i halved the recipe and it was perfect for 2. my boyfriend even loved the noodles, and he was really skeptical.. :P thanks!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MOM2K&A"
},
"reviewBody": "Excellent recipe. Used mixer and pasta machine, quick and much tastier than dry pasta. Had to add water to mine, depends on the amount of humidity."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Breached"
},
"reviewBody": "Excellent recipe. \nIt was probably due to the relative humidity where I am (winter in the prairies up north) and also due to the technique I was using for kneading the dough (stand mixer), but I found that this recipe didn't even come close to having enough moisture, I probably added about an additional quarter cup of water until I got the consistency I was looking for. I bake a lot of bread, so my wheat was all pretty \"fresh\", and hasn't been sitting on the shelf for years, so that can be ruled out. I could have probably made due with much less moisture if I was kneading by hand (I tried that only once.....). \nIt wasn't until I added that extra moisture that I got a ball of dough instead of crumbs swirling around in the bowl, like some of the other reviewers described. I kneaded it for at least 5 minutes (probably more), I mean why not, it's not like I'm doing it by hand right, leaving a nice spring in the mouth feel of this. \nI really appreciate that this recipe uses ingredients I always have in my pantry. \nIf you are wondering wether or not this is a pasta recipe you want to try, go for it, it's definitely one that I've added to my repertoire."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "NuJoi"
},
"reviewBody": "This is a killer recipe! I loved it so much, I wrote about it on my blog:\nhttp://nujoikitchendiary.blogspot.com/2008/01/channeling-lidia.html\n\nI used a KA stand mixer for mixing, rolling and cutting. Use the paddle attachements to bring the ingredients together. If it isn't coming together properly, add a little water. I used a spray bottle, but you can also use a spoon to sprinkle it on top of the dough. Be careful to add too much water. As you roll the pasta dough, the flour becomes more hydrated, so just be patient. (I know that's easier said than done.)\n\nThe cooked noodles were not heavy at all. They were silky, but had a little texture and had a good nutty flavor from the whole wheat flour.\n\nPlease try this recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BradyMSU"
},
"reviewBody": "This is an excellent and very balanced recipe for homemade pasta. It is not necessary to add extra water or egg. Pasta often does not seem to come together at first, but becomes stickier as you kneed it allowing it to absorb the extra flour."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Karin Atkinson Carr"
},
"reviewBody": "Nice coarse texture with the wheat flour, which I liked. I did it by hand and yes, it was hard to knead! I also had to add water to get it to stick together. It never even occurred to me to use my KitchenAid mixer!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jess"
},
"reviewBody": "Good, but if you don't have a pasta machine, it's a lot of work"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "lillauren"
},
"reviewBody": "This was very time consuming. It was my first time making pasta, but it was very hard to roll out if you don't have a pasta machine. Over all it tasted great with pesto, parmesean cheese, and asparagus."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kathleen Lizotte"
},
"reviewBody": "By simply following the recipe, this dough was never going to come together. I had to add water to it before it would stay together enough for me knead it. After that, it was all uphill. It came together very nicely, rolled out beautifully through my pasta maker and was delicious mixed with asparagus, mushrooms and shrimp."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kirsten Johnson Chou"
},
"reviewBody": "I changed the recipe to serve six although the original recipe would have served my family of six just fine, it made a lot of pasta. I mixed it in my mixer and the dough wasn't coming together. After adding a little water with no difference I finally added another egg. That would have been like adding a half of an egg to the original recipe. I kneaded by hand since my mixer just pushes pasta dough around the bowl. I didn't find the kneading too hard and I got a nice elastic dough after about five minutes and continued to knead for a few minutes after that. I should have split my dough in half because I could not roll it thin enough. I cut it by hand with a pizza cutter and it cut easily. The end product came out very tasty even though it was kinda thick. However, towards the end of my plate when the pasta had cooled off it started tasting very doughy. I think this is just because I couldn't get it thin enough. I will definately make this again. I'll have to try the original recipe and see if I still have to alter it. I used stone ground whole wheat which may also have made a slight difference. My kids all loved it right away, but nobody wanted the seconds after it cooled. I think this would make great dumplings or noodles for soup too."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "HANSENJK"
},
"reviewBody": "If you have a stand mixer with a dough hook and a pasta roller machine, then by all means, try this pasta! The taste is excellent. If you don't, then brace yourself for some sore arms and a stiff back....this dough is brutal!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I kneaded it all by hand and had to add a tablespoon or two of water to be able to work with it. I also subsituted 3 T. of the all purpose flour for soy protein. Great tasting!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "this is so good!! I added all the ingredients into my stand mixer, then used my pasta roller, I had the best pasta, that I ever made... I will make this often!! my family begged for more! thanks gigi!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Gia"
},
"reviewBody": "I am the original poster of this recipe, for whatever reason the recipe was changed a bit. The recipe that I submitted had an additional 1 - 2 Tablespoons of water and the olive oil should be 2 Tablespoons as well. I make this using my kitchenaid mixer along with the kitchenaid pasta attachment. Just throw everything in the bowl and knead until it comes together. I then hand knead it for a minute or so, then I rub the dough ball with olive oil, cover with plastic, and let it rest 30 mins to 1 hour before I roll it out. I hope this helps."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/72525/whole-wheat-pasta/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/95/pasta-and-noodles/",
"name": "Pasta and Noodles"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/530/pasta-and-noodles/noodles/",
"name": "Noodle Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/72525/whole-wheat-pasta/",
"name": "Whole Wheat Pasta"
}
}
]
}
}
, "about": [
]
}
]