				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Whoopie Pies VII"
,"datePublished": "2000-04-20T10:01:18.000-04:00"
,"dateModified": "2022-07-14T17:15:26.000-04:00"
,"author": [
{"@type": "Person"
,"name": "BZYMOM"
,"url": "https://www.allrecipes.com/cook/62019"
}
]
,"description": "Chocolate cookie sandwiches with a fluffy vanilla filling."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/TF7cKeXguXHosdD7TUjEWwJfinU=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/633327-556693e2a29143b8ade6680e4be2cb04.jpg",
"height": 960,
"width": 960
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Whoopie Pies VII"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "3.9",
"ratingCount": "80"
}
,"cookTime": "PT10M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "367 kcal"
,"carbohydrateContent": "45 g"
,"cholesterolContent": "23 mg"
,"fiberContent": "1 g"
,"proteinContent": "4 g"
,"saturatedFatContent": "6 g"
,"sodiumContent": "267 mg"
,"sugarContent": "26 g"
,"fatContent": "20 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT25M"
,"recipeIngredient": [
"2 cups all-purpose flour",
"1 teaspoon baking soda",
"0.25 teaspoon salt",
"0.33000001311302 cup unsweetened cocoa powder",
"1 cup white sugar",
"1 egg",
"0.5 cup vegetable oil",
"1 teaspoon vanilla extract",
"0.75 cup milk",
"0.5 cup milk",
"2.5 tablespoons all-purpose flour",
"0.5 cup shortening",
"0.5 cup white sugar",
"0.5 teaspoon salt",
"1 tablespoon vanilla extract" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Preheat oven to 350 degrees F (175 degrees C). Grease cookie sheets. Sift together the 2 cups flour, baking soda,1/4 teaspoon salt, cocoa and 1 cup sugar. Set aside."
} ,{
"@type": "HowToStep"
,"text": "In a medium bowl stir together the egg, oil, 1 teaspoon vanilla and 3/4 cup of milk until well blended. Gradually stir in the sifted dry ingredients. Drop by tablespoonfuls onto the prepared cookie sheets."
} ,{
"@type": "HowToStep"
,"text": "Bake for 10 to 12 minutes in the preheated oven, until firm. Allow to cool on baking sheet for 5 minutes before removing to wire racks to cool completely."
} ,{
"@type": "HowToStep"
,"text": "To make the filling: In a medium saucepan, whisk together the 1/2 cup of milk and 2 1/2 tablespoons flour. Cook over medium-high heat, stirring frequently, until thick. Remove from heat set aside to cool. In a medium bowl, Beat together the shortening, 1/2 cup sugar, 1/2 teaspoon salt and 1 tablespoon vanilla. Stir in the cooked milk mixture and beat for an additional 20 minutes, until really fluffy. Sandwich filling between two cookies. ENJOY!!"
} ]
,"recipeYield": ["12"]
,"totalTime": "PT35M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Anna Inverso"
},
"reviewBody": "My kids love it and I keep making this recipe , I choose this recipe because of the filling every time I make it’s delicious"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This filling recipe is barely edible. I wonder if there are typos? Maybe it is supposed to have 2.5 cups of sugar and 1 tsp of vanilla?"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "soccermom"
},
"reviewBody": "This filling recipe is barely edible. I wonder if there are typos? Maybe it is supposed to have 2.5 cups of sugar and 1 tsp of vanilla?"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "First made these and the cake part was too flat. Also , filling was salty and there wasn't enough to fill the cookies. I added half a cup of flour to the cake batter. I also doubled the filling part of the recipe and omitted the salt. They were perfect with the slight modifications."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jolene Marrone"
},
"reviewBody": "I made these exactly as the recipe called for and they turned out perfect. Just like I remembered when I was young. Because the filling called for shortening, I was hesitant to try it. I've tried several filling recipes that call for shortening that left a film on my tongue. But this one didn't at all! Light, fluffy and not too sweet. The cookies were just cocoa-ey enough too. I'll definitely make these again and again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Kitkat47"
},
"reviewBody": "The cakes came out perfectly, moist and not too sweet, however, we really didn't like the filling."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Toril"
},
"reviewBody": "it was a little bit messy but very tasty the only bad thing was that we didn't have all the ingredients."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "missbee"
},
"reviewBody": "easy to make and quite delicious!! i would double the icing part to be able to put lots of it!! yummy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "monicamlawrence"
},
"reviewBody": "Based on the number of stars (and without reading too many of the reviews), we chose this recipe for my daughter's final for Foods class as a freshman in high school. As others have noted, the cake part is excellent! No changes. I am a pretty experienced baker, but failed to notice the TWENTY minutes of mixing for the filling. should have been a red flag.... The filling as directed was just awful. I added: cornstarch mixed with water, a lot of powdered sugar, and roux (butter and flour), until after about an hour we got to an actual acceptable creamy middle. If you are not an experienced baker, find another filling recipe! Ours turned out great, but it was really trial and error until we \"got it.\" Find your \"own\" or another recipe for the filling PLEASE and spare yourself our problems!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "WinterTree"
},
"reviewBody": "I made the cookies only, as I was decorating the top with buttercream and decided to fill them with that. The cookies came out perfectly. For each one I used a tablespoon of dough. That made a total of 44 cookies for 22 small whoopie pies. I used cream instead of milk. They were quite rich and yummy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "RMass"
},
"reviewBody": "I made these pies for the first time today. I read all of the reviews before so I was a little concerned about the filling. I followed the recipe to a \"T\" and my pies were excellent! The filling was so light and fluffy and not the least bit greasy. I was thrilled and my family loved them. I mixed the filling for the whole 20 mins (with a hand mixer) and it was perfection. Thank you for this recipe....I will definitely make again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Teri Morgan"
},
"reviewBody": "I am fifteen and I made this for my mom and my sister and I and we all loved them! If you follow the directions exactly and don't try to cut corners, they will come out amazing! A tip though, when making the filling, try sifting the flour before putting it into the pot or make sure that the flour is clumpless because when the mixture thickens, if there are clumps in it, you will definitely taste it in the filling. Also, take the time to beat it for the full 20 minutes. It really pays off. Great recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LINDA**"
},
"reviewBody": "I just made these today very good. At first I wasn't sure about the filling but when placed between the two cookies it came together for me. I will make these again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Michelle T."
},
"reviewBody": "Not bad, but not great either. The chocolate flavor could have been richer and the cream filling was not sweet enought and a bit greasy. I added some powdered sugar and that helped. They were enjoyed, but not the best by any means."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lorri Dougherty"
},
"reviewBody": "Loved the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "clcasas"
},
"reviewBody": "The cake part is very tasty, although it could be baked for only 8-10 minutes, ours were a little hard, though not too much. The filling is atrocious! Do not waste time on it. It is very greasy, and never whipped up. We used our own recipe, modified by checking other whoopie pie recipes here. Good luck!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "LawBabe"
},
"reviewBody": "I made the entire recipe as indicated. After making it, I believe that the sugar should be specified as confectioners or granulated. I used granulated sugar and as a result, the frosting had the texture of creamy granulated sugar, which was bad. I think it's important to know this before you select this recipe. Also, one tablespoon of vanilla extract was WAY too much. It was overwhelmingly sweet. I would decrease it to half a teaspoon of vanilla extract. Also, the cake was very dry and lacking fluff like you'd expect from a whoopie pie."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Elizabeth Barrington"
},
"reviewBody": "this recipe is LUCKY it got two starts from me! I am sooooo mad right now! The frosting taste great but i stood there with my mixer for 45 minutes and it still did not fluff up. runny and thin."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SyleeE"
},
"reviewBody": "I first tried these cute little pies when I visited a friend in Maine. Ever since I came back home I've been craving them so I set out to find a recipe. The first recipe I tried was awful. The second recipe was this recipe... AWESOME! The only thing I changed was I used butter flavored shortening. :) Thank you for a great recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mariamou"
},
"reviewBody": "I baked these cookies at 340 degrees for 8 minutes, in convection oven. I also substituted the shortening and used butter. These cookies were to die for!!! I doubled the recipe and had enough filling for all cookies. PERFECT RECIPE!! SOOO GOOOOOOD!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carolyn Jean Ross"
},
"reviewBody": "These came out really well on my first try. \n\nOne thing I would say is that I found the cakes come out thicker and hold their shape better when they're baked on parchment paper instead of a greased pan. It takes a little practice to get them to come out the same size and shape, but once I got that down I had no other problems. \n\nWhen the milk &amp; flour are on the stove, I'd suggest stirring constantly rather than frequently. \n\nThe filling is so good I'm going to find other places to use it. Smooth &amp; creamy, and just sweet enough.\n\nThanks BZYMOM!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Alberta Rose"
},
"reviewBody": "This was my first experience with whoopie pies of any kind. I thought they were supposed to be a soft cake like cookie sandwich, but these cookies came out more like a typical crisp chocolate cookie. I cooled them and then covered them well and they did soften up a bit after that. They tasted great though. I won't rate the filling as I made these to use up some excess cream filling from another recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "House of Aqua"
},
"reviewBody": "This recipe turned out perfect for me! I made the recipe as written and I got 24 large super soft and puffy whoopie pie cookies. I found they taste the best within the first 24 hours of making them. They expand in the oven while baking, so keep that in mind. Looking forward to making these again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "JFHINOH"
},
"reviewBody": "My son was looking for a dessert similar to the ones we buy to pack in his lunch. These turned out really well--with a couple of changes. I substituted buttermilk for the milk. The batter was really thick so I mixed in 1/2 cup boiling water to get it to the perfect consistency. I baked these on a well greased cookie sheet for about 7 minutes and they turned out perfect--nice and puffy and came off the sheet very easily. I also doubled the amount of filling called for, substituting a stick of butter for 1/2 a cup of the shortening. I only used a teaspoon of vanilla. I've made this type of filling before. It's not like frosting but more like the filling inside a Twinkie (the flavor and texture my son was craving). I am sure we will be making these again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "squishcheeks"
},
"reviewBody": "These taste just like the ones I would buy from the Menonites that live in my area. Not too sweet but just perfect. I only made a half batch of the cookie part but I used the full batch of the filling. I will absolutely make these again and again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "SoyokazeSwifteye"
},
"reviewBody": "The cake-like part is good, though it flattened for me instead of going all puffy like it's supposed to. The filling is awful though, I had to throw the batch away because my mom was worried everyone would get sick from them. It had a greasy consistency and a terrible aftertaste."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "wings22"
},
"reviewBody": "My hubby and son loved them.. i did have to double the filling too...."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Maya"
},
"reviewBody": "I was pretty disappointed with this recipe. The first batch that came out was really bland so i added some more sugar and cocoa to the batter. This helped a little but not a whole lot, and i would defiantly recommend using a different frosting. This frosting almost felt like it was sliding down your throat. I tried to save it by adding powdered sugar and some peanut butter. I managed to save it from the garbage. Overall it was OK but not great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DAVID S."
},
"reviewBody": "These were great. For the filling you have to make sure you bring the flour and milk mixture to a boil in order to remove the raw flour taste. You also have to beat the filling a good long time when you add in the cooled milk and flour mixture. These actually taste better the next day. At first the filling does simply taste like sugar and shortening but after a day the ingredients meld together and the filling becomes more creamy. If you think the filling tastes too much like bakery icing at first give it a day and you'll see a big difference."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "dreynolds53"
},
"reviewBody": "I did not make the cookie. I wanted a recipe for a cooked filling. I read quite a few of the ratings, some positive some negative. I took everything into consideration and decided to try it. I followed the directions very closely and beat the mixture for 20 minutes. First, I really didn't care for the flavor. Second, it was on the loose side. NOt a good consistancy for a filling. The recipe directions remind me of a homemade pudding. So if anyone was to try this recipe, you might consider using corn starch instead of the flour and maybe add a few beaten egg yolks to the mixture after it boils for a minute. Temper the yolks and then add to mixture and boil one more minute. That might work"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "OhioKerry"
},
"reviewBody": "The consistancy of the filling was nice, but it tasted bland &amp; the shortning gave it an offputtingly greasy mouth feel. I might try again subbing half butter, adding a bit more sugar, &amp; maybe a little liquor or something to amp up the flavor. I also wish the cookie tasted more intensely chocolatey--it tasted a little flat."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "polly625"
},
"reviewBody": "I think these are really good. For anyone who had a problem with the filling, I think you did it wrong. I have used both flour and corn starch and they turn out great. You have to let the flour mixture cool totally and then beat it for a long time. I use my stand mixer and at first it looks strange and like not enough but you have to keep beating it. The filling should not be greasy either and I have used both butter and shortening. In fact the filling is my favorite part, it's like Waldorf frosting so good, but for sure a different texture then regular frosting, and that what is so great. I am making these again for my son'e Pi party on Pi day (3.14), and I can't wait!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Sweettoothgirl"
},
"reviewBody": "The rest of the people I served these too were okay with these. I did not like these at all. For one thing, the frosting was way way too salty. Plus it never thickened up, it was very goopy and thin-like a glaze instead of a frosting. The frosting should have had a higher fat to sugar ratio. As for the whoopie sides themselves, they were only okay. Sorry, I will not be trying this recipe again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "aimbone"
},
"reviewBody": "I followed this recipe exactly and was not impressed. The cookies came out too flat and not cakey enough and the filling flavor was good but texture was too greasy and smooth. Still on my quest for a good whoopie pie recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Becfra"
},
"reviewBody": "These were good but not great. They were really runny for me and so i added the extra cocoa like another review said, but then the cakes were too bitter chocolately. The filling was WONDERFUL. and i did end up doing two batches of it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Melanie Barton"
},
"reviewBody": "I thought these were good, but I added about a quarter cup of margarine and about half a cup of confectioners sugar to the filling. I did it both for flavor and to thicken it a bit. When I just followed the recipe my filling was no where near as thick as the picture. I also thought I could taste the flour a little bit and it wasn't sweet enough for me."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Tara Swinson"
},
"reviewBody": "I don't know if there was too much flour or what, but I wasn't into these at all."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lori Pearson-Cayer"
},
"reviewBody": "This filling is great, if you want it a bit sweeter, add a few tablespoons of Marshmellow Fluff, and maybe a bit more sugar and vanilla. The key is to beat it for a long time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Samantha Hildebrand"
},
"reviewBody": "I really like the cookie part of these, they were so yummy and soft, but the icing i thought was a little blah.... but it sorta worked with the cookie. Next time i think i'm going to add some more sugar to the icing. But over all i really like these, my husband really enjoyed them, thanks for the wonderfull recipie"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MSCHALK"
},
"reviewBody": "We made these for family night and they were a hit! even the cookie by itself is delicious. It's a great recipe when you are tired of the the same old cookies. The 20 min beating of the filling was a little brutal..but totally worth it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "bzzysgrl"
},
"reviewBody": "super easy to make. It hit the spot for that sweet tooth! The cake was moist and a little crunchy around the edges and the filling was delicate!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Gabster"
},
"reviewBody": "I live in Maine where we take our Whoopie Pies seriously. This recipe is not so much a whoopie pie as a tasty chocolate cookie sandwich. I took the advice of one of the reviews and used butter flavored shortening- my boyfriend loved the buttery flavor of the filling but personally I found it tasted odd with chocolate. Next time I will use regular shortening. The consistency and taste of the filling was otherwise wonderful and will use it again if I can find a better recipe for the cookie.\nI followed the cake/cookie part of the recipe exactly and the cookies were not nearly fluffy enough. They flatten considerably and even with only 10 minutes in the oven come out crispy along the edges because they're so thin. As a chocolate cookie it's tasty but a whoopie pie should be more cake-like. Again, not a bad recipe but definately not a whoopie pie."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "GreenMachine"
},
"reviewBody": "These whoopie pies are great! If you like \"traditional\" whoopie pies, this is the recipe for you. The filling is not a sweet buttercream or marshmallow, but fluffy and just the right sweetness. A few tips based on others' reviews: I do not recommend refrigerating the batter before baking, nor does it require time to sit. This makes the 'cookies' come out more dry. If your batter spreads thin while baking, it is not due to the recipe. One element that is key is the cocoa powder. When measuring this, make sure to pack it down (or at least sift it). This will ensure a very chocolatey flavor and keep your batter from coming out too thin. On a similar note, the filling should not come out thin if prepared correctly. I made this on a very hot and humid day and the filling didn't come out runny. Be sure to beat using a mixer (I even used a hand mixer) for the full 20 minutes. Have faith, the filling will come together! And do give this filling a shot. I'm generally opposed to using shortening, but sometimes it's worth it. This filling was really great and worth a try. Finally, these desserts taste great warm, cool from the fridge, and frozen. But be sure to note that the texture of the 'cookie' changes entirely when put in the fridge or freezer (drier and even drier, respectively). Overall, a great recipe for when you want something *special* that reminds you of your childhood. A+"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Stephanie Holt"
},
"reviewBody": "I used the exact ingredients and followed the recipoe as stated however, these were not good at all. The cookie part itself tasted of bitter chocolate and was a little salty. THe cookies also did not spread very much. The filling was very oily looking, the ingredients did not combine well at all. If I was going to make this again I would use a chewy chocolate cookie recipe and a filling that calls for cornstarch and water as a thickening agent added to light cornsyrup, powdered sugar, and vanilla. I will not be making this recipe again. Even my 3 year old whohas never meet anything with sugar she did not like, said mom what is this? No thank you I don't want it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Autumn*in*Missouri"
},
"reviewBody": "I made these last night and my man just loves them! He said I was free to make them again as often as I feel the need to. The cakes were perfect, just like the ones my mother used to make but the filling was very different. We can't find her (my mom's) recipe and my sister and I have yet to duplicate her filling, but these still taste great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "ADRIENNEMB"
},
"reviewBody": "These tasted great. Definitely double the filling though... I was only able to fill half the batch. I also added extra flour to the cookie batter because it seemed too thin."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "HappyHousewife"
},
"reviewBody": "I thought these turned out great! I liked this recipe because it didn't use shortening or butter in the cookie part. I used my own filling recipe: 1/3 C butter, softened, 3 C powdered sugar, 1 t vanilla, 1-2 T milk. Cream butter and sugar. Add vanilla and enough milk to reach desired consistency. I also tinted the filling orange and will use these for a fall themed bridal shower. Very yummy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Monica"
},
"reviewBody": "these were great, but everyone thought the cookie should have more chocolate flavor"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SarahS"
},
"reviewBody": "These were great! After reading through the reviews, I planned on serving these right from the freezer so I actually mixed a little bit of cool whip into the filling (helps thicken it up a bit too). I also substituted just a little of butter for the shortening. \nThe cookies were great, I didn't think they were lacking in flavor at all.. but even if they were that filling wouldve made up for it, it came out soo rich and creamy. I'll be making this again for sure.\n\nBy the way, I didnt want to make too many whoopie pies, so I had some leftover cookie batter as well as the filling.. so I made mini cupcakes! they turned out great, I baked them for about 10 minutes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "MISSY76"
},
"reviewBody": "Awful. The cookies had almost no flavor, and if you do not let the batter sit and \"thicken\" before baking, the cookies spread out while baking and become huge and paper-thin. The filling was too greasy, and called for too much vanilla. My kids definitely did not like this recipe, and I will not be making it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Deborah Mickey Kissell"
},
"reviewBody": "this wasn't very sweet or chocolaty. will not make again. good texture though."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kathryn Schilling"
},
"reviewBody": "While I did expect the filling to have more 'body' to it, these cookies were very delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "ERIN1122"
},
"reviewBody": "The cookies aren't very chocolatey or sweet but they have a great cake-like texture. I also liked the icing for the middle because it wasn't too too sweet like other recipes I've tried."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KERSTIN"
},
"reviewBody": "These are so tasty. Makes you feel like a kid. I especially like this recipe because it doesn not use raw egg whites in the cream filling like so many other whoopie pie recipes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "SUCCESSB440"
},
"reviewBody": "Although this recipe is easy to make, it lacked chocolate flavor. I've made whoopie pies before and these aren't very tasty. Sorry."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Heather Baker Horgan"
},
"reviewBody": "This is a good recipe, similar to the one Martha Stewart used on her show. My advice is to make sure the milk/flour mixture is completely cooled before adding to the rest of the filling recipe. I always get lumps in my filling from the flour and I am not sure how to fix that, but this is yummie anyway and I think I am the only one that recognizes the lumps! Everyone at worked loved them! Plus, my husband who usually doesn't like treats like these had two!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "PATTI"
},
"reviewBody": "I have tried a lot of recipes for whoopie pies, and these have to be the best. My family and friends enjoyed these a whole lot."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "FREIMUTH30"
},
"reviewBody": "I took someone else's advice and put them in the freezer for a few hours before serving. They were wonderful! The cookies stayed chewey even when frozen overnight. My kids thought they were ice cream sandwiches."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Super Mom"
},
"reviewBody": "The cookie part was great texture, flavor, everything. I think that I either didn't whip the filling long enough (I doubt it, I used the whisk attatchment on my stand mixer for 20 minutes to no avail)or more likely this filling wasn't made to stand up to September in the Deep South. I had to put them in the fridge to keep the filling from oozing out the sides. It still tasted good. The kids thought that they were ice cream sandwhiches. Every one loved them, even my husband. I will make these again but will try powdered sugar to help stabalize the filling."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cook4myluvs"
},
"reviewBody": "These are wonderful! Because we have a large group that comes over for Sunday dinner, and we all love chocolate, we doubled the cookie recipe and made a couple of changes: we replace the oil with butter-flavored shortening and added 2 squares of unsweetened chocolate (and one of bittersweet chocolate), melted. Because so many reviews said there wasn't enough filling we tripled the filling recipe, and we used 2/3 butter and 1/3 butter-flavored shortening instead of all shortening. We don't usually use shortening at all, but happened to have some on hand and were low on butter. In any case, they turned out terrific- with not-too-sweet cookies and a fluffy, just-sweet-enough filling. Thank you Byzmom!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "These were great. Easy to make and not too sweet. The kids loved them. I used butter instead of shortening for the filling because we don't use shortening in our home. They still turned out great. The filling is light, fluffy. We will double the filling recipe the next time as it really didn't make enough."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This recipe is what I was looking for. I am not a frosting person so the filling was perfect. Light and fluffy and not too sweet. My husband and my 2 year old loved them not no mention anyone else that tried them. Great recipe and they surely are WHOOPIE!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "The chocolate cookie went together easily and baked according to directions. Where the recipe fails is in the filling. There was no volume and it tasted too much like shortening. I re-read the directions several times, but couldn't see where I may have erred. Suggestion - keep the cookie recipe but find another filling."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JOLIEDREAMING"
},
"reviewBody": "I wasn't sure about this recipe at first but my husband swore that that he loved these gobs. I didn't use the icing part of the recipe though since we both love super sweet icings (I used a buttercream frosting that is on this site instead.) I tried to make this recipe again for fathers day but instead I made it into a gob cake. I accidently put the wrong amount of cocoa in...making it 3/4 cup instead and to compensate I added about an 1/8 cup more milk. I baked the cake till a toothpick came out clean and then let cool and cut the cake in half and put icing in the center. I have never gotten so many compliments...saying it was better than store bought. This recipe is definitly a keeper!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LMILJENOVICH"
},
"reviewBody": "Hubby is a self-proclaimed Gob expert and he was skeptical. When they first came out and cooled they were a bit crunchy on the outside and not as moist. The filling was a little too fluffy for him but I can fix that by not whipping it as long. the next day after unwrapping it from the celophane, the bread was nice and soft and moist and he LOVED them! He just wants the filling a little sweeter and less fluffy. But they're good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SARAHLEX"
},
"reviewBody": "very easy and delicious! I doubled the icing part of the recipe so that I would have a lot for the filling!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I tried several whoopie pie fillings and this one is by FAR the BEST! It tastes just like the cream filling in Devil Dogs. I found the ones with marshmallow fluff to be too sweet - too much like buttercream frosting. This one is perfect - I've gotten rave reviews on it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I love this recipe. And when I make it I have to do at least 6 batches because the boys are waiting in line to take a bag home. It looks thin but as it sits it gets thick. I added more flour at first but like it as it is."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Good cookie to make for a snack. I had just enough frosting, but I had to skimp a little on the last few cookies. Be careful when cooking the milk and flour because lumps will remain in frosting. Overall, I was pleased!"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/19241/whoopie-pies-vii/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/362/desserts/cookies/",
"name": "Cookies"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/16417/desserts/cookies/whoopie-pies/",
"name": "Whoopie Pie Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/19241/whoopie-pies-vii/",
"name": "Whoopie Pies VII"
}
}
]
}
}
, "about": [
]
}
]