				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Wiener Winks"
,"datePublished": "2000-10-21T16:27:47.000-04:00"
,"dateModified": "2022-07-14T18:05:25.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Krista tank"
,"url": "https://www.allrecipes.com/cook/24325333"
}
]
,"description": "Beef frankfurters wrapped in cheese and bread, buttered and baked to a golden brown."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/V3-DGnebD9Zy_WbjHUVqEq5bFrE=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/1114854-c19a597de5c44e7284dc4d4be698e78e.jpg",
"height": 960,
"width": 960
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Wiener Winks"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.3",
"ratingCount": "66"
}
,"cookTime": "PT30M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "394 kcal"
,"carbohydrateContent": "15 g"
,"cholesterolContent": "67 mg"
,"fiberContent": "1 g"
,"proteinContent": "15 g"
,"saturatedFatContent": "15 g"
,"sodiumContent": "1260 mg"
,"sugarContent": "3 g"
,"fatContent": "30 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT15M"
,"recipeIngredient": [
"1 (16 ounce) package beef frankfurters",
"8 slices processed American cheese",
"8 slices bread",
"8 teaspoons butter" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Preheat oven to 350 degrees F (175 degrees C)."
} ,{
"@type": "HowToStep"
,"text": "Take 1 slice of bread and spread 1 teaspoon of butter on one side. Turn the bread over and place a slice of cheese on the bread. Place a frankfurter diagonally on the cheese. Fold bread corner to corner around the frankfurter. Insert a toothpick to hold together. Repeat steps for the remaining frankfurters."
} ,{
"@type": "HowToStep"
,"text": "Bake in a preheated oven for 20 to 30 minutes or until golden brown."
} ]
,"recipeYield": ["8"]
,"totalTime": "PT45M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shelly Hoff"
},
"reviewBody": "Ate these all the time as a kid."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Marianna Southard Debolt"
},
"reviewBody": "I used puff pastry instead. Very easy. Great for the pickiest of eaters."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Laurie Hillis"
},
"reviewBody": "Made these for my family and wasn't impressed. Following the recipe exactly the bread was overcrisp and the hotdogs weren't heated all the way through. Doubtful that I'll make these again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cheryl"
},
"reviewBody": "This is how we made hot dogs when we had no hot dog buns! seriously?"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "twinsphins"
},
"reviewBody": "Cooked hot dogs first.Then cut crust off bread and wrapped bread around hot dogs and pressed edges together with a fork.Grilled just like grilled cheese.Served with baked beans and pierogies.BANG....a meal!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Aliboo"
},
"reviewBody": "I've eaten Weiner Winks since I was in elementary school in the 1960's, I still remember the menu for weiner wink day, \"wiener winks, buttered corn, tomato juice, apple crisp\". It's a shame the schools don't serve those good old lunches! I've been making these ever since! I seldom use butter, the bread toasts just fine without it (although the buttery taste is certainly numma!) I put the hot dog diagonally then prop them against each other in a cake pan with sides so I don't use toothpicks either! I've read reviews where people say to use biscuit dough, but those are called \"pigs in a blanket\". If you wanna make weiner winks, it's gotta be bread and cheese!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "lisa"
},
"reviewBody": "These were ok. My bread never turned a nice toasty color but yet was crunchy. Not a huge fan but glad I tried them. Thanks for posting!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Molly"
},
"reviewBody": "I love hot dogs, and found this recipe to be just okay. What I didn't enjoy is the bread tasted like you were eating a hot dog on a piece of toast. They are quick and easy to put together, but I probably won't be trying these again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cindy in Pensacola"
},
"reviewBody": "We enjoyed these for a quick Saturday lunch. So simple but until you see the recipe, who'd of thunk? LOL.. I'll do this again when I want something easy and tasty."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ladybuggs5224"
},
"reviewBody": "Kids liked these for dinner. A nice shake up of a grilled cheese and a hot dog."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "eatumup"
},
"reviewBody": "quick and easy, great for watching the game and cheap to make for a crowd."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "alr516"
},
"reviewBody": "I have a co-worker who makes these with her students and recommended them. Her husband ate them as a kid. This isn't a gourmet meal, but it's kid friendly and extremely simple to make. I didn't use the butter and they turned out just fine. On nights when I'm pressed for time or I'm not sure what I should make for my family, I sometimes turn to this recipe. It would be great to put leftover chili in a baking dish along with this so that you could have chili dogs. This also helps to stretch your food budget because it's very inexpensive to make this recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "The Skinny Cook"
},
"reviewBody": "We had three little girls over on saturday, and needed a quick lunch idea. These worked great, except the bread kept breaking!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "DemonicMom"
},
"reviewBody": "These are just not our favorites... Made them this morning as it was a simple and easy recipe. But definitely not making these again. Sorry :("
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Boomama40"
},
"reviewBody": "So simple, the whole family loved them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Rachael Gonzales"
},
"reviewBody": "Super easy and quick, and a hit with the kiddos! I had an issue with the bread tearing when I used butter so the second time around I just sprayed the bread with some butter flavored pam and they came out nearly perfectly. My 2 year old son loves hotdogs and grilled cheese so this was a great way to combine his two favorite things! I think next time I just might make them on the stove to save some time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "gap"
},
"reviewBody": "my mom did it when a was young but she added tomato sauce over bread (before the chesse) and some kepchup over the cheesse..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Miyesha Jackson"
},
"reviewBody": "These are soooooo good! I used the Pilsbury biscuits instead and the family loves them! I made them for my sisters for the last super bowl part we had they were like little kids sneaking one before it was time. Now I make them about every other month. No one gets tired of eating them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "How cool are these!? I have unexpectedly been taken back to Sunnyside Elementary School on my favorite lunch day...weiner winks!!!! Yay!!!! I cannot wait to make these for my two boys...I tried once a long time ago but forgot to butter the bread. Couldn't figure out how something so simple didn't turn out the way I remembered them! I think the butter is the key! THANK YOU so much for posting this...I never forgot about those good 'ol winks. Now if I could only figure out how they made their pizza burgers, and those pioneer bars! (peanut butter bar w/choc. frosting) If anyone out there knows the school lunch recipie for either of those, please share! :-)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kathy Curtis Waggoner"
},
"reviewBody": "I make these with angus franks. Very good and just like what we had in school as a kid. Same name, too! Sometimes use different cheeses."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "teejaa6"
},
"reviewBody": "Tried these tonight, exactly as recipe is listed, and they came out quite good! Nice and golden brown-crispy! The kids liked them as did my wife (she thought they were better than the croissant dogs she sometimes makes). These were fast, easy, and good. What more do we need some nights? Thanks for sharing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "ARABY"
},
"reviewBody": "On paper my kids should have LOVED these, however both of them disliked them greatly. Ended up using the same ingredients and making grilled cheese sandwich with a side of hot dog, which they devoured in 0.10 seconds! Go figure!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "CanadianMom"
},
"reviewBody": "Try: cook the Hot Dogs on the frying pan, put them on a plate, put the Lightly buttered bread down on the frying pan with half a slice of cheese (a whole slice is too much) then the hotdog on top the cheese (top to bottom, Not diagonal). check the bread, when its golden brown pick it up with a spacula, have a folded paper towel ready, put it down on the paper towel, fold the bread around the hotdog and fold the towel around the bread and put aside, finish the rest of the hotdog raps. Enjoy! Much easier and tastier! Just try it and see! :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "jennifer_wells"
},
"reviewBody": "They were good, I just had an extremely hard time keeping the bread down with the toothpicks, it kept ripping the bread and didn't fold together well."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "friskyspatula"
},
"reviewBody": "you can't beat this school time classic"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Michelle Rosenthal"
},
"reviewBody": "good and easy"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "M. Stoffel"
},
"reviewBody": "I hadn't thought of these in probably 15 years until I saw them on here! I loved them in school and this recipe duplicated them perfectly. I agree, the messy buttery outside is MANDATORY and helps make them so awesome. I made just as directed and won't make any changes - thanks so much for sharing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Arthur53"
},
"reviewBody": "OMG! Thank you for a great recipe! I usually keep my franks frozen. I took 2 and placed them in the microwave for 1 minute. The franks came out of the microwave thawed, semi cooked and juicy. I buttered and cheesed my 2 whole wheat bread slices as per instructions. I put the toothpicks through the crusts of the breads so they don’t get away. I placed both winks in my toaster oven at 350, as instructed, for 6 minutes in one side, then I used my tongs to turn then over and cooked them for 6 minutes on the other side. The “butter messy” part I did not want to solve (it’s the “fun” part). When done, OMG!... soft in the inside, crunchy on the outside. My 15 y.o. son said it’s a keeper."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "MrsHavens1984"
},
"reviewBody": "Gross"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "donnak"
},
"reviewBody": "Thanks for the reminder, I haven't made these in years! At my school they were called Toastie Dogs. I make sure to use a fresh loaf of square sandwich bread (bends easier without cracking when its fresh). I butter them sparingly, and just flatten the corners that are tucked under the dog rather than using a toothpick."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "KAWGIRL"
},
"reviewBody": "VERY YUMMY!!! Just like school!!!! A little hard to make, the bread doesn't want to stick together and toothpick just tear out. But good anyway!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LuckyMama"
},
"reviewBody": "Kids loved these, and ate them quickly. My slowest eating child, was actually done first! Thanks for a different take a typical kid food. :) (I know I'll love them too!)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Amanda L."
},
"reviewBody": "These were good, i liked them alot and im sure my kids would love them too, i actually never heard of these but very good and perfect for little ones, thanks! :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sarah Jo"
},
"reviewBody": "I made this for my boys' lunch today, only using presliced cheddar. \n\nBIG HIT. HUGE. I'd make this again in a heartbeat."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BacardiGirl"
},
"reviewBody": "I grew up with these being served for our school lunches!! I didn't know if anyone outside of small-town Iowa had ever heard of them until my BF (whose from Minnesota) talked about them one day..weiner winks must be a school cafeteria staple!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Lemonhoney"
},
"reviewBody": "Fun for kids and teens. We used to call these \"Skater Dogs\" When I was in school and making these. All my friends loved them.\n\nHowever, I made them the same way (Folded in half) and in a pan like making grilled cheese sandwiches. They were much better like that. I tried this way and found that the skin on the beef was more tough after being in the oven for 20 minutes. The cheese was over done this way, and honestly, the bread doesn't brown as well (at least in my oven) and just got a bit of color and more dry. I'd recommend making these in a pan instead of in the oven. Taste is better and it's done quicker."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "MaddieLC"
},
"reviewBody": "Meals like this make my hubby smile."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jana"
},
"reviewBody": "I followed the directions exactly with perfect results. I have no idea WHY these are so great, but they are. Maybe it's the nostalgia of school days, or maybe the combination of butter and cheese with a hotdog. At any rate- my whole family loves them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "burtonm"
},
"reviewBody": "In order to not make a mess with these, the easiest thing that I've always done is just butter the bread and lay it on a square piece of tin foil. then just roll it up and twist the ends and cook for about 12-15 minutes and it usually all stays together!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cheoah"
},
"reviewBody": "This recipe brings a smile to my face. Mom used to make these for us when we were growing up. I love them! Ketchup or mustard to serve with or both mixed together. Thanks for bringing back some memories:)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lorena"
},
"reviewBody": "Wow!! we loved these!! Used margerine instead of butter. Quick, tasty and nice presentation. These are not messy at all, and probably the easiest recipe i got from this site. Flavorful without much effort. Thank you"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Java_Girl"
},
"reviewBody": "These were so cool and very kid friendly! They are very fast to prep. Just slather the butter, place the cheese and hot dog and wrap. I ended up using 3 toothpicks to secure it because just using one tore the bread. The beef franks are a little too big for my kids so I used regular hot dogs. As much as I love cooking I don't do it until after my little ones are in bed so I'm really happy about this because I can throw it together and let it bake while I play with them. Thank you for posting this recipe, it's given me so much more than just the Weiner Winks! One more thing, instead of getting butter on my fingers while I roll it, I just wrap the hot dog first and then spray the no calorie butter spray on the outside. Still bakes up nice and toasty!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "These were a little bit of a mess for me. The bread totally tore and was a little too crispy after cooking in the oven. I'm giving it 3 stars though because they did taste good. I probably wont make these again, but stick to how I usually make these which is with cresent roll dough. You wrap 1 triangle of cresent roll dough around the hot dog and bake according to the cresent roll directions. I love these that way."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Helen"
},
"reviewBody": "I love this recipe. My mother made weiner winks (pigs in a blanket)for us often. She had the same recipe, but added one more step. She would wrap each with a slice of bacon and then secure it with a toothpick. Hint: For crisper bacon can cook the bacon a little in the microwave first. When using bacon you can also use less butter on the bread. (You only need to butter two corners, because the bacon covers the rest of the bread). It is a little messy and isn't the quickest recipe, but I think it's worth it every once in a while. Yummy, I'm making this tonight."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Mayson"
},
"reviewBody": "These are great. They work well as a quick, easy and packable not-too-formal lunch."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MADISONLIBERTY"
},
"reviewBody": "These are so good! I think I almost like these better than wrapping the hotdogs in biscuits!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sarah Heath Kodavatikanti"
},
"reviewBody": "Thanks so much for this recipe!! I am another one who used to eat these in school! They are the best. I'm going to make them very soon for my kids. Thanks for posting the fat content on each recipe though, I am definitely going to have to limit us to one each!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allie D."
},
"reviewBody": "I had never heard of these until my husband was waxing nostalgic for his childhood school lunches. I made these, and he almost cried from happiness! They brought back great memories for him, and they were pretty darn tasty, too! Thanks for posting this fun, retro recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Renee Marie"
},
"reviewBody": "If you have round top bread, just tear off the crusts and roll it flat with a rolling pin. I used two flattened slices per frank, and it worked nicely."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mrs. C"
},
"reviewBody": "My mom used to make these after church when I was a little girl - thanks for bringing back wonderful memories!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "maria sullivan"
},
"reviewBody": "these are the perfect answer to an after school snack. My kids and I love them. Thank you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "SHELDAWG"
},
"reviewBody": "These were just to much work for the end result. Taste was fine but the work going into it was not worth it. I can just make a grilled cheese with a hot dog cut up inside."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "martha7"
},
"reviewBody": "I also used the rounded top bread and had trouble getting the slices to wrap around the hotdog (and stay). Ended up having to use two skewer sticks (about an inch longer than regular toothpicks) per \"wink\", and had trouble with the bread ripping. They tasted good, but I overdid them a little (25 minutes in the oven, although not overly browned) and the bread ended up being a bit too crunchy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cotijo"
},
"reviewBody": "I remember eating these when I was little - couldn't remember how to make them then I found this! Thanks Krista, now I can make them for my kids."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "JEANNIE_18_99"
},
"reviewBody": "I make these when I need a quick snack but it works alot better to use Grands or any other of the jumbo size refrigerator biscuits and simply stretch and wrap the biscuit around the hotdog and cheese. Bake for the time stated on your tube of biscuits and be sure to seal the edges well."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Jill C."
},
"reviewBody": "These are a good idea, however I think one would have to use the square sandwich bread. We used the rounded top bread and had a mess on our hands, because the bread tore and would not wrap around the hot dog. The kids were not too impressed either."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/23117/wiener-winks/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/251/main-dish/sandwiches/",
"name": "Sandwich Recipes"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/13376/main-dish/sandwiches/hot-dogs-and-corn-dogs/",
"name": "Hot Dogs and Corn Dogs Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/23117/wiener-winks/",
"name": "Wiener Winks"
}
}
]
}
}
, "about": [
]
}
]