				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "World&#39;s Best Key Lime Pie"
,"datePublished": "1999-11-10T00:03:43.000-05:00"
,"dateModified": "2022-07-14T17:42:30.000-04:00"
,"author": [
{"@type": "Person"
,"name": "June"
,"url": "https://www.allrecipes.com/cook/24324765"
}
]
,"description": "Make and eat this delicious and easy pie within about an hour. Condensed milk, key lime juice and whipped topping are combined, poured into a graham cracker crust and chilled."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/kW4pkjwrA0ScrzipvhK6HIO253k=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/37587-5958d73eeeab4bfa95a71d7fda28dedb.jpg",
"height": 960,
"width": 960
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "World&#39;s Best Key Lime Pie"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.6",
"ratingCount": "127"
}
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "495 kcal"
,"carbohydrateContent": "62 g"
,"cholesterolContent": "17 mg"
,"fiberContent": "1 g"
,"proteinContent": "6 g"
,"saturatedFatContent": "17 g"
,"sodiumContent": "256 mg"
,"sugarContent": "52 g"
,"fatContent": "26 g"
,"unsaturatedFatContent": "0 g"
}
,"recipeIngredient": [
"1 (10 inch) prepared graham cracker pie crust",
"1 (14 ounce) can sweetened condensed milk",
"0.5 cup key lime juice",
"1 (16 ounce) package frozen whipped topping, thawed" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "In a large bowl, mix together condensed milk and lime juice. Fold in whipped topping and mix until smooth. Pour mixture into graham cracker crust. Refrigerate at least 1 hour before serving."
} ]
,"recipeYield": ["8"]
,"totalTime": "PT0M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "NewsView"
},
"reviewBody": "This recipe would benefit from an update. A 6 oz store bought graham cracker crust is ~8.5\" round, not 10\" — so unless you're making your own deep-dish graham cracker crust be prepared to end up with two pie's worth of filling if you follow the recipe as directed. Additionally, this recipe calls for 16 oz Cool Whip but I bought a 14 oz container — still too much to fold in if you intend to make only one pie. I used 2 cups worth out of my 14oz container of Cool Whip for this recipe and then added 1/2 C sour cream. I used fresh-squeezed key limes for the 1/2 C of lime juice. When this amount is added to the reduced amount of Cool Whip, the flavor is good — but prepare for it to be quite tart. I still had too much filling left over but not an entire pie's worth using my reduced measurements. Next time, I may use 1 1/2 Cup of Cool Whip, 1/4 C sour cream and a smidgen less than 1/2 C of lime juice called for to better approximate the amount of filling that would be needed for a single store-bought crust. If all this sounds too complicated, just prepare to make two pies."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rhonda"
},
"reviewBody": "Added green food coloring. I liked how easy it was to make??"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JudyB"
},
"reviewBody": "Great and it was very easy. Took no time at all. Comes out perfect every time. We made our own pie crust with Keebler's graham cracker crumbs and followed the recipe on their box."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "montana mom"
},
"reviewBody": "Honestly, I was looking to use up some condensed milk, whipped topping and a graham cracker crust that I had left over from my holiday baking. So, when I found this recipe, I whipped it up. I added the zest of a couple of limes and about 1/2 tsp each of coconut and rum extract. I can't believe how yummy it is. I can't stop eating it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Heidi Chaplin"
},
"reviewBody": "This is a family favorite! My son often requests this for his birthday (June) which is so refreshing! I too , only use an 8oz whipped topping. I sometimes put it in the freezer and thaw it a few minutes on the counter before serving. My family loves it"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Betty Menke Witte"
},
"reviewBody": "I too only used 8 oz. Cool Whip. I also added some green food coloring just to make it more lime looking!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Brian"
},
"reviewBody": "have made this pie twice with my own graham cracker crust. In my opinion blows away the cooked one I tried that called for egg yolk. really great key lime but when sliced did not hold it shape any ideas? I will make again it so good"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Laurie"
},
"reviewBody": "The best key lime pie I’ve ever made! Tastes just like the pie I had in Key West this summer. Instead of using a prepared crust, I made my own. And instead of frozen whipped topping, I made my own using heavy whipping cream. Will never make baked Key lime pie again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "poppadave76"
},
"reviewBody": "I have used this recipe a number of times. I use one slight variation. Using fat free sweetened, condensed milk, I add one serving of key lime yogurt(one small cup), to give it extra flavor and thickness. I have made it for church get togethers, and have gotten outstanding reviews over it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jessica Patterson"
},
"reviewBody": "My Mom has made this for every Thanksgiving and Christmas for as long as I can remeber. It has become such a favorite with the family that she now makes two because the first one is gone within minutes.\nTraditionally, she uses 12 oz of cool whip and 1/3 cup lime juice. Last Christmas she used the 16 oz and 1/2 cup lime juice. Everyone raved about how much better the pie was with the additions. She also saves some of the Graham cracker crumbs to sprinkle on top.\nSo yummy and naustalgic for me!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "John Calvin Hall"
},
"reviewBody": "Super easy, and super cheap! I loved it! One tiny adjustment though. Works just fine with only 8 ounces of whipped topping. What I absolutely love to do is to buy 2 pie crusts, 16 oz. of topping and everything else, and make 2 pies! This is a huge hit with the family and a breeze to make!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Florida Warren Brown Johns"
},
"reviewBody": "Oh so easy...oh so delicious!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sandra Johnson"
},
"reviewBody": "This was a very easy pie to make and very delicious too made it for Christmas and it was a hit. Thanks to all recipes ."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Leland Dantzler"
},
"reviewBody": "As one user pointed out, using this much whipped topping really dilutes the tartness of the lime. After trying that, it's a much better recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Veronica"
},
"reviewBody": "Easy and delicious! I will make it again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "staci1985"
},
"reviewBody": "What an amazing recipe!! I made this for Thanskgiving(hubbys request). We made three pies and this one won hands down. Next time i will make it the night before to let it sit up a little better,but again AMAZING recipe and very very easy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ann Bachand"
},
"reviewBody": "Instead of cool whip, use 1 cup of whipping cream. Add 1 additional tsp of key lime juice. Whip cream and fold half into key lime mixture. Then top with remaining whipped cream."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "germanwife"
},
"reviewBody": "Yum. So easy. I just used an 8 oz. container of whipped topping and it was great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Talaysia"
},
"reviewBody": "I used unflavored gelatin and lime juice instead of condensed milk"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Daffany Quarnberg"
},
"reviewBody": "I love this recipe. It is so easy and and delicious. But do not use the entire 16 oz or cool whip in the recipe. That is way too much. Just use half in the actual pie filling and the rest as topping."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Michael"
},
"reviewBody": "Great recipe...add a touch of food coloring for effect!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Debbye"
},
"reviewBody": "I have been looking for this recipe forever. My daddy (who has been deceased for 11 years ) used to make this for us all the time and my kids loved it even though my daughter hates key lime cake, she loves this. He used and so did I, frozen lime juice instead of just lime juice. So good and so easy!!! The 16 oz. cool whip was perfect for a 9\" graham cracker shell and it would never be enough for two pies."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "happy family"
},
"reviewBody": "The key lime pie was ok but It was too creamy and When my family put it in the refrigerator For 24 hours that's the whole night It Was soft and we thought that it would be hard But still it was yum yum so I think you should try it love the happy family."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JennTime"
},
"reviewBody": "This recipe is GREAT!! Not everyone needs to alter it. It is unnecessary, in my opinion. I don't understand why people want to mess up a good thing. A lot of people hate sour cream and just want a great basic recipe that anyone can make. Thanks for the recipe. I use it and only it EVERY time I make one. ??"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jen"
},
"reviewBody": "This recipe was fantastic! It was the first time I've made key lime pie and there wasn't a crumb left. Everyone loved it! I usually don't like reviewing a recipe when I make changes to it, however, I thought it was important to note. I made two changes. The first change: I made my own graham cracker crust using 1 1/4 cups Honey Maid Graham Cracker Crumbs (they are sold in a box already crushed or you can use the sheets and crush them yourself but why? :), 1/2 cup sugar, and 1/2 cup sliced almonds. Pulse in a blender until fine. Add 3/4 stick of melted butter and mix well. Press into 9\" pie pan and bake at 350 for 8-10 min. Then let cool. Meanwhile, made own whipped topping/whipped cream (Second change), put 1 cup heavy cream into stand mixer. Add 2 tbsp sugar and 1 tsp vanilla. Mix on medium until stiff peaks form (it will take 10-15 min most likely). Then fold into condensed milk/key lime juice mixture. Continue recipe....Viola! Yummy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dana Ampaw"
},
"reviewBody": "I made this recipe for father's day. I scaled the lime juice 1/4 cup because I didn't want it too tart and I read other reviews. I used a graham cracker crust. I must say this is the best I have ever eaten. I feel empowered that I can make any dessert. I can't say enough about this key lime pie. It is sooooo good!!!!. Thank you for the recipe. This one is a keeper."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "rdglawson"
},
"reviewBody": "I use real whipped cream instead."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Melissa"
},
"reviewBody": "I think it had too much cool whip. Next time I will use less - maybe 8 - 12 oz. cool whip. Certainly very easy and although I thought it had too much cool whip it still was good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "ballred"
},
"reviewBody": "i also used only an 8 oz container of whipped topping. otherwise this is spot on."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Melsmom"
},
"reviewBody": "Delicious! I used a 12 oz whipped topping and it was a lot, piled up in the crust, so I can't imagine using 16 oz. I also used a pastry crust b/c that's what I had on hand, and it was great. I'll try this recipe again with the graham cracker crust next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "flokwo"
},
"reviewBody": "Simple and tasty dessert- will make again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Andrea Tedder-Riddle"
},
"reviewBody": "This recipe is amazing. My family loved it! I'm taking to my brothers' birthday to enjoy as well!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Laura Smith"
},
"reviewBody": "I used a reduced fat crust, light cool whip and fat free sweetened condensed milk. It was great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "grammaT"
},
"reviewBody": "Not only delicious, but super E-Z! I absolutely LOVE this pie. I got this recipe from my mother in law (well, now x-MIL) a long time ago and make it very often. Like another reviewer, I only use an 8oz tub of Cool Whip (whipped topping). I also prefer to freeze the pie which is great on those hot summer days! Definitely a keeper! Only rated 4 stars as I really think that a 16oz tub of whipped topping would be way too much and take away from the tartness of the lime."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Niccoli Shoemaker"
},
"reviewBody": "I used this recipe with juice from my lime-kwat tree instead of key-limes. The fruits tastes like a cross between an orange and a lime. This recipe is amazing! And soooo easy! I do agree with some other reviews, that if you refrigerate overnight, the flavors really blend better. Thanks for the great recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "tk cooks"
},
"reviewBody": "This is an excellent GF-friendly recipe! Use 8oz pkg. of GF graham crackers and follow the instructions in one of the reviews for making a crust. I doubled the recipe, lined the bottom of a 9 x 13 pan with the crust, used 4 limes &amp; 3 lemons for 1 cup of juice, and used a can of sweetened condensed milk and a can of cream of coconut milk, just as one of the reviewers suggested. Used this for a 4th of July dessert. This turned out so good, I repeated the recipe for a party shortly afterwards, but used 2 @ Keebler Graham Cracker crusts instead. Rave Reviews from guests and there were no leftovers. Try this recipe and do read all of the excellent reviews. The recipe's good bones support a lot of creative modifications. Fast, Easy , Delicious. My husband has been making the classic Key Lime Pie (with eggs, etc.) for over 30 years, and he has decided that this is the family recipe going forward. My thanks to June and all of the great reviewers!! I have one in the freezer right now for dinner tonight."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Valorie"
},
"reviewBody": "SO easy. Took the advice of other reviewers and used 8 oz. whipped topping. Loved the pie. Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CYNDI12"
},
"reviewBody": "This is one great pie! I used fat free condensed milk and light cool whip to lighten the calories/fat up. IT IS AMAZING! My teenage son about ate the entire dessert in 2 days, I did manage to get a couple slices."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "annme"
},
"reviewBody": "Made for weekend get-together-added some real lime juice to crust for the \"what was that\"? taste!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "nikad123"
},
"reviewBody": "I did not like thise recipe because there was no substance to it. It was like eating lemon flavored cream, it would be great as a topping for the actual keylime pie but not as anactual pie in and of itself."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Karla Raquel"
},
"reviewBody": "I also cut back on the amount of whipped topping I added to this recipe. It was easy and good but it was a little too fluffy/soft. I prefer a key lime that has a thicker consistency, like a cheese cake. I would recommend using about 1/3 of the whipped topping otherwise it over fills the pie crust and isn't firm enough."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nicky"
},
"reviewBody": "Super easy, and very tasty--I don't cook so when Ifind a recipe that my family likes everyone is happy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mya"
},
"reviewBody": "Made this a few days ago and man oh man my family LOVED IT! I used freshly squeezed key limes. Followed the recipe and it turned out perfect!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rosemary Armesto"
},
"reviewBody": "Easy and delicious. Thank you."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "AngelM"
},
"reviewBody": "I had this tasty pie at someone's home over July 4th weekend. It was the perfect cool, smooth, tart treat for such a hot day! You can easily adjust the amount of lime to suit your own taste. I also think it would be very pretty with some zest on top. Can't wait to try this simple recipe with other fruit flavors!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Jack"
},
"reviewBody": "This was the worst tasting Key Lime pie I've ever had. A store bought frozen pie has more flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Brad"
},
"reviewBody": "it is the best ive ever had"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "MizKathryn"
},
"reviewBody": "I make my pie like this. Instead of using all 16 oz of whipped topping in pie, use 8 oz in pie mixture, use other 8 oz for topping. Also added tsp lime zest. Put in the oven for 5 minutes to set. It is great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Lenenski Family"
},
"reviewBody": "Even though I only used an 8 oz container of whipped topping, the pie needed more than 1/2 C key lime juice for our taste, so I just kept adding juice until it was tart enough. I made 48 bite-size pies using graham cracker crusts made in mini cupcake pans. These were a hit with our friends. Sometime, I'll try mixing only the key lime and sweetened condensed milk like another reviewer suggested, topping each slice with a dollop of whipped topping."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Stacie Urban Ballard"
},
"reviewBody": "I love key lime pie and looked for along time for a good recipe and this one is it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "bunnyfry"
},
"reviewBody": "This is the best key lime pie I've ever had. It was delicious and not congealed like other key lime pie recipes. It was light and creamy. I used 8 ounces of whipped topping. I think that's what the person who submitted this meant to post. I also used grinded rind from one lime and garnished the pie with lime slices."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mary Ellen Scharff Creech"
},
"reviewBody": "This turned out perfect each time I made it. I have used both fresh key limes and bottled lime juice. Both were excellent. I also substituted unwhipped cream (about 1/2 to 3/4 cup) for the whipped topping."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cori Munafo"
},
"reviewBody": "My family begs me to make this whenever I can. I also make it everytime we have to bring a dish. It gets rave reviews and I am always giving out the recipe. The only problem is that this recipe makes me two pies, which works for me:) I take one with me and put the other in the freezer for my husband. He loves it frozen. SOOOO Yummy!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cori Munafo"
},
"reviewBody": "My family begs me to make this whenever I can. I also make it everytime we have to bring a dish. It gets rave reviews and I am always giving out the recipe. The only problem is that this recipe makes me two pies, which works for me:) I take one with me and put the other in the freezer for my husband. He loves it frozen. SOOOO Yummy!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Susan"
},
"reviewBody": "Have made this several times;always turns out great.The last time I made it,my granddaughter said it would be good as a frozen pie,tried it that way;letting it get firm in the fridge first &amp; slicing it before putting in the freezer,then putting it in the fridge a couple of hours before serving to let it thaw,just a little.It was great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Gracia"
},
"reviewBody": "I bake the crust alone for ~10 minutes before adding contents. This helps counter the mushy factor!. Fantastic and easy recipe. I also make my own whipped cream topping."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "GPOSBORN"
},
"reviewBody": "This is wonderful. I always get asked for the recipe. To decrease the fat, I make my own crust &amp; use light margarine for the crust and use fat free condensed milk &amp; fat free cool whip for the pie filling and it's still wonderful; no one knows the difference."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Heather Rose Arguello"
},
"reviewBody": "Very easy, very delicious recipe. I have made this 4 times now, and get loads of compliments every time. I arrange half of the whipped topping in dollops around the outer perimeter with one big dollop in the middle. This looks lovely and lets the barely-lime green filling show through!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "tpepperbaby"
},
"reviewBody": "This was the first time I made a key lime pie my husband wanted, the last time he had key lime pie was as a kid in Florida said it was better then he remembers."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bezzi44"
},
"reviewBody": "I made this using the fat free cool whip and mixed lemon juice, lime juice and fresh lime juice (what I had on hand). Everyone loved it and wanted the recipe. This is a great \"no cook\" recipe since my oven was broken at the time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "stressedcook"
},
"reviewBody": "I had this recipe years ago when I found it on a key lime juice bottle and then I lost it! I feel like I have found an old friend! Awesome is all I have to say about this pie."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Connie Handel"
},
"reviewBody": "I have made this literally dozens of times. It has become a family favorite and always a hit at summer parties."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "momtortuga"
},
"reviewBody": "I agree with others that this pie is better with a little less whipped topping and a little more lime juice. My husband had mistakenly opened a can of Cream of Coconut which is like coconut flavored sweetened condensed milk. I made 4 pies and used it instead of one of the sweetened condensed milks. It was super. Thanks for this recipe and the other reviews which helped me to come up with my own version of this delicious pie."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mswilson"
},
"reviewBody": "Wonderful and easy. I followed the recipe exact and it turned out great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Barbie Ann"
},
"reviewBody": "Great, fast, easy recipe and my family LOVES it! I have also used 8oz in place of the 16 oz whipped topping and it's still great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Ruingliff"
},
"reviewBody": "Great recipe,though I like my version a little better, I used a half cup of a mix of lemon and lime juice, 10 oz of whipped topping, and14 oz of the condensed milk, I also used my own pie crust, using 10 and a half honey-maid graham crackers, 1/3 cup of melted butter, and 1/4 cup of brown sugar, mix all of it in a food processer, then cook at 375 for 6 min, hope this helps"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "sher"
},
"reviewBody": "This recipe was was quick, simple and tasty. I have made several pies and found that it does taste better using fresh lime juice you squeeze yourself vs. the the lime juice you buy in a bottle. It is a great summer treat and a hit with everyone that tasted it. Enjoy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Carrieh82"
},
"reviewBody": "Not exactly \"world's best\" since it is a shortcut pie and not the original way to make it, but I really do like this pie for a quick dessert. Definitely only use 8 oz. of cool whip in the pie and use the rest to spread on top once it has set if you want too."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Steph"
},
"reviewBody": "This is just O.K., but not fabulous. I like that it is easy and nothing to sweat over. The variation that I prefer is this: one can of limeade concentrate, 1 can sweetened condensed milk (mix together). Whip 2 cups of heavy whipping cream until stiff peaks form. Gently fold in the cream with the lime/milk mixture - do not over mix. Pour into 2 graham cracker pie shells. Let sit for three hours or overnight. This is a fluffy, creamy mousse-type of a pie. Very good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "COURTNEY77700"
},
"reviewBody": "Wow I always make the peak the egg whites and fold mixture. Cook and so on, but this was easy 2 mins to prepare. It has a creamier taste that the others. Thanks for the great recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kecia Shannon-Brown"
},
"reviewBody": "My son loves key lime pie and this is one of his favorites! Just the right amount of sweet and tart. Delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "KATEFOODFUN"
},
"reviewBody": "Good for a quick key lime pie."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "stacie"
},
"reviewBody": "Excellent pie and so easy to make. My guests loved it. Will make again. Thanks"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Laura-Jane"
},
"reviewBody": "I've never had key lime pie before, so I was easy to please. It tasted really nice, but it was quite fluffy. I juiced 10 key limes (and added the zest from two of them). I used the 16 ounces (roughly 500 mls, or half a large tub) of Cool Whip and it fit in my one pie shell perfectly. This recipe turned out as expected, but it wasn't very glamourous. I'd never serve it to company, but it was a nice quick dessert. Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "drgnfly123"
},
"reviewBody": "This pie is delicious and SO easy! I did, however, make it with just a small container of whipped topping (8oz) - a large would have been too much. It is really great put into the mini individual pie crusts as a special dessert and topped with some whipped cream."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sunnygirl"
},
"reviewBody": "EXCELLENT! I would change a thing! However I cut the recipe in half and it was enough to fill a 9 inch shortbread pie crust. Next time I will try adding a touch more lime for the bitter taste. My fiance LOVED it and I will be baking more!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Ghenghis"
},
"reviewBody": "Sorry, this is NOT how you make this recipe. It takes only one 8 oz. container of whipped topping i.e Cool Whip to make this recipe correctly. 16 ozs. of filling makes enough for two pies, and is too fluffy and not near tart enough to be considered for \"world's best.\" \n\n1/2 cup lime juice\n1 can sweetened condensed milk\n8 oz. Cool Whip\n\nThats it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Chef Mommy"
},
"reviewBody": "This one is defintely a 5 star. I made one for the ladies at work and they said it was excellent ! I added one teaspoon lime zest because I just love that tartness of the pie. I will defintely make this again in the very near future."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Melissa"
},
"reviewBody": "Very yummy!! Simple to do with not a lot of ingredients."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "NicoleChambers"
},
"reviewBody": "best key lime recipe ever!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Renee"
},
"reviewBody": "This recipe is great and fast to make\n\nI have been making this recipe for years. The only thing different I do is use an Oreo cookie crust. Yummmm"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jake"
},
"reviewBody": "This recipe was great! I followed \"ISLANDHALFBREED\" 's variation and it turned out wonderful! It was a major hit on Thanksgiving!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Keona Solorzano"
},
"reviewBody": "I prefer my key lime pie more firm and less fluffy. However, it is very tastey and easy to make. I added a little more lime juice as we prefer a less sweet and more sour taste."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jessica Stinson"
},
"reviewBody": "I wanted a fluffy key lime pie-- not the standard egg, sweetened condensed milk, lime juice-- bake it up kind. And this was very good. I didn't have key lime juice so i substituted regular lime juice and a little lemon juice. I will do full strength lime/key lime next time as mine wasn't pucker-y enough. This is good frozen or out of the fridge. Thanks"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KATRICK123"
},
"reviewBody": "Easy and fast- I add more lime and try to get pulp in the mix to give it a more authentic taste"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Candice"
},
"reviewBody": "I'm four months pregnant and CRAVING key lime pie--this was perfect! Just the right balance of tartness and sweetness. Very creamy and VERY EASY to prepare! I'm gonna try fat free milk and cool whip next time and see how that does. YUMMY!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Teff"
},
"reviewBody": "Fast, Easy and Delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nancy"
},
"reviewBody": "This recipe is so easy!! I also put a couple drops of green food coloring in it. Keep it in the freezer and serve it right from there. It's like ice cream!!\nDELISH!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kat"
},
"reviewBody": "Wow, I can't believe how good this was! My husband loves key lime pie and he thought this one was great! It was a little too tart for us, but we after we topped it with more cool whip, it was perfect! I will definitely make again!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JEDSTANLEY"
},
"reviewBody": "Made this for a dessert social at church and saw lots of people with a slice on their plate. I only brought home one small piece! I especially liked this because its easy and doesn't require a lot of ingredients."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Amanda"
},
"reviewBody": "I make this dish a bit differently. I pour the key lime juice and condensed milk mixture into the pie crust first (rather than mixing it with the topping). Then I mix a small container of heavy whipping cream with half a tub of whip cream and add 4 oz of cream cheese for a yummy topping. Then I add a lime twist on top for garnish. This is best if you prepare it the day before and let it set in the fridge over night. Super quick. Super easy. Always a crowd pleaser."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This really is a delicious, easy recipe! I've made it many, many times this summer, and even those who thought they didn't like key lime pie raved about it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SGOOLSBY"
},
"reviewBody": "Awesome &amp; easy. Great pie/great recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I have used this receipe for years, although I like squeezing half a fresh lime in the mix, just for a bit more tart taste....my children like adding green food coloring...I always am asked for the receipe and they are always surprised at how easy it is....."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "AmberJo"
},
"reviewBody": "This is a recipe I come back to over and over again. I do believe the 16 oz frozen whipped topping is a typo and always just use 1 - 8oz container of cool whip. Every time I bring it somewhere, I get such wonderful compliments, and it's so fast and easy! Sometimes I use a lime wedge and mint leaf for garnish, or a regular baked pie crust. No matter what, this recipe works."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "LAM624"
},
"reviewBody": "Good pie-easy to make. You have to like the very strong, very tart flavor of limes to like this pie. Also, garnish with whipped cream to tone down the tartness."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Beth Stone Strachan"
},
"reviewBody": "Amazingly simple...and amazingly delicious! We added lime zest and a little green food color to enhance the taste and appearance. Will definitely make this again. Would like to try lemon juice/zest next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Not nearly as good as the traditional recipe but not bad either. True key lime pie aficianados will notice the difference."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ICHELEY"
},
"reviewBody": "I use this recipe all the time and I love it. I use key lime juice for it, about 2 x the amount that it calls for b/c I love the tart taste. I've also decreased the whipped topping in half and added lime zest before. \r\nInstead of putting it into a full sized graham crust, I use mini phyllo pastries to make individual portions (usually makes 3-4 boxes worth!) \r\nOccasionally with the left overs I add crushed strawberies or raspberries to make fruit dip. \r\nIts always the first to go in any buffet!"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/15808/worlds-best-key-lime-pie/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/367/desserts/pies/",
"name": "Pies"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/15142/desserts/pies/no-bake-pies/",
"name": "No-Bake Pie Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/15808/worlds-best-key-lime-pie/",
"name": "World&#39;s Best Key Lime Pie"
}
}
]
}
}
, "about": [
]
}
]