				
[
{
"@context": "http://schema.org",
"@type": ["Recipe"]
,"headline": "World&#39;s Greatest Vegetable Broth"
,"datePublished": "1999-08-18T17:42:43.000-04:00"
,"dateModified": "2023-02-26T15:17:29.385-05:00"
,"author": [
{"@type": "Person"
,"name": "Tom West"
,"url": "https://www.allrecipes.com/cook/24328952"
}
]
,"description": "This vegan broth is made with caramelized roasted vegetables, fresh parsley, garlic, and black peppercorns for 2 quarts of broth with terrific flavor."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/HaIOedO-L7H8zBy8GYSGNWRlEzA=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/14033-worlds-greatest-vegtable-broth-ddmfs-3X4-1525-8686d514ed8743a793a33215261f3678.jpg",
"height": 1125,
"width": 1500
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "World&#39;s Greatest Vegetable Broth"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.7",
"ratingCount": "132"
}
,"cookTime": "PT90M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "133 kcal"
,"carbohydrateContent": "23 g"
,"fiberContent": "7 g"
,"proteinContent": "4 g"
,"saturatedFatContent": "1 g"
,"sodiumContent": "132 mg"
,"sugarContent": "11 g"
,"fatContent": "4 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT30M"
, "recipeCategory": ["Dinner"]
,"recipeIngredient": [
"1.5 pounds sweet onions, peeled and cut into wedges",
"1 pound tomatoes, cored and quartered",
"1 pound carrots, cut into 1-inch pieces",
"1 pound green bell pepper, cut into 1-inch pieces",
"0.5 pound turnips, cubed",
"2 tablespoons olive oil",
"1 pound celery, cut into 1-inch pieces",
"1 bunch fresh parsley, chopped",
"3 cloves garlic",
"6 whole black peppercorns",
"3 whole cloves",
"1 bay leaf",
"1 gallon water" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Preheat the oven to 450 degrees F (230 degrees C)."
} ,{
"@type": "HowToStep"
,"image": [
{
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/DitayNJqpiaElf7-NBNUeZ-PAVw=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/14033-worlds-greatest-vegtable-broth-ddmfs-Step1-1450-4x3-a9f51ab4c74b441ab3da868959ea8291.jpg"
}
]
,"text": "Place onions, tomatoes, carrots, bell peppers, and turnips in a large roasting pan; drizzle with olive oil and toss to coat."
} ,{
"@type": "HowToStep"
,"image": [
{
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/eo4-nYnnPO2OHimeW7yq5M3fP7U=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/14033-worlds-greatest-vegtable-broth-ddmfs-Step2-1479-4x3-3bc255b60bc34f14b83b3c3929603f4c.jpg"
}
]
,"text": "Roast in the preheated oven, stirring every 15 minutes, until vegetables are tender and onions are caramelized, about 1 hour."
} ,{
"@type": "HowToStep"
,"image": [
{
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/6gfQ6QUOk0rnFLlxB9fan2lvsWo=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/14033-worlds-greatest-vegtable-broth-ddmfs-Step2-1512-4x3-4934dcc7c24c4beebb0b86aa8cde92a5.jpg"
}
]
,"text": "Transfer roasted vegetables into a large stockpot. Add celery, parsley, garlic, peppercorns, cloves, and bay leaf. Pour in water and bring to a boil over high heat. Reduce heat to medium-low and simmer, uncovered, until liquid is reduced by half, 20 to 40 minutes."
} ,{
"@type": "HowToStep"
,"image": [
{
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/qobhASfvGnCzXuQE0eeRs7dpIZ8=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/14033-worlds-greatest-vegtable-broth-ddmfs-Step3-1517-4x3-c07911d165194a80b40777326e383949.jpg"
}
]
,"text": "Strain broth into a large bowl, reserving vegetables for another use."
} ]
,"recipeYield": ["8"]
,"totalTime": "PT120M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "abbasfahmy"
},
"reviewBody": "The amount of water to be added is incorrect (way too little) for the recipe.. \nAnyone noticed this?"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Stacy Martin Alexander"
},
"reviewBody": "It is very good. I always make a lot so that I can give half to my vegetarian daughter. I pretty much throw whatever veggies I have into it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Erica Bazan"
},
"reviewBody": "It came out very sweet and flavorful. It's very concentrated so it will stretch by just adding some extra water. I make my homemade mushroom soup with this. I do want to know nutrient stats for this broth. I am dieting and use a calorie counter monitor and can not accuratly log this."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Darren Sanchez"
},
"reviewBody": "My wife loved ot"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MommaHen"
},
"reviewBody": "I didn't change or tweak this recipe because many of the reviews advised against it. I love this broth. It was getting late and I was tired but it had not reduced enough so I put it in my slow cooker on low before I went to bed and in the morning it was done. Wow, it came out awesome, rich and robust. This is going to be my go to for all my soups now, especially my fall squash and pumpkin. Thanks for sharing it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Hariet Brown"
},
"reviewBody": "I came across this recipe by chance while searching for the perfect broth to make for our neighbors across the street. The husband, Christopher, is a big soup guy, so says his wife. Well, needless to say, the pressure was on! When I saw this recipe I thought, “how could I pass up on what is potentially the WORLD’S best vegetable broth??” Now, I know Jim’s a big meat guy too, really huge in fact. That family may as well have a fridge AND freezer made of meat with how much he’s hauling home. But I didn’t let that deter me. The other reviews let me know the ins and outs of how to spice things up a bit (thanks all!), even after the whopping SIX whole peppercorns. I first read as six bay leaves, jeez what a mistake that would have been. \nA half hour into simmering and my two boys mouths were watering while we waited. In the end it was a great broth, although Christopher and Sherry never made it over to try it themselves. Added little tortellini’s for the kids."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Terina Heidelberg"
},
"reviewBody": "Super! Loved the flavor and will make it again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mary Dynda"
},
"reviewBody": "I put a smaller amount of black pepper in, and no tomatoes . It is very good !"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Samsou22"
},
"reviewBody": "I will never make vegetable broth without roasting the vegetables first. This is, hands down, the absolute best veg broth recipe. I freeze it in small mason jars and often add it to whatever I am cooking that requires liquid."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "maggy08"
},
"reviewBody": "I dont use the olive oil trying to make it clean - other than that perfect. Have made this many times."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "coreoposis"
},
"reviewBody": "Excellent broth recipe however, be aware, this is a labor of love. \n\n1) I started at 1:30 pm and finished at 6:30 pm. Don't even think of using a crockpot. Plan accordingly\n2) The end result is a flavorful liquid. It's not intense because it's not full of salt like the box and can versions are.\n3) Make sure you cut your veggies in uniform sizes so they take the same time to roast."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tammy Brideau"
},
"reviewBody": "Outstanding! thank you for this recipe it's a game changer for me now."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "RonGoings"
},
"reviewBody": "added red cabbage"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lee"
},
"reviewBody": "Excellent recipe. I freeze the broth in jumbo muffin tins, with jumbo muffin silicone inserts; when frozen, the cubes (6 oz) pop right out of the inserts. I use 2 tins (12 inserts) so that I can freeze more at one time. I wrap them in cling type plastic wrap, then put them in freezer bags; they keep for months with no problems."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Janet"
},
"reviewBody": "Lotta chopping, but worth it!! and roasting the veggies beforehand was the key, I think. I added a couple of parsnips, a bunch of fresh green beans, and an extra clove of garlic (which I added to the roasting veggies.) The tomatoes were from my garden. I also added 1 tsp of salt. That's all!! It's a winner!! And I'm glad I found it, because my beautiful granddaughter is a vegetarian, and will enjoy this more than the silly frozen veggie patties I have had to serve her. Yay!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "debra lussier"
},
"reviewBody": "Yes. Absolutely delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "ChickinStew"
},
"reviewBody": "We sorta use this recipe. We save all our vegetable clippings in a ziplock bag in the freezer and every so often we'll follow the roasting directions in this recipe. It's a great method and the broth is delicious. Make enough so you can freeze the leftovers."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Eilidh"
},
"reviewBody": "Was sooooo good!! Will make it again!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Eileen Lavoie"
},
"reviewBody": "I made this exactly the way it says, absolutely delicious! The best vegetable broth ever."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "LD Meyer"
},
"reviewBody": "I add bay leaves, garlic and cloves, in a crockpot on low for 16-18 hours. Strain it and fill glass jars about 4/5 full and freeze, it keeps quite well."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Melvin K. Joshlin"
},
"reviewBody": "Didn't use cloves or turnips added broccoli,cilantro,0nion &amp; garlic powder and tumeric"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LindaNJ"
},
"reviewBody": "So I made a couple of adjustments. :) First, I roasted an entire bulb of garlic before adding it to the water and roasted vegetables. After I reduced the broth, and this takes many hours, I puréed half of the veggies in my Vitamix blender. That gives the broth a little more substance."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Trixyinaz"
},
"reviewBody": "Loved it. I was not sure how all these veggies were going to fit in my giant pot, but after roasting them, they shrunk and fit perfectly with room to spare in the pot. I doubled the recipe because I was using some of this broth to make Crushed Lentil Soup - Lebanese style and I wanted leftovers to keep in the freezer. I juice fast and like having something hot to sip on and this broth hit the spot.After I strained the broth, I didn't want to just toss the veggies (I'm fasting and wouldn't be eating them) and \"waste\" the juice/broth that was in them so I decided to run them through my juicer to \"squeeze out\" the broth. Got an extra 7 cups of broth. YUMMY!!! \n\n\nBTW, My husband LOVED the crushed lentil soup so I will definitely continue using this broth as its base. Thanks for a great broth. The only thing I added was a bit of salt. Will make again. Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Diane Gruppuso"
},
"reviewBody": "This is wonderful and in my opinion the best vegetable stock is make with roasted vegetables. You can be creative and add your favorite herbs toward the end of roasting too (I love a little rosemary in mine). I like to cook mine down a little further than half for more richness but it's not necessary,"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Su Russo"
},
"reviewBody": "I'm not sure about it being \"The World's Best\", but it was very good. I used fresh veggies from the garden, and it was loaded with flavor. Thank you for the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "RawWarrior"
},
"reviewBody": "Added potatoes instead of turnips. Yummy"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "dfreed02"
},
"reviewBody": "This is the best broth recipe ever. The flavor is so good you can just drink it and it's an awesome base for any recipe...if you are cleansing or dieting this should be on your list as a pick me up. Ironstone garlic with the other veggies. You can eat the veggies cold on salad, as an addition to pasta or rice...or the best is puréed as a low cal gravy!!!! This is in my top ten recipes! I consider onions, carrots, and celery the Trinity of cooking unless I go NOLA then it's onions, peppers and celery!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lizblaise"
},
"reviewBody": "So it's a lot of time to make this, but it was delicious. I modified the recipe using veggies on hand (no turnips but asparagus, broccoli). After it straining I pureed the veggie chunks and added them back to the broth with black beans, corn (fresh off the cob)and a can of diced tomatoes (drained). The result was a delicious creamy all veggie soup that my family loved. Served with crusty baguette and we are all set."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "PATTIMAC2000"
},
"reviewBody": "tried it twice, without the turnip... made a huge batch the second time, canned it with my pressure cooker in quart jars. use it for rice and soups, or when ever I need broth. great recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lena May"
},
"reviewBody": "This stock was excellent and easy to make. After stock cooked down, I took vegetables out and pureed in my food processor. I added back in the pureed vegetables, added a can of diced tomatoes with garlic and basil, some kale and white beans and a dash of red pepper flakes. This made a really great soup. Excellent and thanks for sharing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kimberly"
},
"reviewBody": "Really good stock! This is a HUGE recipe though - I do a lot of cooking, and I do not have a pot big enough for this stock! I used both of my soup pots, and that worked. It is an awful lot of shopping and chopping and peeling for a couple of ice cube trays of stock in the end, and I think the veggie puree will take longer to use up than the stock itself. Next time I would use only two cloves instead of three, I would replace the green peppers with yellow or orange ones, and I would not add more turnips than called for. Overall, very healthy and tasty stuff."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Beth Wheeler"
},
"reviewBody": "I'm on my first day of a liquid fast using Almaded protein shakes, and they recommend drinking homemade vegetable broth to help with hunger between shakes, so I Googled and found this recipe.\n\nI started simmering this about 45 minutes ago, and couldn't wait to try it because I'm a bit hungry (mid-afternoon). The broth is already very flavorful, am eager to taste the final result! I added a can of diced tomatoes, 1 parsnip, 3 zucchini and 1 large sweet potato to what the recipe calls for. I also added lots of rosemary and garlic powder to the veggies as they roasted. To the soup pot I added minced garlic instead of whole cloves, and ground cloves instead of whole because that's what I had on hand.\n\nEDIT 2/9/2014: I added balsamic vinegar after cooking, and it gave it an amazing zing to the already delicious flavor. The veggies taste fantastic, and I'm going to puree &amp; freeze them to add to future soups, sauces and dishes. I will use this same recipe again and again, chopping the veggies smaller and adding proteins and grains for a complete meal."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jocelyn DiMarco"
},
"reviewBody": "True to its name, this IS the Worlds Greatest Veg broth.\nI've been using this recipe for almost eight years now, in fact i very rarely make chicken stock anymore which is a blessing because this is so much easier (and cleaner) The only change I make is I like to include sweet potato. and instead of just tossing the veg in olive oil I use a mixture of olive oil and tomato paste, it gives it more richness."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Anne Cassens"
},
"reviewBody": "Awesome, complex flavors are a perfect blend."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Meredith C."
},
"reviewBody": "I've made it twice now. I use whatever vegetables I have on hand, even rhubarb! I use this recipe as a guideline - I added ginger and tumeric, garam masala, and tumeric and left out the bay leaves the second time. Way super good! I like this recipe more than others; I think it's browning the veggies first that makes the difference."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "dlj"
},
"reviewBody": "Made this as the broth for my matzo ball soup as my vegetarian son can't eat chicken soup. The whole family loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jqt13"
},
"reviewBody": "Yum! Based on the positive reviews, I made a double batch. I didn't use any oil and roasted a half head of garlic with the vegetables. Used cilantro in place of parsley. Tastes even better the next day."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Becky"
},
"reviewBody": "This made a very rich broth. I followed the recipe exactly except for using slightly less tomatoes and bell peppers, just using what I had on hand. I think the broth is much richer and more flavorful than canned, so you can get by with using less in your recipes. I used only half as much as called for in a vegetable soup recipe, and added water for the remainder. It turned out just fine. Don't let the vegetables go to waste. I puree them, and then freeze them by scooping 1/2 cup of pureed vegetables into snack size baggies. I add one of these portions anytime I make a soup, stew, or even spaghetti sauce. It gives some added flavor and nutrition."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "liuzard9715"
},
"reviewBody": "Loved this broth! I have always made my own chicken stock, but I am trying to cut out the cholesterol from meals so I opted to try to make my base for soups and rice with a vegetable base instead. I followed the recipe mostly but I did add a some garlic power and additional garlic cloves. I did not have any cloves so I substituted with some allspice. Just a suggestion, make sure that you have atleast 4 &amp; half hours to spend on this because it takes over an hour to roast all of the vegetables and about 3 hours to reduce the broth down."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "laurelamanda"
},
"reviewBody": "This broth is amazing. In the interest of laziness and maximum flavor, I stew the roasted vegetables with the water and other ingredients in my slow cooker for a few hours before reducing the broth. Less stove watching, but it still produces a really rich and flavorful broth."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Sylwia"
},
"reviewBody": "I made this broth the other day but in a hurry didn't read that I need to roast the veggies first. So I threw them in a bot and cooked them. I am sure they come out even better than what I did when you first roast them but even just cooked this broth has amazing flavor. I just used it as a base for the Beaker's Vegetable Barley Soup and it turned out very yummy. Next time I will roast everything first though. will make again"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Scott M"
},
"reviewBody": "This is my favorite vegetable broth recipe. I make this in a half portion, and then freeze for future recipes (like potato soup, etc)."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "6kitties"
},
"reviewBody": "Wow, this is good! On my second batch I added celery root, brussel sprouts and broccoli. Also roasted the garlic along with the other veggies. Added a good amount of red wine to the water, too. After reduction added some porcini salt and balsamic vinegar. Used it to make a wonderful lentil soup to which I added a bit of truffle oil just before serving. Thank-you Tom! :-)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "steflynne66"
},
"reviewBody": "I am a beginner cook and I came on here looking for recipes that are low sodium that I can make for my Mom. I made this broth to use with a favorite dish of my Mom's, Potpie. She loved it. Thanks for the recipe. Will be using this one often."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cyngamgam"
},
"reviewBody": "This was delicious! It is now my go to vegetable broth. I do find it to be a little on the sweet side. I use it to cook my lentils although it does make them a tad sweet."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "hotsun"
},
"reviewBody": "Finally a broth that works for me! It tastes wonderful, made it with no changes. I did find it took much longer to make because my pot was too high and didn't condense quickly enough. Will definitely be making it again"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Veggiebee"
},
"reviewBody": "Tasted great, but do take the time to reduce it. If you're taking the time to roast the veggies and make broth from scratch, just do the whole deal."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ladyhkaz"
},
"reviewBody": "Excellent stock. I like to make lasagna and egg rolls with the left over veggies. I use whole pasta or egg roll wrappers for the lasagna. Season the pulp separately depending what type of recipe it is."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Connelly"
},
"reviewBody": "If you would like for this broth to be a bit thicker and heartier, I suggest you save the water you used to boil some pasta and use it to simmer the vegetables for this broth."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "pajamann"
},
"reviewBody": "This is a rich, delicious broth and has ruined me for any other vegetable broth. It freezes well, too. Make plenty and freeze some since it is a bit time-consuming (but well worth the effort!). Thanks so much for sharing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "oneolddawg"
},
"reviewBody": "Wonderful vegetable broth. Took it a step further....leave all the veggies in, add 1/2 cup of barley, 1 cup water, 1 cup kidney beans. A great vegetarian vegetable soup...."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Icook"
},
"reviewBody": "Very good!\nThe leftover veggies were adictive with a little bit of salt added"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cmnbbox"
},
"reviewBody": "very good"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "G-Ma of 16"
},
"reviewBody": "Excellent! Are the turnips used to kind of replace potatoes? Also I think if I can find them, Rutabaga would be good to add, or to replace the turnips with. They are a bit sweeter than turnips. Also if you puree the vegetables , they make a great addition to meatloaf or meatballs."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "gluten.free.veg.me."
},
"reviewBody": "this recipe is so great. there are no good vegetable broths on the market that don't include some form of gluten, and being a vegetarian, good broth is crucial to so many recipes. this one is not only delicious on its own but versitile, adding complexity and depth to everything from soups, curries, quinoa, and risotto! so good. regardless of what others said this was not difficult considering the servings yeilded and the ease of freezing for later use. \r\n\r\ni like lots of garlic so i add 3 cloves to the roasting pot in addition to the 3 original cloves. i also pureed the veggies once cool and made a pretty killer curry out of them. thank you for sharing this recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "zeezeebaker"
},
"reviewBody": "Delish!\nI had to tweak the recipe a bit (I can't eat cooked carrots and didn't have any turnips), but it still came out well.\nI used the broth to make Spicy African Yam Soup (from this site). It was great. I have a number of food intolerances, and making my own broth will give me so many more cooking options. Yay!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "oinkette"
},
"reviewBody": "The title says it all! I made this broth while on a juice/liquid fast and it was absolutely wonderful. I liked it so much, I made it even after my fast was over."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Michelle Rogers"
},
"reviewBody": "Pretty tasty and easy to make. For the vegans who cannot due garlic or onion due to religous beliefs add other hearety veggies."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carie"
},
"reviewBody": "It was extra work, but totally worth it! Smelled great while it was cooking! When it cooled down I kept filling up ice cube trays with it and freezing small portions so I can drop one into cube easily into a pot and use it in small doses! I would make again in a heartbeat!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "amymeri"
},
"reviewBody": "A lot of work but delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SLJ6"
},
"reviewBody": "Another 10 for taste, ease, cost, and fat/sodium control. Made 6 2c. containers for the freezer. I had no turnips on hand though. I also subbed the green pepper for a red, and added an additional 1/2 of a red onion, 3 cloves of smashed garlic, 2 bay leaves and some thyme as well...used up what I had. I slow simmereed this for hours and saved the veggies at the end. I ended up putting these veggies through my food processor for a few seconds and adding this wonderful roasted puree to my pot of chicken soup for extra flavor and veggie value...Wonderful! Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sarah Jo"
},
"reviewBody": "This IS the World's Greatest Vegetable Broth. Totally saved my behind this week as I'm low on cash and can't afford boxed/canned organic broth. I did cheat a bit and used two week's worth of trimmings (I throw my trimmings in ziploc bags, then use them in the recipe for the broth later) from vegetables in with a small amount of the called for vegetables to fill in what I needed for the broth and I did use one drained can of organic diced tomatoes only because I could not afford fresh tomatoes. That's a cheap way to really use the most out of the produce you buy and really get a super flavorful broth. Thank you so much for sharing this recipe--this was an absolute lifesaver for me. Next time, I'll try this with a few pieces of chicken wings to get a homemade vegetable-chicken broth. NOTE: MAKE SURE YOU REDUCE YOUR BROTH. That's a key step. Do not skip it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "JaJireh"
},
"reviewBody": "This recipe came up on my igoogle daily rotation of recipes from this site. It caught my attention immediately, even though we are not vegetarian. It simply sounded like a hearty broth with which to cook rice, or use in a future soup/stew, etc. Well. I am VERY impressed with the hearty flavor this broth produces! It is aromatic as it simmers all day, and easy, easy to produce. I've 10 cups of broth, 8 in the freezer, and 2 for tomorrow's meal; three cups of vegetables to munch on, and three cups in the freezer for future use in a stew. Here is why I only gave it a four star: the broth is missing salt. While I understand the reason WHY no salt (allows the broth to be used in a recipe without adding additional), I would still have to add it, were I to use this as a warm drink on a chilly night (it's that good!) One last note: I added 1/2 a head of cabbage to the mix, as I had it on hand. A great addition. SUPER RECIPE, Tom!! Thank you! :D"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tom W"
},
"reviewBody": "One user made it in a crock pot and said it was bland. The instructions say to simner it and reduce the broth by half. No wander the broth was bland, the crock pot still had all that extra liquid in it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nikolette T"
},
"reviewBody": "I love this recipe. I usually just roast everything but the garlic together and find it comes out great. Once I roasted small pieces of garlic and they scorched, I don't know what I was thinking! I've also roasted an entire head and it didn't burn at all, then I used the extra for a roasted garlic bread.... delish! I've used the roasted vegetables to blend up, season and make a vegan pate for crackers. I've also added cream cheese and seasoning and made a cheesey vegetable dip. Proper seasoning is what gets good results if you choose to use your left overs that way. I dabble with different herbs and seasonings each time and it always goes well. I use the broth as a base for a lot of asian soups. Its great for stock in pot pies and supurb seasoned and eaten on its own. I have given out this recipe several times and its always a crowd pleaser. The best part is that its so simple to wash the veggies, clean them, give them a rough chop and pop 'em in the oven, roast, simmer, strain and eat. Freezes well too, of course. Depending on what I'm using the broth for I sometimes add extra ingredients, more tomatoes, more onions, less turnip (NEVER omit the turnip, even if you don't like them they add an important balance and the flavor does not impart a \"turnip-y\" taste at all), halved crimini mushrooms, etc etc. This recipe is great because it seems to invite exploration. I think it truly is the World's Greatest Vegetable Broth!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "GRAYCE"
},
"reviewBody": "I use this technique to make my broth. When I cook thruout the week I keep a plastic bag in the fridge filled with all the peelings &amp; cut offs from the veggies I've used all week. This includes onion &amp; garlic skins &amp; all the items in the fridge that look like they're ready for vegetable heaven. If the bag doesn't look full enough I put it in the freezer until I have a \"BIG\" bag full. It never tastes exactly the same but it always tastes good. I store some of the broth in small baggies for portion control and use those for gravies &amp; other recipes that need 1 cup of broth. The rest in a large bag for soup. A Chef taught me this."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Stacey Rudolph"
},
"reviewBody": "I love that I can use up veges for my soups! I always have extra veges in the fridge, and didn't think about using them to flavor it. I don't really like eating all the veges, but the flavor is great when sauteed and strained. Mmmm!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Murphy"
},
"reviewBody": "This broth was okay. I think since I'm not a huge fan of cooked carrots and celery, that did it in for me. My boyfriend liked it a lot though."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Nancy Swidas"
},
"reviewBody": "I liked this soup alot. The only change I made was I didn't add turnips but I added a roast to it. Making it a beef/veg soup. I think it is rather bland so next time I will add more spices. I will make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Bekkah"
},
"reviewBody": "A very good broth. I used a yam instead of turnips and added 2 Thai chili peppers, but otherwise made it pretty much as described. The yam made the soup quite sweet and I had to add a considerable amount of salt to cut the sweetness. The chilis were VERY hot and made the soup quite spicy which I personally loved, though others may not. I added extra of all the spices (pepper, clove, garlic) and I think that without the chilis, I would not have liked this soup very much (I think it would have been too bland) which is why I'm giving it 4 instead of 5 stars. But the combination of sweet, salty and spicy made the soup quite good. I ground up the veggies the next day and mixed them with oatmeal and eggs and made a ton of veggie burgers which were delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bake-o-rama"
},
"reviewBody": "I made this to use for my Thanksgiving turkey stuffing. I added mushrooms because I love them. Going to chop and freeze the leftover roasted veggies to use in turkey meatloaf."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "The Sanguine Chef"
},
"reviewBody": "Absolutely the best - adds rich flavors to recipes. Originally I made it to brine a turkey - worth the work."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I add my superlatives to everyone else's. This recipe certainly takes longer, but there's no substitute for the flavor imparted by roasting the veggies first. \n\nSlight modification: I added about a fist-sized sweet potato to the recipe, too, and used fewer tomatoes than called for."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "TampaZeke"
},
"reviewBody": "As a recently converted vegetarian I really loved this recipe too. It's richness of flavor satisfies my occassional meat tooth. I too cut back on the parsley (not a big fan). I also added a few DRIED Shitake mushrooms which gave the broth an even richer and more meaty (beefy) flavor. I know that isn't something that longterm vegetarians care about but it might be helpful to meat eaters who want to become vegetarians but need a flavorful way to wean themselves from the flavor of meat."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Veg*n Mom"
},
"reviewBody": "I made the broth as directed. It is really quite nice - the flavor is wonderful. I'm using it as a base for a kale and white bean soup recipe elsewhere on this site.\n\nAs others have mentioned the roasting vegetables create a lovely aroma. Recommended!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CNM CATERING"
},
"reviewBody": "THANKS FOR THIS RECIPE I NEEDED VEGETABLE BROTH FOR MY TURKEY BRINE. I USED THE LEFTOVER BROTH AND VEGGIES TO MAKE A POT A SOUP FOR MY KIDS."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "rltaylor"
},
"reviewBody": "This veggie broth turned out great! However, I'd recommend only roasting the vegetables in the oven for about 1/2 an hour. The veggies would have been burned if I would have cooked them for over an hour as the recipe listed. (My oven is calibrated correctly)."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Marie"
},
"reviewBody": "I made this in a crock pot all day and the broth came out too bland for me to eat by itself. I ended up using it for veggie pot pie which was tasty."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "JESSICA D."
},
"reviewBody": "I didn't think this vegetable broth was as impressive as the other reviewers, it was good but... I didn't have clove but I can imagine that would be the difference between okay and great. The vegetables roasting made the house smell really good which was nice."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "BARNKITTY"
},
"reviewBody": "Roasting the veggies gave a nice caramel color and rich flavor. No turnips or gr. peppers, but still lots of good taste."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "trooworld"
},
"reviewBody": "This is very good, I made it as it was written. Make sure and reduce it down or it will not have much flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "VIVACLEO"
},
"reviewBody": "Loved it. Absolutely loved it. I'll never buy canned or boxed broth again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CHESSDILORENZO"
},
"reviewBody": "Loved this! I make lots of risotto, so this is a perfect recipe for me. Also, I purée the leftover vegetables and add them to a spaghetti sauce for later meals."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Addie"
},
"reviewBody": "Making this broth made my apartment smell great! It was great for risotto, when the most important thing is the broth. I made a double batch, reduced it by half, and then froze it in ice cube trays."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sininen"
},
"reviewBody": "I can't decide which is better: The smell of the roasting vegetables through the house or the taste of the broth! Very good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KEZ"
},
"reviewBody": "I roasted the vegetables the night before on a spare shelf in my oven when I was making dinner. Then made the broth the following day. Used as a base for carrot and coriander soup II from this site and froze the remainder in ice cube bags. Will definitely keep this in my freezer full time. Thanks."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CarolAnn"
},
"reviewBody": "the name of the recipe says it all. this was a very delicious broth. I basically diced my veggies pretty small to use in a stuffing later, so as much time in the oven wasnt needed overall, but I can tell you I used this broth for a goose brine http://thanksgiving.allrecipes.com/az/TrkyBrin.asp for Christmas dinner. The goose, the stuffing and the gravy (using the drippings from the goose) were eaten all on Christmas day.. no leftovers :("
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Acookfromdallas"
},
"reviewBody": "This was OK. Didn't see what all the fuss was about."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KRPINT"
},
"reviewBody": "This made a great soup base. I put it in icecube trays to use as needed!\n\nI pureed the left over vegetables and added some milk to make a quick soup."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "SueSLP"
},
"reviewBody": "Great broth. I used it in a delicious minestrone soup. Richflavor and aroma. I think next time I would reduce the parsley."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CATWALK16"
},
"reviewBody": "Very good, I will make this again. I froze it in ice cube trays and use them as needed, very handy and so much more healthy than the cubes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Guanaco"
},
"reviewBody": "This vegetable broth really lives up to it's name. I made a batch today, and it was by far the BEST broth I've ever tried. It took a little extra time than a normal vegetable broth does to make (due to roasting the vegetables), but the result is so rich in flavor---I can't see myself using my old broth recipe ever again. I can't wait to use this as a base for cooking legumes and rice, as well as a soup base."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "TULIP22BLUE"
},
"reviewBody": "this really is the world's greatest! I made a huge batch and it froze really well too."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "AMMYBUG"
},
"reviewBody": "What a beautiful flavour! The cloves, I think, really added something special. My only critisism might be that I could deal with a little less parsley. Thank you very much. This was great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Caroline C"
},
"reviewBody": "You simply cannot beat home-made broth. While it is rather time-consuming, there's nothing like the aroma and flavor of making it yourself. I usually omit the turnip, and green pepper, and only roast the veggies if I have time (otherwise I just pop them in the pan raw), and it still tastes fantastic. Also, I roast the bones, carcass, left-over skin and meat of a chicken or turkey, and add that to the vegetables. I simmer this gently for 2 hours, and it is fantastic."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KEEPERROX"
},
"reviewBody": "After straining, I added 1 can of diced tomatoes, with juice, 1 can dark red kidney beans, and 1 can Cannelini beans, and brought it back to a boil. Then I added 1 cup of Pastina shaped pasta, and cook it for 4 minutes. It made a great hearty vegetarian soup, and I got some protein in there too! Thanks Tom, for this great broth!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "NIKCOOK"
},
"reviewBody": "really tasty, the best vegetable soup I've had. it takes alot of time but dang it's good. I used the broth to cook rice, on chicken it was all good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Takes time, but it's easy. Well worth the effort. I used this as a base for vegan black bean soup (also on this site) and it was delicious. Full of flavor-not at all like store-bought!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Mmmmmm! Excellent to have around. I enjoy making this broth and love to cook with it."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/14033/worlds-greatest-vegetable-broth/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/94/soups-stews-and-chili/",
"name": "Soups, Stews and Chili Recipes"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/171/soups-stews-and-chili/broth-and-stocks/",
"name": "Broth and Stock Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/14033/worlds-greatest-vegetable-broth/",
"name": "World&#39;s Greatest Vegetable Broth"
}
}
]
}
}
, "about": [
]
}
]