				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Yummy Tater Tot Casserole"
,"datePublished": "2019-04-02T02:51:10.000-04:00"
,"dateModified": "2022-09-27T21:11:14.000-04:00"
,"author": [
{"@type": "Person"
,"name": "jana michelle"
,"url": "https://www.allrecipes.com/cook/3171266"
}
]
,"description": "This casserole uses frozen tater tots with canned cream of mushroom soup and is topped with sour cream-and-onion potato chips."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/SRnyrkKBbtymcpv0ezunRJhATNo=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/974567-yummy-tater-tot-casserole-Patti-Shropshall-4x3-1-569f672dbf1043e78b8ef0b51e5f7931.jpg",
"height": 720,
"width": 960
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Yummy Tater Tot Casserole"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.4",
"ratingCount": "124"
}
,"cookTime": "PT50M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "487 kcal"
,"carbohydrateContent": "31 g"
,"cholesterolContent": "65 mg"
,"fiberContent": "3 g"
,"proteinContent": "8 g"
,"saturatedFatContent": "19 g"
,"sodiumContent": "777 mg"
,"sugarContent": "2 g"
,"fatContent": "39 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT15M"
,"recipeIngredient": [
"1 tablespoon vegetable oil",
"1 large onion, chopped",
"1 (32 ounce) package frozen tater tots, (such as McCain® Tasti Taters)",
"1 (10.75 ounce) can cream of mushroom soup",
"8 ounces sour cream",
"1 cup melted butter",
"1.5 cups shredded Cheddar cheese",
"1 tablespoon ground black pepper",
"salt to taste",
"1 (7 ounce) bag sour cream-and-onion-flavored potato chips, crushed" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Preheat an oven to 350 degrees F (175 degrees C). Grease a large casserole dish."
} ,{
"@type": "HowToStep"
,"text": "Heat the vegetable oil in a skillet over medium heat; cook the onion in the hot oil until softened, 5 to 7 minutes. Mix the cooked onions, tater tots, mushroom soup, sour cream, butter, pepper, and salt together in a large bowl until the tater tots are evenly coated. Stir the Cheddar cheese in a little bit at a time until evenly distributed throughout the mixture; pour into the prepared dish. Sprinkle the potato chips over the top."
} ,{
"@type": "HowToStep"
,"text": "Bake until golden brown on top, 45 to 60 minutes."
} ]
,"recipeYield": ["12"]
,"totalTime": "PT65M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "CHOWHOUND"
},
"reviewBody": "Was YUMMY, just too salty. So I'm going to try a lower sodium soup next time. Also, I added about 1/4 C milk because the mixture didn't look creamy/moist enough. And added more shredded cheese on top. It turned out good, and mine was done in around 25 min."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Nonnisaysmangia"
},
"reviewBody": "I thought my family would love this; all ingredients they like. I made it according to directions without changes. No one liked it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DBARNMYER"
},
"reviewBody": "We changed very little, but did add frozen broccoli (1 lb.) and we sprinkled taco seasoning on our soup and cheese concoction before spooning it over the tots and broccoli. My son then sprinkled a bit more taco seasoning over the 9”X 13” casserole pan, before adding the last of the small 2-1/2 cup package cheddar cheese he sprinkled over top. My son is big on seasoning! Which I have found hard to deal with. My family was very bland growing up, so pepper and other strong flavors he likes to use, I sometimes find hard to swallow."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Laurahallie"
},
"reviewBody": "This was pretty good. I mostly followed the recipe because I like to do that the first time, but I did make a few small changes. I used a ready-to-serve, low-sodium cream of mushroom because it was what I had. Also used a tad more cheddar than called for: 1.75 oz of the sargento extra sharp cheddar. Finally, I added 1/3 tsp of cayenne pepper. Overall, the flavor was pretty good, though an entire cup of butter is absolutely not necessary, and a whole tablespoon of pepper is perhaps a little much. Instead, I would next time cut in half the amount of butter and add more variety in terms of the spices used (maybe some Italian seasoning? Smoked paprika? Garlic powder?) and would add more vegetables, perhaps a bell pepper or a jalapeño."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Louise S"
},
"reviewBody": "I did not have any soup or potato chips so I made it without. I also added an additional chopped onion plus 3 minced cloves of garlic, as well as half a tub of whipped cream cheese. It was delicious! No need at all for the soup or the chips. Everyone loved it! A great side dish that can be assembled ahead of time so great for Thanksgiving."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "beccwarnacutt"
},
"reviewBody": "This is still a serious household favorite! To make it more of a meal and less of a side dish casserole I add browned burger to it. I no longer use butter, instead letting the fat from the meat do the work. We have a 4 year old now so the seasoning is cut back too. Still use 2-3x the amount of sour cream - just because we love it. I start with foil on then remove it for the last 15 minutes after I add more chips."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Kimberly Hughes Bower"
},
"reviewBody": "This was horrible! Way too much black pepper."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "brykate"
},
"reviewBody": "Great base recipe! Fam loved! Sauteed sweet onion, added 1 lb ground beed + 1/2lb venison, lots of Montreal seasoning for meat layer under the potato mixture. Caramelized some onion for in the potato mix. I had 32oz bag of shredded frozen hash browns. Worked great! 9x13 55 min."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Tammy Treit"
},
"reviewBody": "For a super fast version of this I used pre-chopped frozen onion and skipped cooking the onions altogether. I also used just 1/2 a cup of butter which I did melt per instructions."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carol"
},
"reviewBody": "The family loved it! Next time I will cut the butter to a half cup, but otherwise wouldn’t change a thing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "TRELLA72"
},
"reviewBody": "O!! M!!! G!!!! These were amazing!!! I didn’t have chips but had French fried onions that I used. This recipe is definitely a perfect keeper!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ashley"
},
"reviewBody": "I love this recipe. I have made it several times. My husband loves it as well. I follow it exactly as it’s written. It is very good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mercedes Blackshire"
},
"reviewBody": "It was amazing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Ashley Willis"
},
"reviewBody": "I make this a lot. Instead of just using shredded cheese I also add half of a big velvetta block &amp; only half shredded cheddar. I add Frosted Flakes to the top &amp; pour melted butter over after everything is in dish. I also add a cubed layer of the velvetta on bottom before adding everything else. I top it with aluminum foil &amp; it turns out great everytime."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tima"
},
"reviewBody": "good comfort food. Kids and I all liked it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sandy C"
},
"reviewBody": "I topped the meat with a mixed vegetable to make it a three course meal."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Robin"
},
"reviewBody": "Didn't change a thing and my family loved every bite."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Crystal Richmond"
},
"reviewBody": "Amazing comfort food! I did alter it a little. I cooked 1 lb of hamburger with the onions before adding it to the mixture. I only used 1/2 cup of butter. I added a couple of freshly diced jalapenos and a couple of diced cloves of garlic to the mix as well. Added cajun seasoning and a touch of smoked paprika. Soooo good! we never have left overs. haha"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Indy Picker"
},
"reviewBody": "Way too heavy and greasy. Gave me a massive stomach ache. Won't make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Judi Gooch Orrick"
},
"reviewBody": "Seemed a little dry. I'm wondering if the layered recipes might be better than mixing everything together. Really good flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "terrvu"
},
"reviewBody": "fam devoured. i skipped browning onion and added some frozen mixed veggies instead (to lighten up).\nonly 1/2 stick butter (less greasy) and bag of cheddar cheese; mixed all ingredients before adding to tots.\nsprinkle w.crushed corn chips (which get eaten last in our house).\ncooked covered then broiled until warmed through. made it 2nd time with cream of chicken, and i think i liked it tad better."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ann"
},
"reviewBody": "We had this at a Fourth of July party yesterday. It was so delicious, I requested the recipe from the lady who brought it. The only change she made was to cut the amount of butter in half. Otherwise it was as written here. Everyone loved it and asked for the recipe. Definitely going to make this as soon as the weather cools down a bit, lol."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Darlene Ernst"
},
"reviewBody": "I'm giving this a 5 even though necessity (heavy snow) made me change a few things. I always use cream of potato soup in this type of casserole because I prefer it taste like homemade Au Gratin potatoes. I couldn't get to the store so I substituted the sour cream for about 5 oz of Half- n-Half and had to use regular potato chips. It was absolutely amazing! I can't wait for my family's next get-together to show this dish off."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Christina Peterson"
},
"reviewBody": "gave it four stars because I made some changes. I added hamburger and green beans and 1/2 cup cubed Velveeta. instead of chips because I didn't have any in stock, I put the shredded cheddar cheese on top. also used ranch dip in place of some of the sour cream. I would rate mine five stars with the additions, so I gave the original recipe four"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "misskris"
},
"reviewBody": "Very good. Also added a pound of ground sirloin."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carmen Wardlaw Cashat"
},
"reviewBody": "I made this and it was super! Instead of the potato chips, I crushed up some corn flakes with MORE butter and put on top. Not for the person on a diet but Oh So Good! It's also good left over, if you reheat it in the oven."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jorie Judisch"
},
"reviewBody": "I make this all the time, but as a Minnesota girl, I add 1lb of hamburger to make it a real 'hot dish'. I also do not put any butter in it at all now, after the first 2 attempts. (I did the first time and it was WAY too greasy, 2nd time, I halved it, and it was still too greasy) \n\nI use crispy crowns instead of full tater tots but that is only b/c I like them to be really crispy and I keep some out and top it with tater tots instead of the chips concept. (we love Sour Cream &amp; Onion chips though, so I have been very tempted to try it that way) but to me, that is how Tater Tot Casserole is supposed to be"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Brenda Moser-Hartley"
},
"reviewBody": "I love this recipe and with how many people ask me to make it, it's definitely good. It tastes good as written but for ease of clean up I use French's Fried Onions instead of sauteing onions. Tastes just as good but less mess."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lisa Marie Sicora"
},
"reviewBody": "So ridiculously delicious...You don't want to stop eating!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Catara"
},
"reviewBody": "It was good. Everyone in my house liked it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Alene"
},
"reviewBody": "Made this for a pot luck tonight. All that was left was the baking dish and spoon. This is a must make again recipe. So yummy as it says. Only change I made was to reduce the butter to 1/4 cup and that I melted in the skillet and sauteed the onions in."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "LucyFitz46"
},
"reviewBody": "This dish was hot and cheesy, which I'm always down for. I added minced garlic along with the onions, and reduced the butter by about five tablespoons. Next time I make it, I'll try to add more vegetables so I don't feel quite so much like a blimp afterwards. I will also sautée the onions before I add them, as others have suggested. There's a lot that can be done with this recipe to adapt it to your tastes, so don't be afraid to get creative!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "awpete"
},
"reviewBody": "It was wayyy to salty. Next time I'll try corn flakes. Otherwise I loved the blend of potatoes, cheese, sour cream, etc. Will definitely try again (without the chips). I"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Tammy Leger"
},
"reviewBody": "Sorry for the low rating. It had great flavour but too much butter."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cat"
},
"reviewBody": "This is so good, it's addictive!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Gina Gilliam"
},
"reviewBody": "I added crumbled sausage and green beans ;-)!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lis"
},
"reviewBody": "OMG! I do not care for potatoes, especially tater tots, but this dish may make me change my mind! I think I could eat this all day, every day and never get tired of it!! Even my son, who hates onions, came back for seconds!!\nMy changes: Instead of cream of mushroom soup, I used cream of chicken.\nI added some garlic powder (to taste).\nI topped it with French's French Fried onions.\nThere wasn't much left over, but what there was I fried up and ate with a fried egg. Yummy!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "TJG"
},
"reviewBody": "Everyone in the fam really likes ths bake!\n\nFor my version I substitute the Cream Of Mushroom soup with Cream of Cheddar soup and then add bacon. I omit the salt as the bacon usually puts in enough for me. I leave the chips off."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "dollyd"
},
"reviewBody": "This recipe was very good. The only changes I made were I added 2 cans of cream of mushroom and 1 package of Lipton onion soup mix just for some extra flavor. Everyone in the house liked this. I think the sour cream and onion potato chips really made the dish. I will definitely make this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "brenda"
},
"reviewBody": "I made this a second time and left out the butter and added a second can of soup. It was much less greasy and we enjoyed it more."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Stacy"
},
"reviewBody": "I made this and my family LOVED IT!!! Of course I tweaked it and put 1 lb of ground beef and added cream cheese, corn, and black olives. It was DELICIOUS!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "charlotte"
},
"reviewBody": "First, I completely left out the butter. I used light sour cream instead of regular sour cream. I browned 1 lb. of lean hamburger meat along with the onions in a skillet and then mixed in 24 oz. of tater tots with the soup/sour cream mixture. I put the mixture in a greased casserole dish &amp; baked it for 35 minutes &amp; then put the cheddar cheese on top and baked it an additional 10 minutes. I did not add any salt or pepper as my kids put ketchup on their tater tot casserole and that has enough salt in it. My kids ate it and liked it. Served it with a side of green beans. Very easy meal. Good meal to put together in the AM and store it in the fridge until you're ready to bake it in the evening."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "greedyedie"
},
"reviewBody": "Great recipe I put onion rings on top and it was great family asked me to make it again and put some bacon in it will try it this week."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Mrs. Tuggle"
},
"reviewBody": "Great always loved to make this due to it is so quick and easy. My husband loves it and my mom used to make it all the time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "msbeautybyrd"
},
"reviewBody": "My family absolutely loved this!! One stick of butter was what I used too and it was perfectly good and of course I tweaked it with a bit more seasoning...yummy is right."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Curt McLey"
},
"reviewBody": "Though this recipe was a little salty, it was delicious. Next time, I will reduce the amount of butter to one to one stick (1/2 cup) because it was a little rich, but other than that, it's a great side dish or could be used as the main course if some hamburger or other meat was added."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kim C Lewis-Brown"
},
"reviewBody": "Didn't have a lot of the ingredients so I used 16 oz of sour cream and a Lipton Onion Soup mix pkg, 1/2 cup of butter, 2 cups of cheddar cheese &amp; the Tblsp of pepper. Followed the recipe from the mixing of the ingredients on and it was a success!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "doingit4kk"
},
"reviewBody": "This will be my \"go to\" potato casserole recipe! I used only 1 stick of butter and I fried the onions in that, but I'm gonna take it down to a total of 1/4c butter. I also did not put the potato chips on top, it didn't seem to be missing anything. And I of course used the whole 2c bag of sharp cheddar cheese, why have only a 1/2c left in your fridge:)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Patti Shropshall"
},
"reviewBody": "We have made this a couple of times now &amp; it has quickly become a favorite dish. I omit the onions, use half the amount of butter and sprinkled the top with cheese &amp; bread crumbs instead of chips. This recipe is easily changed up to include other ingredients...we have added a can of corn and could easily add any other veggie or meat of choice. Yum!! :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "reinadelacocina"
},
"reviewBody": "Oh my, this is pure heaven in a dish! I mean this is the definition of comfort food. This is my new favorite staple of breakfast, brunch, and dinner. It's pure wonder. My husband loved it! What a wonderful treat on a cold winter day. To be honest with you I don't even know if I followed the recipe to a T, and I didn't have cheddar cheese so I used mozarella and it was still fabulous. Also I used regular ridged chips, not sour cream and onion. Fantastic. A++, thanks Jana!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "taheld"
},
"reviewBody": "very good everyone finished their plate. I loved the chips on top but i don't think that the salt is needed."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "prittykitty74"
},
"reviewBody": "This was good - but way too rich. And that's after I cut the butter out of the recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "YEOLDGREYMARE"
},
"reviewBody": "Very tasty! Modified it by adding cooked chicken breasts (diced), broccoli and roasted garlic cream of mushroom soup. Also used a parmesian/romano blend cheese with the cheddar. Next time will use 1/4cp of butter and wont add salt."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Malia"
},
"reviewBody": "This is literally SO full of fat and calories that my husband and I couldn't even finish the first serving."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Stasia"
},
"reviewBody": "This is a great basic recipe that you can easily tweak to your own tastes. I recommend, as a lot of people did that you reduce the amount of butter to a couple tablespoons otherwise it gets soggy. Also use a high quality sour cream, so that its not watered down. I tried it originally as written. The second time, I reduced the butter and added garlic. Instead of a regular onion, I tried green onions and did not saute' them and added two cloves of garlic. Just mixed everything together. And I used Ritz crackers instead of chips. It was really delicious. My next time I'm going to go back to the regular onion and try adding ortega chilis. Thank you Jana!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "bbbscarissa"
},
"reviewBody": "WAYYYYY too much pepper! My mouth is on fire! Maybe a TEASPOON instead of a tablespoon. I'm frustrated because now dinner is ruined."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tami"
},
"reviewBody": "this was a great recipe!! I only had minced onion on hand, and i reduced the butter down to bout a half cup... turned out great! not too greasy, and the topping was perfect! It was an excellent choice for a topping.. excellent flavor! Kids loved it and wanted seconds! =) Thanks for sharing!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Terri"
},
"reviewBody": "So good! Perfect for potlucks. I used 1 stick of butter and Kettle Cooked Creamy Mediteranian Herb chips that I had on hand. Turned out great! So quick and easy to prepare!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DeliveringThat"
},
"reviewBody": "Added a little ground turkey and turkey bacon -- AMAZING!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BramptonMommyof2"
},
"reviewBody": "Great recipe..u.sed same ingredients but made it healthier by using only 1/2 sup butter, non fat sour cream,and low fat cream of mushroom soup.Lved it an felt better about eating it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kja"
},
"reviewBody": "I give this 5 stars with some small changes. I put only 1/4 cup of butter in this and it was still delicious and not at all dry. I added turkey sausage and used low fat sour cream and topped it off with crushed Ritz crackers."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carol Clemmons"
},
"reviewBody": "This was really good! I added crumbled bacon, but followed the recipe otherwise. The whole family really enjoyed it- much easer than peeling potatoes, cubing, boiling, etc. to make potatoes au gratin."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "NancyDrew20"
},
"reviewBody": "It was just ok for our family."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "beaglerundog"
},
"reviewBody": "I cut the recipe in half, used some leftover creamed corn on the bottom of a 9x11 inch glass casserole dish. excellent."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sammey"
},
"reviewBody": "substituted cream of mushroom to cream of potato due to allergies and it was soo good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "tasha"
},
"reviewBody": "this is a family favorite at my house. I cut the sour cream in half or I leave it out all together (lactose promblems). I also leave out the chips if I don't have them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Jimithinger"
},
"reviewBody": "Pretty good. Not awesome, just...pretty good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Michael Harrold"
},
"reviewBody": "Found it salty, but very nice overall."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Kitchen Kitty"
},
"reviewBody": "I thought this was just okay. I followed the recipe almost exactly, with the exception on the amount of butter. I used maybe 1/4 cup butter, which I used to sauté the onions. I baked for 50 minutes, until the top was browned, but I found that the tater tots just sort of become all broken up and it was not that flavorful. I could see ground beef and/or corn working in there, and I might try that next time. On the plus side my partner had a second helping, even though she complained earlier that this was quite possibly the trashiest dinner ever!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Chef_Tejas"
},
"reviewBody": "This ones a keeper! Made this a few times for parties and will definitely keep this in my go-to's pile. We served at a turkey fry as a side item. I added chives and crumbled up cooked bacon to the dish."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lee Ann"
},
"reviewBody": "This is not for the calorie counter, the restricted sodium diet, or the low cholesterol diet. That said, it is delicious! I added celery and chopped mushrooms to the saute, and 1/2 can of Fiesta Nacho Cheese soup. I used one can each of Cream of Mushroom and Cream of Chicken. (Doubled the recipe for a big crowd). I would not add salt to this recipe, the chips on the top add plenty. We had this for our Easter dinner, big hit!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Amy"
},
"reviewBody": "Way too salty and greasy for me."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Gina Perkovich Baker"
},
"reviewBody": "Brought this to a pot luck banquet...went over real well! Even gave out the recipe to someone. Had to use cream of onion soup, since my body doesn't like mushrooms &amp; only had fried onions for crunchy stuff."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Julie Risner-Coleman"
},
"reviewBody": "LOL! My husband says this recipe deserves a 5 star. My family loved it! The only thing I changed was I used a 1/2 C of butter instead of 1c. It was excellent! This is a must add to my recipe box. I made this with BBQ Chicken &amp; it was great. Thank You!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "amber_marie29"
},
"reviewBody": "I loved this! I added 1 lb. of ground beef to it and made this a main dish!! It turned out wonderful!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "SherryLENelson"
},
"reviewBody": "I enjoyed this a lot. However, since my husband doesn't like sour cream and is a real meat eater, I replaced the sour cream with a pound of lean hamburger. It was a hearty, delicious meal that will be served again and again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "rebeccawparks"
},
"reviewBody": "i made this for dinner tonite!!!! omg...fabulous! a few changes tho...i only used 1 stick of butter and sauted the onions in the butter. i also added seaoning salt. my family loved it! this recipe is a keeper for sure!!!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Caelyn McLain"
},
"reviewBody": "Wonderful! I made this for my friends. In the middle of the night, someone turned my sour cream into french onion dip, so I held on the onion and used it. It was great! This will become a regular in the house."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "shirrell"
},
"reviewBody": "This was very tasty! Easy to make, and everyone in my family loved it, Not very diet friendly, but excellent dish. I did use only 1/2 of the butter called for, I just couldn't make myself use a whole cup!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tebako"
},
"reviewBody": "Holy Cow! I couldnt believe how much I fell in love with this receipe!?! It was great! Im planning on making it again for my family friends Thanksgiving dinner as well as for my family again within the next few weeks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Linda Kaylor Van Horne"
},
"reviewBody": "Excellent recipes ! Very easy to put together and everyone in the family loved the taste. Next time I make this I am going to try cutting the butter in half. There was an excess of butter floating around in the in the baking dish."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kathy Abernathy"
},
"reviewBody": "Very good! I may substitute the sour cream and onion with regular chips next time. Everyone raved about this at one of our potlucks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "erroxmysox"
},
"reviewBody": "It was pretty good, but it definitely needed a bit more cheese so I'll be adding that next time. Not my favorite, but definitely good for a quick, easy meal. Plenty of leftovers."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Melanie Courtney"
},
"reviewBody": "This recipe is awesome! Pretty easy to make, the kids are raving over it as I type. I used cream of chcken soup (out of mushroom), other than that, I didn't change anything. My kids also crumbled bacon over it and they loved it!! Thanks"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CatLovesD"
},
"reviewBody": "I'm giving this 5 stars with these changes: I added 1 pound of browned ground beef, used about 1/2 of a 32 oz bag of frozen tater tots (could use a few more, but that's all I had), a cup or two of frozen peas, added seasoning salt, garlic powder, black pepper, and a big dash of worchestireshire. I also used only about 1/2 cup of cheddar/mozzarella combo mixed in, then topped it with a handful of the same, plus a good sprinkle of mozzarella, a little parmesan, and crushed jalapeno flavored extra crunchy chips. Baked it at 425 for about 40 mins, covered with foil for the 1st 25 mins. The result was fantastic! Topping was awesome! Requested to be put in the regular rotation. Lots of ways this could be modified!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "We made two big trays because all my nephew and nieces were coming over, topped w/ sourcream and it was gone! Not a bite left over!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KissTheChefette"
},
"reviewBody": "Only used 1 stick of butter (1/2C) and 28 oz of tots. I also put all of the cheese called for on top (not mixed in) and omitted potato chips (put under broiler for about 5 mins to crisp up cheese). Before putting in the broiler, I sprinkled the top with garlic powder, salt &amp; pep. Also added about 2 tbs of french onion dip that was sour cream based for some oomph. Even my casserole snob/exec chef bf loved it...... which means ALOT in this house! Next time I may try to crisp up the tots first since it was kind of mushy, but that is just a minor revamp, that's truly not necessary bc this is great as is!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "zeee"
},
"reviewBody": "Very good. And there are so many ways to play with this kind of dish. I use cream of broccoli cheese soup and fresh, steamed broccoli florets and top with french fried onions. Good way to get your greens too!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LaurenH"
},
"reviewBody": "I loved this recipe! Cooked it tonight as a side dish and couldn't believe how good it was. The chips on the top were the best part! I think next time I will try putting some ground beef in it! Thanks for the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "cookinwithtwins"
},
"reviewBody": "I thought this was pretty good- it seems like another variation on the hashbrown casserole recipes out there. I doubled the recipe (to give half to a friend w/ a new baby); the only changes I made were that I used 1 C melted butter &amp; 1 chopped sauteed onion for the whole doubled recipe. I also used less cheese- probably about 1 C for the whole thing. All in all, it turned out pretty good- very filling. I think this would be good as a main dish w/ cooked chicken &amp; veggies added in, or even cooked groud beef. Also would be good at breakfast maybe w/ added sausage or ham."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "HANNAHGAIL001"
},
"reviewBody": "I thought this recipe was wonderful. It reminded me of everything you'd want on a baked potato. My kids loved it and I absolutely adore it too! I use PAM to grease the pan and that worked just fine....also, cut the butter back. It gets too greasy with the original amoutn. I've made it a couple of times and the second time I made a couple of changes to it and it still tasted the exact same. Instead of melted butter, I used about 3-4 T. of country crock (quicker and I was just throwing this together). Also, I was out of cheddar and used Mozzarella. It was equally as wonderful as when making it with cheddar. This is a great, quick, throw together type of recipe. I think it could be modified in many ways - my husband said bacon would be good in it...also, I've thought about broccoli as well. Anyway, great recipe! Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ruth m."
},
"reviewBody": "Made this for my mother's birthday party today, everyone really liked it! Thanks, I'll definately make this again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Justine"
},
"reviewBody": "This was fantastic! I followed the recipe exactly (except I bought store-brand tator-tots) and it was really tasty! I will do the same exact thing next time!!! (The sour cream and onion chips are a nice touch!)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "damnfino19617"
},
"reviewBody": "We love this recipe! I add a pound of ground beef and an extra can of cream of mushroom soup and use a teaspoon of black pepper instead of a tablespoon. Turns out great every time!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Susanna Standish"
},
"reviewBody": "Oh my goodness! DEEELICIOUS! I sauteed onions, and minced garlic then browned the ground beef in the onions and garlic. I needed the added protein to make this a main dish--- oh soooo good! Everything else I mixed together in a separate mixing bowl, setting aside some shredded cheese to sprinkle on top after assembled. After greasing pan I poured in the meat/onion/garlic mixture. Then topped it with the tator mixture. Instead of chips I used french fried onions and sprinkled cheese on top! Turned out absolutely scrumptious! Even my husband is now a tator casserole convert! :) Thanks jana!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MET"
},
"reviewBody": "I loved this quick recipe. I added a small can of mushrooms and used crushed seasoned croutons on the top. So Good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "greenbabby"
},
"reviewBody": "I gave this recipe to my friend to make for a party and I can't believe how great it came out. She used sharp chedder and everyone was asking for the recipe. This is my new favorite."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "katiemcd"
},
"reviewBody": "My new favorite recipe! So good, I could have eaten the whole thing myself! I used a little more cheese because I'm a cheese lover, and a little more salt, and on top I used french onion sunchips. LOVED IT! Thanks for the recipe, it's a keeper!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Shantal"
},
"reviewBody": "Good recipe, I really like the sour cream and onion chips on top! I made this for dinner as a sidedish to sloppy joes. I'm going to try adding some sausage and using it as a breakfast side dish. Thanks!"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/177229/yummy-tater-tot-casserole/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/1006/main-dish/casseroles/vegetable/",
"name": "Vegetable"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/17661/main-dish/casseroles/vegetable/tater-tots/",
"name": "Tater Tots&uml;"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/177229/yummy-tater-tot-casserole/",
"name": "Yummy Tater Tot Casserole"
}
}
]
}
}
, "about": [
]
}
]