				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Zucchini Brownies"
,"datePublished": "2020-06-18T23:06:01.000-04:00"
,"dateModified": "2022-07-25T06:52:05.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Marian"
,"url": "https://www.allrecipes.com/cook/24326257"
}
]
,"description": "These zucchini brownies are rich, fudgy, and delicious. They&#39;re topped with an easy to make chocolate frosting for an irresistible treat!"
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/yYwxD0GtjJwJbxU3n0jj-SHmT4w=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/103496-2b066aac1b6647f996447c02e72c9909.jpg",
"height": 960,
"width": 960
}
,"video": {
"@type": "VideoObject",
"embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=2998568692001",
"description": "Moist chocolate brownies with a secret squash surprise.",
"duration": "PT3M29S",
"name": "Zucchini Brownies",
"thumbnailUrl": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/1033249144001/46cb6e6e-5b8a-4d93-8578-cae8da42432b/b84e6442-2444-4a23-870d-4c94f8acf873/1280x720/match/image.jpg",
"uploadDate": "2021-07-15T16:13:51.248-04:00"}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Zucchini Brownies"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.5",
"ratingCount": "3082"
}
,"cookTime": "PT25M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "209 kcal"
,"carbohydrateContent": "33 g"
,"cholesterolContent": "0 mg"
,"fiberContent": "2 g"
,"proteinContent": "2 g"
,"saturatedFatContent": "2 g"
,"sodiumContent": "200 mg"
,"sugarContent": "23 g"
,"fatContent": "9 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT15M"
,"recipeIngredient": [
"1.5 cups white sugar",
"0.5 cup vegetable oil",
"2 teaspoons vanilla extract",
"2 cups all-purpose flour",
"0.5 cup unsweetened cocoa powder",
"1.5 teaspoons baking soda",
"1 teaspoon salt",
"2 cups shredded zucchini",
"0.5 cup chopped walnuts",
"6 tablespoons unsweetened cocoa powder",
"0.25 cup margarine",
"2 cups confectioners' sugar",
"0.25 cup milk",
"0.5 teaspoon vanilla extract" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Preheat the oven to 350 degrees F (175 degrees C). Grease and flour a 9x13-inch baking pan."
} ,{
"@type": "HowToStep"
,"text": "Mix sugar, oil, and 2 teaspoons vanilla in a large bowl until well blended. Combine flour, 1/2 cup cocoa, baking soda, and salt together in a separate bowl; stir into sugar mixture. Fold in zucchini and walnuts; spread batter evenly into the prepared pan."
} ,{
"@type": "HowToStep"
,"text": "Bake in the preheated oven until top is dry and edges have started to pull away from the sides of the pan, about 25 to 30 minutes. Let cool, about 20 minutes."
} ,{
"@type": "HowToStep"
,"text": "Meanwhile, make frosting by whisking 6 tablespoons of cocoa and margarine in a pan over medium-low heat until smooth and glossy; set aside to cool."
} ,{
"@type": "HowToStep"
,"image": [
{
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/yYwxD0GtjJwJbxU3n0jj-SHmT4w=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/103496-2b066aac1b6647f996447c02e72c9909.jpg"
}
]
,"text": "Blend confectioners&#39; sugar, milk, and 1/2 teaspoon vanilla together; stir into cooled cocoa mixture. Spread over cooled brownies before cutting into squares."
} ]
,"recipeYield": ["24"]
,"totalTime": "PT60M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Rick"
},
"reviewBody": "We really liked these brownies, though I did make some changes for our family. (I really wish that I could make change notes separate from the review since, in my opinion, once I change the recipe I'm really rating *my* version instead of the original, an opinion that others on her have, but I digress...) I used greek yogurt instead of the oil, increased the sugar to 1 3/4c (the family has a sweet tooth), used whole wheat flour, and used butter instead of margarine in the frosting. Otherwise I made these according to the recipe and they turned out great. It's a great way to use up some of the excess zucchini that comes out of the garden and the family loves the sweet treat."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "feltenroseyahoocom"
},
"reviewBody": "No eggs needed. It is not a misprint. I started making these years ago after my child was tested &amp; diagnosed with an egg allergy (even once baked). The 'batter' is very dry. I \"pat\" it into the baking pan. The zucchini releases moisture as it bakes &amp; the brownies come out fine. These brownies are more on the cake-side (vs. fudgey), but it is wonderful for a child that cannot otherwise have a brownie. If you half this recipe, it bakes well in an 8×8 pan."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "pequea"
},
"reviewBody": "The only changed I made was add 1/2 cup of water ..last time I made it came out perfect .. not sure if I use wetter zucchini. I didn't add and egg .."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sonya K"
},
"reviewBody": "Made these to use up some zucchini from my garden and couldn't be more pleased with how they turned out. I didn't make the frosting but put dark chocolate chips on top instead. Absolutely amazing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bonnie Cohn"
},
"reviewBody": "I agree with another review, skeptical because of no eggs. These are fantastic. I added chocolate chips instead of nuts. Not sure if I will frost them or just add powdered sugar...super good without either!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Laura Cromer"
},
"reviewBody": "I suspect that this recipe may come from a humid region. I live in the desert and the mix was MUCH too dry. I added a 1/4 cup of apple sauce and extra zucchini ( my garden zucchini is plentiful) and it turned out well. The family approved will use this recipe again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "MaryEllen Malloy"
},
"reviewBody": "I have made this three times. The mixture is very dry, I wouldn't call it a batter. First time I added 2 eggs. It was a delicious cake. Second time, it worked. Third time, much to dry, so I added milk and got a cake again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Christine Toth-Takacs"
},
"reviewBody": "Brownies turned out light, but chocolatey rich. Made w/o nuts this time. Used fresh zucchini and had to add 2T H2O. This type of frosting is amazing but sets up quickly (I've made a diff version w evap milk &amp; choc chips) so I mixed it all in the saucepan and immediately spread on cooled brownies. Glad to have another way to make frosting when I find I don't have evap milk. Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jenna Dougherty"
},
"reviewBody": "TRUST. THE. PROCESS. I’m telling you people, I was scared at first. It will seem so dry and you have to pretty much smoosh it into the pan. But when you add that chocolate frosting, OH LAWD. I will never make brownies another way again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "ccam03"
},
"reviewBody": "I was excited to try this recipe, as my in-laws' garden is always overflowing with zucchini. The only change I made, which I'm not even sure you can call it a change, is that after grating the zucchini, I let it sit in a bowl on a paper towel to absorb some of the excess moisture. This was done mainly because I was in the middle of making a few other dishes, and I grated the zucchini when I had time knowing I'd have to come back to it later. When I was ready to start the brownies, the paper towel was soaked through, and there was still plenty of liquid in the bottom of the bowl, which I did not pour into the mix. That being said, the brownies came out great! Extremely moist with no vegetable after/under taste. I don't usually frost brownies, but I do normally follow a new recipe to the letter and make changes if I make it again. When I make these again, I will probably pass on the frosting. It did have a good taste, but it was too much chocolate for my liking and made the brownies more like a cake. Four stars for with frosting; five starts without the frosting!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kae A Done"
},
"reviewBody": "My family loves this recipe! I leave out the walnuts and have used mint flavoring in the past for a different flavor, but these never stick around long when I make a batch of them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Michelle "
},
"reviewBody": "Great brownie... added chocolate chunks , skipped the frosting and just sprinkled powdered sugar on top, everyone loved them!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tootsabell"
},
"reviewBody": "These were super moist and delicious and you couldn't taste the zucchini at all. Two thumbs up! Thanks for sharing :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tahere Moazez-Godoy"
},
"reviewBody": "Absolutely delicious! this is a \"must have handy\" recipe for chocolate lovers like me =) Update: I actually have been making these brownies with just one cups of sugar and it turns out perfect. Also, I don't usually add frosting to my cakes or muffins, so I can't comment on that part, but the brownies themselves are spectacular =)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DORISTAKI"
},
"reviewBody": "Amazing so fudgy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sobotta"
},
"reviewBody": "Makes great chocolate cake, better than the brownies. Add an extra egg."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "30biancachappell"
},
"reviewBody": "I followed this recipe exactly and the batter was all dry i read that itll moisten and it didn't was hard and dry after baked. Frosting is good though"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "queenbugs"
},
"reviewBody": "Omg!! so Good! Only made 1/2 the frosting recipe, was enough"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "pam hollaway"
},
"reviewBody": "I was worried at first - my “batter” was more like kinetic play sand. I made them in a muffin tin &amp; added a cup of semi sweet morsels to the batter before baking instead of frosting later.these have a lovely crust on top &amp; are delightful"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Tina"
},
"reviewBody": "As per suggestions in other reviews, I did not drain the zucchini, and when adding the flour, I alternated with the wet zucchini. This did help with moisture but it still was not a pourable batter. I scooped the batter into a pan and spread it with a spatula. They’re very good. Can’t tell that there is zucchini in the brownies. I added additional chopped walnuts over the icing"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jean Allen"
},
"reviewBody": "These were great! So surprising. Great texture and I had em with some whipped cream!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Great way to use zucchini. Delicious brownies"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "squeeziebrb"
},
"reviewBody": "These are delicious! I would not call these brownies though, this is a chocolate cake. If you are wanting fudgy brownies, these are not it. I followed the recipe, but without adding nuts. Next time I will reduce the baking soda from 1/ 1/2 tsp. to 1 tsp.\nAlso the frosting is yummy, but the instructions are goofy. Do not melt the butter with the cocoa powder then add it to the powdered sugar. You will have lumpy frosting. Instead blend the powdered sugar and cocoa powder together. Add the melted butter and vanilla to the milk, then pour the wet ingredients into the sugar/cocoa powder. Mix well with a hand mixer. \nThese are delicious! My husband who hates zucchini had no clue it was in there and kept saying how yummy they were. I eventually told him and he didnt care."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kristen"
},
"reviewBody": "AMAZING!! My family loves brownies and these are hands down the best we’ve had. We didn’t use the frosting, and they certainly don’t need it. The only thing I did different is tossed in about 1/4 cup chocolate chips because I made a chocolate zucchini bread before this and I had a few left over."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "HappyOne"
},
"reviewBody": "These are in the oven now, dry, dry, dry. Whatever in the world?"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Alyssa Graham"
},
"reviewBody": "These are amazing! It’s not a typical brownie “batter” so don’t be worried when it’s crumbly, just press it down into the pan. Once baked the top might look a little funny but once you frost it you can’t tell. I highly recommend them!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jayelle"
},
"reviewBody": "I had an abundance of zucchini gifted to me. After making 20 loaves of bread, I got bored. I found this recipe and was skeptical. I read a LOT of reviews. I wanted to add an egg so badly, but I didn’t and glad. It’s true when you pour the “batter” in the pan, it’s like pouring a bowl of sand in there. I was very nervous about that. I gently patted it down. I baked for 30 minutes. They aren’t very attractive so I decided to proceed with the frosting. I was 1 Tablespoon short of cocoa powder for the frosting but it turned out perfect. I’m not a fan of sweets, but had to try these before giving them out to people since they have zucchini in them. I couldn’t stop eating them!!!!!! They are AMAZING!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Meg Sharp (Singular Meg)"
},
"reviewBody": "I replaced 1/2 the oil with an equal amt applesauce, and used 1c whole wheat and 1c all purpose flours and it turned out great! Definitely need to mix well at both steps, recommend using a mixer."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Maria "
},
"reviewBody": "I LOVE this recipe!! I made it last summer too (zucchini from our garden)! I ALSO made a special one for my daughter. She found out this year that she needs to be on a special diet. I just substituted with Red Mill 1 to 1 (gluten free flour) &amp; Country Crock Plant Butter. Came out great!! She is so excited to try it Other than that……I wouldn’t adjust a thing"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shelley Penney"
},
"reviewBody": "It would be helpful if someone added a pic of what the batter should look like- I followed the recipe and it was dry- like so dry that the powder flour mixture wouldn't even dampen. \nI had grated my zucchini first and let it sit, but we haven't had a ton of rain this season, so I had to add water. I doubled the recipe and ended up adding a cup of water. \nThankfully I have made brownies before and I knew why the batter should look like. \nWater content of zucchini and other fruits and vegetables can vary. \nThe batter should be thick enough to hold it's shape and slowly spread when you dump it in the pan. \nHaving said that- this is an absolutely delicious brownie. My family devoured it and no one suspected there was zucchini in it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jeannette330"
},
"reviewBody": "The first time I made it I followed the recipe exactly, and it came out like a lovely torte."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Maria Stokes"
},
"reviewBody": "Thanks for a great recipe! The first time I made it, I did not sweat zucchini first and the batter was dry, as indicated. Brownies were super fudgy! The second time, I sweated the zucchini (a lot of moisture went to the paper towel) and the batter turned out moist resulting in delicious, cakey brownies. For us, the frosting was overkill on the fudgy version, but a nice compliment on cakey version (but not necessary and could be enjoyed without, too). We prefer cakey brownies"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lilian Nabutete"
},
"reviewBody": "Followed the recipe exactly as written and these came out perfect ??. I would recommend after icing them and cutting up to leave them in the fridge overnight before eating...they tasted so much better the next day."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kristy"
},
"reviewBody": "My 8 year old daughter and I made these this morning. I had bought too much zucchini for a different recipe and she wanted to bake something so we came across this recipe. We followed the recipe as written and they turned out so delicious! A big hit in this house and we’ll definitely make them again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Marie S"
},
"reviewBody": "Came back from the potluck dinner tonight to tell you there was not a speck of the brownies left. My husband did eat one and he liked it a lot but still does not know about the Zs. So there you go. Next time I will increase the Zs if they are dry."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Laura Gendron"
},
"reviewBody": "I never write reviews but these brownies were SO good!! I followed the recipe exactly. To prepare the zucchini I ended up putting the pieces (with the skin on) into my food processor and making a puree. This could be why my brownies were so moist. These are my new go-to brownies recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Andrew Grohowski"
},
"reviewBody": "These brownies are great, but the baking time is way off. The first time I think I doubled the time and they came out great. The second time I did the 25-30 minutes and the mix is still all granules."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "beckyzahn"
},
"reviewBody": "I followed this recipe as written and used zucchini and yellow squash. I used a food processor for the squash and let it rest while preparing the rest of the recipe. Before adding the squash to the mix it looked really dry, but don't worry, it mixed right up and looked like cake batter. I cooked some in a rectangular pan ( I did't have the size the recipe called for) and the leftover in mini muffin tins. It all cooked up like very moist chocolate cake. I tried it without the frosting, it was pretty good, but not super sweet so I decided to make up the frosting and it worked. It feels more like cake, not brownies, but who cares, it's chocolate with squash and you'd never know!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Columbier"
},
"reviewBody": "Delicious! Very moist, not too sweet, icing was very good, also not too sweet."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cindy"
},
"reviewBody": "Took these to a meeting of a youth group (teens) I work with. They ate 2 full pans of them! Gone!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Joltn"
},
"reviewBody": "I checked and rechecked that I had all the right ingredients since it looks nothing like brownie batter. Nothing about this looks like the normal wet batter. Don’t add an egg or liquid. I did press the granulated “batter” into the pan a bit. They turned out amazingly sweet and fudgy...borderline too sweet but awesome!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Grulla"
},
"reviewBody": "This was very good, the batter seemed dry, so I did add 2 eggs to the batter (it did not call for eggs). It baked up like a light cake, not too sweet, I did not add the frosting, as we like cakes without frosting. Very moist &amp; fudgy.\nWill make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tashara"
},
"reviewBody": "Made this with slightly more zucchini than called for (1/4 cup more) since I didn’t want to waste the last of the zucchini I was shredding for this recipe, but followed the rest of the recipe exactly. It was absolutely divine!! Everyone in my family gobbled it up within 24 hours. Currently planning on making another one tonight!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Moe'smama"
},
"reviewBody": "So moist and chocolatey you will love them. The icing is a compliment to years gone by of my mom making Texas sheet cake. Thanks for posting this recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "anna"
},
"reviewBody": "Wonderful and super easy.. And don't panic when the \"batter\" is super super super dry.. Walk away for about 5 mins.. When you go back you won't believe the difference in the batter. Now moist and wonderful.. Makes very moist brownies.."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kanable"
},
"reviewBody": "I doubled this recipe the first time I made it. I initially grated my zucchini.... then ended up pureeing it for finer pieces. These brownies were amazing, and you couldn’t even notice the zucchini. Make them for your family or a group, they are filled with love!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carol Yohe"
},
"reviewBody": "I am happy with the results. Pay extra attent tion to blending dry ingredients to avoid a hint of baking soda taste.\n\nWhen preparing zucchinni eliminate most of the moisture, but not completely dry."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Donna"
},
"reviewBody": "These were excellent! The only change I made was to use BUTTER instead of MARGARINE in the frosting. YUMMY!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Ginger"
},
"reviewBody": "These brownies are pretty good. Not horrible. Texture is a little cakey but \nstill chewy. The flavor is chocolatey similar to a vegetable oil/shortning based brownie. I'm not sure I would make them again. Novelty way to use up a zucchini"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Maria"
},
"reviewBody": "Love. Love. Love. It's more like a brownie crumble, but I will never use a different brownie recipe again. The first time, I didn't even frost them. This time I'm going to try the frosting. I can't wait!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jen Comstock"
},
"reviewBody": "Fantastic! This is a great recipe exactly as written. Make sure to choose a fresh zucchini wisely - small to medium sized, rather than a large, woody one. This is a keeper. Thanks"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Mary Songer Willard Frye"
},
"reviewBody": "This is a pretty easy recipe, and the brownies taste great. Very very sweet. I didn't know what to expect without eggs or milk. But as zucchini does, it \"sweat\" into the batter. Very moist."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tammy Stephenson"
},
"reviewBody": "It was easy to make but did appear dry once mixed. I trusted once it was cooked that the moisture would come from the zucchini. It did!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Skyler Murray"
},
"reviewBody": "Don't drain the zucchini! This recipe expects you to not squeeze the water out. I did and before I put in the zucchini I saw how dry the ingredients looked. I was making a double batch so I had to grate another four cups of zucchini. These turned out great. They didn't crisp up like normal brownie recipes do so that is my only knock on the recipe. Otherwise it is moist and amazingly chocolately."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Kate Meinhardt"
},
"reviewBody": "I can't understand why anyone raves about this receipe. It was so dry even after adding eggs that I had to mix it with my hands. This was more a cookie dough consistency rather than brownies. WAY to much work. Brownie batter should be thick yet pourable."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Chris"
},
"reviewBody": "It is very moist, but I agree very cake like. It’s good though."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Michelle Hamilton Ulmer"
},
"reviewBody": "Very good way to use up zucchini. I was short by 2/3 c of zucchini so added in about a half cup of water. I also added a tsp or so of cinnamon and 1/4 tsp cayenne. Skip the icing and serve warm w ice cream."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Madison Dowell"
},
"reviewBody": "I made a few changes, but I have no idea what I messed up in order to make these brownies. They are bitter in weird spots and weirdly colored, which I’m assuming means I didn’t mix them enough and maybe had bad zucchini. My advice? Follow the recipe to a t so you don’t end up with whacky brownies."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rhonda"
},
"reviewBody": "These were wonderful, easy to make, I did however add 1/4 teaspoon homemade mint extract to brownies along with the vanilla. I also added homemade mint sugar to brownie batter before putting in oven. I did not make the frosting. These brownies had a minty chocolate taste. My family devoured them, I wish I had made a bigger batch, I only made 12 to see how they turned out."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Janelle Trefsgar"
},
"reviewBody": "Recipe turned out amazing! Baked for 30 minutes and the brownies were moist and gooey. The mixture appeared dry, but the zucchini solved that problem! We used a bitter zucchini so the sweet and bitter balanced quite well. No need for frosting on this recipe. So happy with the results."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "T.T.'s Place"
},
"reviewBody": "Let me first start by saying that I would not recommend this recipe. I noticed a lot of people had trouble with the consistency of their batter being too dry. I didn't have that problem. I think it all depends on how much juice is produced by the shredding of the zucchini. I had plenty of juice because I shredded mine very small. However, I did have trouble getting mine to cook all the way through in the middle. I had to leave mine in the oven for so long that I thought they would end up burning on the bottom before the middle was able to cook. Once It was done, it came out with the consistancy of a cake rather than a brownie. They don't really taste like brownies either. I ended up whipping up some peanut butter glaze to try and salvage the recipe. I poked holes in it and turned it into a poke cake hoping that the glaze would sink down inside and give it a better flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kellyr"
},
"reviewBody": "I loved this recipe! I used coconut oil and cut down the sugar to 1 c. It was fantastic! My family loved the fudgy texture of these brownies! And they have zucchini, so that makes them healthy, right? I will definitely make this again!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shari Stewart Burger"
},
"reviewBody": "Made these tonight with a few adjustments. Added 2 T water &amp; adjusted the sugar to half granulated/half brown sugar. Put brownies in pan and then added pecan pieces on top before baking. When they came out of the oven sprinkled shredded vanilla bar on top as an icing. Not overly sweet but very good. More cake then fudgy. Will make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lovemybc"
},
"reviewBody": "These are Sooo good! I added a little cinnamon and I healthified it a little, replaced the 1 1/2 c. refined white sugar with 3/4 c. pure maple syrup, the white flour I substituted whole wheat pastry flour and replaced the frosting -instead just added 60% cacao chocolate chips-didn’t really need frosting. They were still awesome!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jodi Macy Moss"
},
"reviewBody": "Everyone loved it. Moist beyond belief. And chocolatey. Could not believe I used up zucchini from the garden. Great recipe. Highly recommend.\nVegan friendly recipe. Without icing"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Toni Romero"
},
"reviewBody": "I made these yesterday for our first gathering of more than 10 people since the pandemic began. I made one pan for 17 people and everyone loved them. The bonus is that adjusting the frosting recipe to use almond milk instead of cow's milk made them vegan, too! The three people attending who maintain a plant based only diet were especially thrilled to have such a rich chocolate dessert. No one guessed there was zucchini in the brownies. This is my favorite recipe to make and give as a surprise gift to friends and family."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cheryl Cunningham Ballard"
},
"reviewBody": "These brownies are surprisingly good ! Moist and delicious . I used a food processor for my zucchini and did not try to drain it or squeeze it dry. I threw in a few semi-sweet chocolate chips and made the frosting per the recipe. If I had not made these myself I would not even realize that they contained zucchini."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "S. Dusseau"
},
"reviewBody": "Very, very dry...wont make this again"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Dave Fotsch"
},
"reviewBody": "Added semi sweet chocolate chips with the walnuts because, well, chocolate."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "RosieV400"
},
"reviewBody": "Mine came out too moist. I wanted to be able to slice them neatly and freeze some, but they were too wet. Taste was good. I'll use them as a base for ice cream sundaes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rosie Wiklund"
},
"reviewBody": "I'm an avid gardener and its zucchini season. Yesterday we made pumpkin muffins so I wasn't in the mood for another quick bread. \nI made these and I'm SO happy I did. It's a beautiful dish. \nI did make 2 important alterations. \n\nI used a piece of a 6 lb zucchini. When they get that size they lose some of their moisture content. I looked at my mix and it looked like DRY compost. Even when the zucchini released its moisture these were just NOT going to be okay. \nAnd THAT is why I think some people are calling these awesome brownies DRY. \nIf your batter looks very very dry it probably has a lot to do with your zucchini! \nI added 1 egg. Then I had a very thick mixture. \n\nI hate when my brownies stick to the pan so I added a sheet of parchment paper and tada. \n\nDespite the changes I'm absolutely giving this 5 stars and I hope you'll try this recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Renee Rutlidge"
},
"reviewBody": "Very tasty, so long as you keep something in mind. This recipe gets its moisture from the zucchini, so if you don't pack the cup with it or go a little over, you will end up with a dry brownie. You can't taste the zucchini at all, and my 3 year old loves it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Neva"
},
"reviewBody": "So easy! Batter is very thick so have to pat lightly into pan. But puffs up nicely when baked. Very chocolatey &amp; my grandkids couldn't believe it had squash! Will be making this again to share."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Heather"
},
"reviewBody": "At first I was incredibly disappointed in the results, but then I realized my only real issue with this recipe is the title. Once I stopped thinking of it as a brownie and accepted it as a cake, all my reservations vanished. It's a rich, moist, beautiful, delicious cake that my entire family LOVES, and my children actually ASK me to make over any other sweet. I made no additions or substitutions, and while it is cake, I've not yet found any brownie recipe to top it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "oomKhalid"
},
"reviewBody": "Yum"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Laura S"
},
"reviewBody": "I'm so glad I read the reviews because if I hadn't, I likely would have called it a failure before even putting it in the oven because of how dry and crumbly the \"batter\" was. So glad I followed through because these were a delicious way to use up some zucchini. They were definitely more fudgy than cakey. I was going to add chocolate chips instead of nuts because my kids don't like them and I totally forgot and ended up just sprinkling them over the top of the brownies right after I took them out of the oven and didn't even bother making the frosting, although I bet it would be equally delicious. I did reduce the sugar by 1/4 c, because I always reduce the sugar in most recipes and thought they were sweet enough. This is a winner!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Emma Robinson"
},
"reviewBody": "made it and its wonderful. was very very dry. so i pushed the mixture in to the tray. also when measuring a cup of courgette I pushed it down into the measuring cup and added just a little bit more just in case it was to dry. came out moist. would add choc chips next time"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mackinzie Lowman"
},
"reviewBody": "I was amazing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Katherine Pauletti"
},
"reviewBody": "I used olive oil instead of the canola, used Truvia in place of the white sugar, whole wheat flour, added in extra walnuts and dried coconut to the batter. I also had to add in about 3/4 cups water to the batter to give it a brownie consistency. I also used coconut oil instead of margarine in the frosting. WOW. These are good. More cake-like consistency, but so moist and fudgey. Definitely a hit"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "destiny"
},
"reviewBody": "I really enjoyed this as did my kids and sister, I've made it twice now, once with alot of random little changes (do NOT overdo it on the zucchini I'm a big believer that more is always better but not in the case ahah wayy to fudgey)\nAnd last night the recipe as written (used a little less zucchini than what it called but only because I ran out) and it was amazing.. definately use the 2 cups it calls for but no more than 2.5 if ur like me lol .. super soft and gooey goodness and even tastes great cold.. I suck at making brownies but for some reason I rock zucchini brownies every time lol very good I will update to a 5 star once I make the recipe with the 2 cups it calls for not more nor less lol next time I'll be buying an extra one just in case"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nehdia Hashemi"
},
"reviewBody": "Just amazing !!! My kids made the brownies using this recipe and it was so easy to follow and came out perfect ! The best brownies I’ve ever had !!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Xuan Trinh Groves"
},
"reviewBody": "I added apple sauce instead of vegetable oil. Then I substituted Pyure (Stevia) for sugar, which I used half of the amount of sugar that was called for, in the original recipe. I also used Kodiak buttermilk pancake mix instead of flour. Because the Kodiak mix has baking soda and salt in it, I used a little less than what the recipe called for. The pancake mix adds protein because it contains whole grain flour. These brownies turned out amazing. I ate more than half of the pan myself in a few days and I didn’t feel guilty."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ettienne Zantop"
},
"reviewBody": "I love it and you can easily make it vegan too! One of my favorite things to take to work to share with coworkers!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Hannah Kitt"
},
"reviewBody": "These are amazing!! I didn’t make the frosting as these were so fudgey and moist on their own. The batter was very dry so I did have to press it into the pan rather than pour, but after baking they were phenomenal. I can’t stop eating them!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jennifer McNeill"
},
"reviewBody": "this was by far the best brownie recipe we have made"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Kayla"
},
"reviewBody": "I followed this exactly and the batter was way too dry. Unless you have a super wet zucchini I definitely suggest adding a couple tablespoons of water to the batter."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Dustin Hartlyn"
},
"reviewBody": "Highly recommend blending the zucchini in a food processor. \n\nIn between cake and brownies, but these don't make my wife feel sick like brownies normally do. \n\nOver all I really like them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "bsr8057"
},
"reviewBody": "Followed exactly except no walnuts. Found it rather bland ... disappointed."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "serendipity2043"
},
"reviewBody": "Excellent -- I was skeptical about adding zucchini to my favorite dessert, but with a fridge full of zuc's, I had to try it. And I am so glad I made it just like the recipe! The brownies were moist and fudgy with just the right sweetness. The frosting was the perfect compliment (although the brownies were delish all by themselves). I didn't tell anyone about the secret ingredient and NO ONE could tell these weren't the traditional sweet treat. I will be making these for years to come. Thank you for sharing this delectible confection!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Charlotte Walker"
},
"reviewBody": "I made 2 slight changes - 1 used 1 very large zucchini &amp; omitted the walnuts. My pan was slightly smaller - 9x9. My cooking time was double as there was so much courgette. The result wasn't brownie like for me - but it didn't matter. With the frosting, it made an incredibly moist &amp; decadent chocolate cake. I think with less zucchini it would have been more brownie like but we utterly loved it. Definitely a keeper for me! Made this non baker look like a kitchen genius!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Mandykat1"
},
"reviewBody": "I followed the recipe and they are ok. I was hoping to be able to trick my 7 year old into eating some vegetables and unfortunately he wouldn’t way them. My 4 year old ate half of one and said he liked it so we’ll see. I had to bake them for an extra ten minutes and they were still really gooey."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "michele"
},
"reviewBody": "Very good and moist. Easy to make"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jeannette"
},
"reviewBody": "My husband was a skeptic when he saw zucchini goes in it so he tried them and loves them I’ll be making these a lot"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Ursula Zamora"
},
"reviewBody": "Good recipe once you realize the originator forgot the 2 eggs needed in the recipe, added to the oil &amp; sugar at the beginning of the recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Marni Alexandra Gerbert"
},
"reviewBody": "I did put chocolate chips in mine instead of walnuts. Cooking times do very, the zucchini consistency can make it a little mushy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sverner"
},
"reviewBody": "These are very good! The “batter” is somewhat crumbly, so I wasn’t sure if I had done something wrong; but I patted it into the pan, and the brownies turned out great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Melanee Van Ee-Mortensen"
},
"reviewBody": "Followed and added 1 c mini chocolate chips. Split sugar to half dark brown and half white. A fun add in is 16 Oreos crushed by hand and folded in at end. Takes five to ten min longer. Makes a moist fudgy brownie."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Kaitymcmasters"
},
"reviewBody": "Mine turned out fairly dry and I followed the recipe exactly until the end when I had a crumble to mix my zucc into so I added more oil to make it smooth figuring the water from the zucc would help the rest of the way. They were still dry and barely held together . \nThe frosting recipe is fabulous though and they were still tasty. \nI would make it again but I would sift my flour prior to measuring. Perhaps just normal scooping gives too much flour and made me have issues."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sonnet"
},
"reviewBody": "I've never made a good batch of brownies before. These were delicious! Not a bit dry! I'm so happy to have found this recipe."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/25112/zucchini-brownies/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/1059/fruits-and-vegetables/vegetables/",
"name": "Vegetables"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/1881/fruits-and-vegetables/vegetables/squash/",
"name": "Squash"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/25112/zucchini-brownies/",
"name": "Zucchini Brownies"
}
}
]
}
}
, "about": [
]
}
]